{
  "id": "pprofile_68176",
  "type": "player_bio",
  "player": "Ashutosh Sharma",
  "full_name": "Ashutosh Rambabu Sharma",
  "dob": "September 15, 1998",
  "role": "Batsman",
  "batting_style": "Right Handed",
  "bowling_style": "-",
  "teams": [
    "Punjab Kings",
    "Delhi Capitals",
    "Railways",
    "Madhya Pradesh",
    "SPJ Cargo"
  ],
  "bio": "Ashutosh Sharma, a right-handed batsman from Ratlam, Madhya Pradesh, has been making waves in the cricketing world with his explosive batting style. Known for his aggressive approach, Sharma's journey began at the tender age of eight when he moved to Indore to train at the Madhya Pradesh Cricket Association’s residential academy. His cricketing idols, Naman Ojha and Suryakumar Yadav, have inspired his playing style, which is characterized by a fearless attitude and a penchant for big hits. Sharma's rise to prominence came during the Syed Mushtaq Ali Trophy, where he shattered records with an 11-ball 50, surpassing Yuvraj Singh's legendary feat. His power-hitting prowess was further highlighted in an inter-railway match, where he scored an astonishing 200 runs off just 60 balls. These performances caught the attention of IPL scouts, leading to his acquisition by Punjab for the 2024 season. In the IPL, Sharma showcased his potential with a standout innings of 61 runs off 28 balls against Mumbai Indians, demonstrating his ability to perform on the big stage. Despite his limited opportunities in domestic cricket, Sharma has consistently impressed with his batting. In the Ranji Trophy, he scored a remarkable 123 against Gujarat, showcasing his ability to anchor an innings. His List A career has also been noteworthy, with a high score of 75 against Sikkim and a strike rate of 126.38. Sharma's T20 performances have been particularly impressive, with seven fifties to his name, highlighting his capability as a match-winner in the shortest format. Sharma's career statistics reflect his growing stature in domestic cricket. In the Ranji Trophy, he has accumulated 370 runs so far, with a high score of 123. His List A career includes 297 runs. In the IPL, Sharma has scored 189 runs at a strike rate of 167.25, with a top score of 61 against Mumbai Indians. As Sharma continues to develop his game, his leadership qualities and match-winning performances will be crucial for his teams. His ability to score quickly and change the course of a match makes him a valuable asset in any format. With the upcoming domestic season and potential IPL opportunities, Sharma will be looking to cement his place as a key player in Indian cricket.",
  "nationality": "India",
  "career_span": {
    "IPL": "2024-2025"
  }
}