{
  "id": "pprofile_90501",
  "type": "player_bio",
  "player": "Mayank Yadav",
  "full_name": "Mayank Prabhu Yadav",
  "dob": "June 17, 2002",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm fast",
  "teams": [
    "India",
    "North Zone",
    "Delhi",
    "Chhattisgarh",
    "Lucknow Super Giants"
  ],
  "bio": "Mayank Yadav, a promising right-arm fast bowler from India, has been making waves in domestic cricket with his raw pace and ability to swing the ball. Born on June 17, 2002, his journey began with a List A debut for Delhi in 2021 against Haryana, where he immediately showcased his potential by claiming three wickets. He quickly progressed, making his T20 debut in the Syed Mushtaq Ali Trophy, followed by his first-class debut in the Ranji Trophy. His impressive performances soon earned him a place in Lucknow squad for the 2023 Indian Premier League, marking his entry into the top-tier of Indian cricket. Yadav’s bowling is defined by his blistering pace and sharp movement, qualities that have troubled batters across formats. In the 2024 T20I series against Bangladesh, he made an instant impact, picking up four wickets in three matches while maintaining a superb economy rate of under 7. His best figures in the series, 2 for 32, highlighted his ability to perform under pressure. His rise continued in IPL 2024, where he bagged seven wickets in four matches, including a standout performance of 3 for 14 against Bengaluru, further proving his credentials on the big stage. His potential has not gone unnoticed, with cricket analysts praising his ability to generate pace and movement consistently. His performances in domestic tournaments like the Vijay Hazare Trophy and Syed Mushtaq Ali Trophy have cemented his reputation as a bowler to watch. In the 2023 Vijay Hazare Trophy, he scalped 34 wickets in 17 matches, boasting an average of 21.55 and an economy rate of 5.35, with his best figures being 4 for 47 against Karnataka. As Yadav continues to refine his craft, the challenge ahead will be maintaining consistency and fitness, both crucial for a fast bowler’s longevity. His ability to adapt to different pitch conditions and swing the ball both ways makes him a valuable asset for any team. However, with great pace comes great physical strain, and managing his workload while honing his raw talent will be key to unlocking his full potential. If he finds the right balance, Mayank Yadav could be the next big name in Indian fast bowling.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "",
    "IPL": "2024-2025"
  }
}