{
  "id": "pprofile_111155",
  "type": "player_bio",
  "player": "PV Satyanarayana Raju",
  "full_name": "Penumatsa Venkata Satyanarayana Raju",
  "dob": "July 10, 1999",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm fast medium",
  "teams": [
    "Mumbai Indians",
    "Andhra",
    "Tuskers XI",
    "Lions XI",
    "Godavari Titans",
    "Rayalaseema Kings",
    "Bhimavaram Bulls"
  ],
  "bio": "Satyanarayana Raju, a promising right-arm fast-medium bowler from India, has been making waves in the domestic cricket circuit with his impressive performances. Known for his ability to swing the ball both ways, Raju has been a key player for Andhra in the Ranji Trophy. His bowling figures in the 2024/25 season, including a best of 3-53 against Gujarat, highlight his knack for taking crucial wickets. With 17 wickets in just seven first-class matches, Raju has maintained a commendable bowling average of over around 38 and an economy rate of under 4, showcasing his potential to become a mainstay in the Indian bowling lineup. Raju's journey in the shorter formats has been equally noteworthy. In the Vijay Hazare Trophy, he has taken eight wickets in six matches, with a best of 3-32 against Sikkim, maintaining a bowling average of around 26. His ability to adapt to different formats is evident from his performances in the Syed Mushtaq Ali Trophy, where he has claimed seven wickets in as many matches, with a best of 2-19 against Kerala. His economy rate of under 9 in T20s reflects his ability to contain runs while picking up wickets. While Raju's batting contributions have been limited, his highest score of 37 against Himachal Pradesh in the Vijay Hazare Trophy indicates his potential to contribute lower down the order. His fielding skills, with two catches in T20s, add to his all-round capabilities on the field. Being picked by the most successful franchise in the Indian Premier League, Mumbai, Raju continues to hone his skills, and will surely make his mark on the bigger stage. His journey is one to watch, as he represents the new wave of fast bowlers emerging from India.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "",
    "IPL": "2025-2025"
  }
}