{
  "id": "pprofile_1367",
  "type": "player_bio",
  "player": "Harbhajan Singh",
  "full_name": "Harbhajan Singh",
  "dob": "July 3, 1980",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Off break",
  "teams": [
    "India",
    "Asia XI",
    "Essex",
    "India A",
    "India Blue",
    "India Green",
    "Indian Inv XI",
    "India Seniors",
    "North Zone",
    "Rest of India",
    "Surrey",
    "Kolkata Knight Riders",
    "Chennai Super Kings",
    "Mumbai Indians",
    "India Under-19",
    "Punjab",
    "Brampton Wolves",
    "Delhi Bulls",
    "Bharat Legends",
    "India Maharajas",
    "India Maharajas",
    "Manipal Tigers",
    "Nagpur Ninjas",
    "Morrisville Unity",
    "One World",
    "Dubai Giants",
    "India Champions",
    "Haryana Gladiators"
  ],
  "bio": "A young Harbhajan Singh bolstered his credentials after a successful home Test series against Steve Waugh's invincible Australia in 2001. Replacing an injured Anil Kumble, 'Bhajji' was crowned 'Man of the Series' in performances that stopped the Kangaroos record unbeaten run. He took 32 wickets in the series, including the first ever Test hat-trick for India. Prior to his ascendancy during that series, Harbhajan made his ODI and Test debut in 1998. After a year in action, few noteworthy displays coupled with a suspect bowling action was all that emerged and he was eventually relegated to domestic cricket. His return after a two-year hiatus was a one filled with renewed determination that epitomized captain Sourav Ganguly's fearlessness. Following his stand-out performance against Australia, he forced selectors to rethink India's bowling line-up by opting for a two-pronged spin attack in tandem with Anil Kumble. He added further repute as a player with his pinch-hitting abilities as a tail-ender. Following spin-ally Kumble's retirement from international cricket, the mantle was cast on The Turbanator (his nickname), especially in series abroad where India usually played with a solitary spinner. He stuck to his task in India's series victory in New Zealand in 2009, the country's first such win against the Kiwis in 40 years. In November 2010, he scaled an unprecedented summit in his batting career when he scored his maiden Test century against New Zealand, helping India to save the match. In 2011, Harbhajan led the Mumbai franchise in the Champions League and emerged victoriously. However, a poor run of form in international cricket forced him out of the team and he was left out for the home series against West Indies and the tour to Australia later that year. Immediately, the off-spinner went back to basics and improvised in his stint with Essex. He did get a few opportunities to come back but his shoddy performances coupled with the meteoric rise of Ravichandran Ashwin meant that he had a very little opening to become the mainstay again. Although, Harbhajan did make a comeback to the Test side and became the 10th Indian to play 100 Tests when he played against Australia in Chennai. But after that, he was dropped and sent back to the domestic format. An impressive performance for Mumbai in the 2015 Indian T20 League and Harbhajan was called up again for the only Test against Bangladesh that year. In the 2015-16 season, he played a few Tests and some ODIs and also got a chance in the 2016 World T20 squad. Since 2016, Harbhajan hasn't played in the national colours in any format and it is very unlikely that he will make a comeback again. Although he has not announced retirement, his career is all but over. In recent years, Harbhajan has become a bowler who has been economical but hasn't been able to pick up wickets consistently. After playing for 10 years with Mumbai, he was released by the franchise and was bought by Chennai in the auction for the 2018 Indian T20 League. Just before the start of the 2020 Indian T20 League, Harbhajan pulled out of the tournament due to personal reasons and for the next edition, Kolkata acquired his services.",
  "nationality": "India",
  "career_span": {
    "Test": "1998-2015",
    "ODI": "1998-2015",
    "IPL": "2008-2021"
  }
}