{
  "id": "pprofile_63605",
  "type": "player_bio",
  "player": "Corbin Bosch",
  "full_name": "Corbin Bosch",
  "dob": "September 10, 1994",
  "role": "All-Rounder",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm fast medium",
  "teams": [
    "South Africa",
    "Northerns",
    "South Africa A",
    "South African Invitation XI",
    "Titans",
    "Rajasthan Royals",
    "Mumbai Indians",
    "Cape Cobras",
    "South Africa Under-19",
    "Barbados Royals",
    "St Kitts and Nevis Patriots",
    "Peshawar Zalmi",
    "Vancouver Knights",
    "Montreal Tigers",
    "Tshwane Spartans",
    "Dublin Chiefs",
    "MI Cape Town",
    "Pretoria Capitals",
    "Paarl Royals"
  ],
  "bio": "Corbin Bosch, hailing from Durban, first showcased his cricketing talent during the ICC Under-19 World Cup in 2014. Coming from a family with a strong cricketing background, Corbin is no stranger to the sport. He is the elder brother of Eathan, who also competes in South Africa's domestic cricket scene. Corbin made his T20 debut for the Titans in the 2014 Ram Slam T20 Challenge. He made his First-Class debut in 2017, and his career continued to rise as he also made his mark in List-A cricket. In 2019, Corbin was selected for the Tshwane Spartans in the Mzansi Super League. Committed to progressing in his career, Corbin replaced Nathan Coulter-Nile in the Rajasthan franchise for the 2022 Indian T20 League season. The same year, he also featured in a couple of more franchise tournaments including playing for Barbados Royals in the Caribbean Premier League while also being bought by the Paarl Royals for South Africa’s own SA20 League in 2022. Feeling ready for greater challenges, Corbin Bosch received his call-up to the South Africa A squad for their 2023 tour to Sri Lanka. His long-awaited moment arrived when he made his international debut in a multi-format series, stepping in as an injury replacement for Baartman. In his first ODI, he took his maiden limited-overs wicket, dismissing Saim Ayub. Just a week later, he was given the opportunity to play in a Test match at home, featuring in the Boxing Day Test against the same opposition. Bosch's Test debut couldn’t have gone better. He became the 25th South African bowler to claim a wicket with his first delivery, sending Shan Masood back to the pavilion. With the bat, he proved his worth as well, rescuing his team with a valuable 81. He also made history as the first South African to achieve the rare feat of a four-wicket haul and a half-century on his Test debut.",
  "nationality": "South Africa",
  "career_span": {
    "Test": "2024-2025",
    "ODI": "2024-2025",
    "IPL": "2025-2025"
  }
}