{
  "id": "pprofile_10090",
  "type": "player_bio",
  "player": "Nathan Coulter-Nile",
  "full_name": "Nathan Mitchell Coulter-Nile",
  "dob": "October 11, 1987",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm fast",
  "teams": [
    "Australia",
    "Australia A",
    "Royal Challengers Bengaluru",
    "Kolkata Knight Riders",
    "Delhi Capitals",
    "Rajasthan Royals",
    "Mumbai Indians",
    "Western Australia",
    "Australia Under-19",
    "Australian XI",
    "Melbourne Stars",
    "Perth Scorchers",
    "Surrey Jaguars",
    "Trent Rockets",
    "Southern Super Stars",
    "Australia Champions",
    "Australia Masters"
  ],
  "bio": "A product of the Dennis Lillee Fast Bowling Academy, Coulter-Nile currently represents Melbourne Stars in the Big Bash. Although largely a bowler, he can double up as a handy lower order batsman as well, evidenced by a high score of 92 in ODIs. Interestingly, it came against West Indies in the 2019 World Cup and is the highest score by a No.8 batsman in ODI World Cups. It also missed the overall highest score by a No.8 batsman in all ODIs by a whisker, 3 runs. Coulter-Nile’s exceptional performances for Australia A in all the formats saw him a step closer to getting selected for the senior side. He made his T20I debut against West Indies in February 2013. Although he has performed decently at the opportunities that came by, persistent injuries kept him in and out of the side. Add to this, he also had to compete with fiercer quicks like Johnson, Starc and the all-rounder Faulkner for a spot in the national side. However, despite these odds, Coulter-Nile was not completely relegated as he continued to receive opportunities, and to his credit, he made good use of whatever came by. Due to a combination of the above-mentioned factors, he did not figure in the squads for the 2015 World Cup and the 2017 Champions Trophy. But, he was in the squad for a subsequent tour to India and impressed with his performances therein. His athletic body makes him a very agile fielder as well. Coulter-Nile’s allegiances in the Indian T20 League varied almost every season. He was picked by Mumbai in 2013 and appeared in just one game. Moving to Delhi in the next season, Coulter-Nile impressed in 2015, becoming the joint-highest wicket-taker for Delhi in that edition. He was lapped up by Kolkata in 2017, where he got 15 wickets in the tournament, for yet another time. However, he was released later and was purchased by Bangalore for the 2018 season. Coulter-Nile though, did not feature in a single game, owing to injury. In the 2020 League auctions, he was signed up by Mumbai again, for a whopping 8 crore and will look to justify the tag with the League around the corner.",
  "nationality": "Australia",
  "career_span": {
    "Test": "",
    "ODI": "2013-2019",
    "IPL": "2013-2022"
  }
}