{
  "id": "pprofile_64861",
  "type": "player_bio",
  "player": "Shimron Hetmyer",
  "full_name": "Shimron Odilon Hetmyer",
  "dob": "December 26, 1996",
  "role": "Batsman",
  "batting_style": "Left Handed",
  "bowling_style": "-",
  "teams": [
    "West Indies",
    "West Indies A",
    "University of West Indies Vice Chancellors XI",
    "Royal Challengers Bengaluru",
    "Delhi Capitals",
    "Rajasthan Royals",
    "West Indies Under-19",
    "Guyana Harpy Eagles",
    "West Indies Cricket Presidents XI",
    "Guyana Amazon Warriors",
    "Quetta Gladiators",
    "Khulna Tigers",
    "West Indians",
    "Multan Sultans",
    "Team Abu Dhabi",
    "London Spirit",
    "Reserve Team",
    "Morrisville Samp Army",
    "Gulf Giants",
    "Seattle Orcas"
  ],
  "bio": "Shimron Hetmyer is a fearless left-handed batter hailing from Guyana. He idolises Brian Lara as his source of inspiration, and you can find similar bravado in his batting just like the great man. Hetmyer represented West Indies in a couple of U19 World Cups and was the winning captain of the 2016 edition. Seeing his vast potential, Hetmyer was soon included in the national team. He kick-started his international career in the year 2017 when he made his Test debut against Pakistan. ODI and T20I debuts also followed for the swashbuckling batter, and 2018 was really fruitful for him. First, he stroked his maiden international century against UAE and then made the headlines by scoring a ton in the Caribbean Premier League while playing for Guyana Amazon Warriors. He had a brilliant ODI series in India in 2018, where he made a name for himself after consecutive knocks of 106 and 94. Hetmyer’s ability to clear boundaries effortlessly earned him an IPL contract with Bengaluru in 2019, but he struggled for consistency in his debut season. A move to Delhi in 2020 revived his IPL career, where he played crucial finishing roles for the franchise. However, it was after being signed by Rajasthan in 2022 that he truly flourished, establishing himself as one of the league’s most destructive finishers. His 314-run tally that season played a pivotal role in Rajasthan's journey to the final. Later that year, Hetmyer faced a setback when he was dropped from the West Indies squad for the T20 World Cup after missing his re-scheduled flight to Australia. However, he bounced back strongly in the 2023 IPL, replicating his heroics for Rajasthan, though the team narrowly missed out on a playoff spot. In 2024, Hetmyer marked his return to the West Indies squad for the T20 World Cup, having missed the previous edition. However, he didn’t get a game and remained on the bench as the tournament co-hosts exited in the Super Eights. Meanwhile, his IPL form took a dip that season, but Rajasthan showed faith in him, retaining him for the 2025 edition.",
  "nationality": "West Indies",
  "career_span": {
    "Test": "2017-2019",
    "ODI": "2017-2025",
    "IPL": "2019-2025"
  }
}