{
  "id": "pprofile_63962",
  "type": "player_bio",
  "player": "Sarfaraz Khan",
  "full_name": "Sarfaraz Naushad Khan",
  "dob": "October 22, 1997",
  "role": "Batsman",
  "batting_style": "Right Handed",
  "bowling_style": "Leg break",
  "teams": [
    "India",
    "India A",
    "India B",
    "Rest of India",
    "West Zone",
    "Royal Challengers Bengaluru",
    "Punjab Kings",
    "Delhi Capitals",
    "India Under-19",
    "Mumbai",
    "Uttar Pradesh",
    "Shivamogga Lions",
    "Aakash Tigers Mumbai Western Suburbs",
    "Eagle Thane Strikers",
    "DY Patil Group B",
    "Team B"
  ],
  "bio": "Mumbai have always done and continue to nurture young prodigies in the world of cricket. One such cricketer is going around by the name of Sarfaraz Naushad Khan. He came into the scene when he made news for smashing 439 runs in his maiden Haris Shield game in 2009. As much as that made him feature in good news, he was also embroiled in a controversy which accused him of fudging his age before an advanced test revealed otherwise, which was accepted by the Mumbai Cricket Association. Eventually, he was a part of the Mumbai U-19 side. Some decent outings there led to his inclusion in the Indian U-19 team. He had a good outing in the quadrangular U-19 series involving the under-19 teams of South Africa, Australia and Zimbabwe apart from India. That eventually paved the way for him to represent India in the Under-19 World Cup in 2014. He batted freely with an average of over 70 and a strike rate in excess of 100. This was not a one-off instance, as in the next edition of the U-19 World Cup, he was the second highest run-scorer in the competition. With some good exploits behind him, expectations about Sarfaraz making it to the highest level began to soar. The first step in that direction was taken when he was picked up by the Bengaluru franchise in the Indian Premier League in 2015. He displayed his cheeky aggressiveness when he was often sent lower down the order to finish the innings. In July 2015, Sarfaraz left Mumbai and joined Uttar Pradesh for the 2015-16 domestic season. After a three-year stint with UP, Khan returned to Mumbai, and that marked the beginning of a stunning transformation. He emerged as a run machine in the Ranji Trophy, compiling huge scores season after season. He averaged over 100 in the 2019–20 season, including a triple century and multiple daddy hundreds. His purple patch continued across 2021 and 2022, making him one of the most consistent domestic performers in India. Despite his form, a national call-up eluded him, raising debates over selection policies and the importance of red-ball form. His Test debut finally came in February 2024, in the third Test against England in Rajkot. Batting in the middle order, Sarfaraz announced his arrival with twin fifties in his debut match. He played two more matches in the series, finishing with a healthy average and proving that he belonged at the international level. While competition for spots remained intense, Sarfaraz had done enough to stay in the selectors’ radar for future Test tours. Later that year, he produced a valiant 150 against New Zealand in Bengaluru, which was one of the few bright spots in an otherwise dismal 3–0 series loss at home. In contrast to his red-ball success, Sarfaraz’s IPL journey has been far less consistent. He had short stints with Delhi in the 2022 and 2023 seasons but failed to establish himself as a regular in the playing XI. Released ahead of the 2024 auction, he went unsold, a fate that repeated in the 2025 edition as well.",
  "nationality": "India",
  "career_span": {
    "Test": "2024-2024",
    "ODI": "",
    "IPL": "2015-2023"
  }
}