{
  "id": "pprofile_63961",
  "type": "player_bio",
  "player": "Shreyas Iyer",
  "full_name": "Shreyas Santosh Iyer",
  "dob": "December 6, 1994",
  "role": "Batsman",
  "batting_style": "Right Handed",
  "bowling_style": "Leg break googly",
  "teams": [
    "India",
    "India A",
    "India B",
    "Indian Board Presidents XI",
    "India Green",
    "Lancashire",
    "Rest of India",
    "West Zone",
    "Kolkata Knight Riders",
    "Punjab Kings",
    "Delhi Capitals",
    "India Under-19",
    "Mumbai",
    "Bandra Blasters",
    "India D",
    "SoBo Mumbai Falcons"
  ],
  "bio": "Shreyas Iyer, a name synonymous with elegance and flair, has carved a niche for himself in the world of cricket. Born in Mumbai, the city known for producing cricketing legends, Iyer has emerged as one of the most promising batters of his generation. His journey from the maidans of Mumbai to the international stage is a testament to his dedication and talent. Iyer's ability to play spin with ease and his aggressive approach against pace bowlers have made him a formidable opponent. His signature cover drive, executed with precision and grace, is a sight to behold for cricket enthusiasts. In the 2023 ICC Cricket World Cup, Iyer showcased his prowess with the bat, scoring two centuries, including a scintillating 128 against the Netherlands. His performance was instrumental in India's campaign, highlighting his ability to perform under pressure. With 2421 runs in ODIs at an average of 47.47, including five centuries and 18 fifties, Iyer has established himself as a key player in India's batting lineup. His Test debut against New Zealand in 2021 was marked by a century, further cementing his place in the team. Iyer's journey in the Indian Premier League has been equally impressive. Starting with the Delhi franchise, he quickly made a mark with his consistent performances. In 2022, he was acquired by the Kolkata franchise, where he took on the role of captaincy and in 2024, Shreyas led them to title glory. Despite facing challenges due to injuries, Iyer's leadership and batting skills have been pivotal. With over 3,000 runs in the IPL, including 21 fifties, Iyer's contributions have been significant. Iyer's decision to leave Kolkata after a title-winning campaign surprised many, and with him up for grabs, a bidding war was inevitable. As expected, multiple franchises vied for his services, but it was Punjab who emerged victorious, securing Iyer for a staggering INR 26.75 crore. From the moment they acquired him, it was evident that he would take over the leadership role, and in January 2025, it was officially announced that the talented right-hander would captain Punjab for the 2025 edition.",
  "nationality": "India",
  "career_span": {
    "Test": "2021-2024",
    "ODI": "2017-2025",
    "IPL": "2015-2025"
  }
}