{
  "id": "pprofile_64712",
  "type": "player_bio",
  "player": "Ishan Kishan",
  "full_name": "Ishan Pranav Kumar Pandey Kishan",
  "dob": "July 18, 1998",
  "role": "Wicket-Keeper",
  "batting_style": "Left Handed",
  "bowling_style": "Leg break",
  "teams": [
    "India",
    "East Zone",
    "India A",
    "India B",
    "India Blue",
    "Indian Board Presidents XI",
    "India Red",
    "Nottinghamshire",
    "Rest of India",
    "Mumbai Indians",
    "India Under-19",
    "Jharkhand",
    "Sunrisers Hyderabad",
    "Gujarat Lions",
    "India C",
    "India D"
  ],
  "bio": "Ishan Kishan, a name that resonates with the future of Indian cricket, has been making waves with his explosive batting and sharp wicket-keeping skills. Born in Patna, Bihar, and raised in Jharkhand, Kishan has often been compared to the legendary MS Dhoni, not just for his roots but for his fearless approach to the game. His journey from the streets of Jharkhand to the international arena is a testament to his hard work and dedication. Kishan's career took a significant turn when he led the India Under-19 team to the finals of the 2016 World Cup. Although his batting did not shine in the tournament, he quickly made up for it by scoring 799 runs in the following Ranji Trophy season. His aggressive batting style caught the attention of IPL scouts, and he was picked up by Gujarat Lions in 2017. However, it was his stint with Mumbai that truly showcased his potential. In the 2020 IPL season, Kishan emerged as the top scorer for his team, proving his mettle in the high-pressure environment of the league. In February 2021, Kishan made his T20I debut for India against England, scoring a blistering 56 off 32 balls and earning the Player of the Match award. His ODI debut followed soon after, and he made headlines with a stunning 210 off 131 balls against Bangladesh in December 2022. These performances have cemented his place as a key player in India's limited-overs setup. Kishan's ability to play match-winning innings has been lauded by cricketing greats. His fearless approach and ability to clear the boundary with ease have drawn comparisons to some of the best in the business. His recent performances in the IPL, where he scored 69 off 34 balls against Royal Challengers Bengaluru, highlight his ability to perform under pressure. After spending a few seasons with Mumbai Indians, Kishan was released ahead of the mega auction in 2024 where he was pi9cked up by Sunrisers Hyderabad. As Kishan looks forward to the upcoming Indian Premier League 2025, expectations are high. His aggressive batting will be a crucial cog in the wheel for Hyderabad if they are to go one better this year and win the title.",
  "nationality": "India",
  "career_span": {
    "Test": "2023-2023",
    "ODI": "2021-2023",
    "IPL": "2016-2025"
  }
}