{
  "id": "pprofile_67402",
  "type": "player_bio",
  "player": "Tim David",
  "full_name": "Timothy Hays David",
  "dob": "March 16, 1996",
  "role": "Batsman",
  "batting_style": "Right Handed",
  "bowling_style": "Off break",
  "teams": [
    "Australia",
    "Tasmania",
    "Lancashire",
    "Surrey",
    "Royal Challengers Bengaluru",
    "Mumbai Indians",
    "Hobart Hurricanes",
    "Perth Scorchers",
    "Rangpur Riders",
    "Saint Lucia Kings",
    "Trinbago Knight Riders",
    "Lahore Qalandars",
    "Singapore",
    "Multan Sultans",
    "Delhi Bulls",
    "Southern Brave",
    "MI Cape Town",
    "Gulf Giants",
    "MI Emirates",
    "Sharjah Warriorz",
    "MI New York",
    "Los Angeles Waves CC"
  ],
  "bio": "Tim David is a batting powerhouse who hails from Singapore but was brought up in Western Australia. He has made his name in the cricketing fraternity by playing for multiple cricket franchises all over the globe. His first appearance for Singapore was at the T20 World Cup qualifier in 2019, and he was one of the players to watch out for. After his noteworthy show at the qualifier, he was picked up by Hobart Hurricanes for the BBL in the 2020/21 season after he ended his contract with Perth Scorchers. In the year 2021, offers started flowing for the power hitter. He went on to represent Lahore Qalandars at the PSL and later was picked by Multan Sultans in 2022. He was acquired by Surrey for the T20 Blast and was roped in by Southern Brave for the Men’s Hundred competition. He was also bought in by Saint Lucia Kings for the CPL. David made his first IPL appearance in 2021, when Bengaluru signed him as a replacement for Finn Allen, though he did not get much game time. He was subsequently picked up by Mumbai in 2022, where he truly established himself, maintaining a strike rate above 150 across three consecutive seasons. Tim's blistering form in leagues worldwide finally earned him a call-up to Australia’s T20I squad in September 2022, debuting against India. A year later, in 2023, he made his ODI debut for Australia, further cementing his place in the national setup. That same year, he found success in Major League Cricket with MI New York, helping them win the title. He continued his franchise success in the 2024/25 BBL, helping Hobart Hurricanes lift the trophy as their second-highest run-scorer. Despite his consistent hitting, Mumbai released him ahead of the 2025 IPL auction, after which Bengaluru, his first IPL team, bought him back for INR 3 crore.",
  "nationality": "Australia",
  "career_span": {
    "Test": "",
    "ODI": "2023-2023",
    "IPL": "2021-2025"
  }
}