{
  "id": "pprofile_66028",
  "type": "player_bio",
  "player": "Obed McCoy",
  "full_name": "Obed Christopher McCoy",
  "dob": "January 4, 1997",
  "role": "Bowler",
  "batting_style": "Left Handed",
  "bowling_style": "Left-arm fast medium",
  "teams": [
    "West Indies",
    "West Indies A",
    "Windward Islands Volcanoes",
    "University of West Indies Vice Chancellors XI",
    "Rajasthan Royals",
    "West Indies Under-19",
    "Sussex",
    "Barbados Royals",
    "Saint Lucia Kings",
    "Islamabad United",
    "Multan Sultans",
    "CWI B Team",
    "Team Abu Dhabi",
    "Grenadines Divers",
    "Fortune Barishal",
    "Chennai Brave Jaguars",
    "Paarl Royals",
    "Dubai Capitals",
    "Seattle Orcas",
    "Antigua & Barbuda Falcons",
    "Ajman Bolts"
  ],
  "bio": "Obed Christopher McCoy is a West Indian international cricketer, born on 4th January 1997 in the Windward Islands. He plays for his birthplace in the domestic circuit and represents St. Lucia in the Caribbean Premier League. McCoy started his professional career representing the national side at the 2016 Under-19 World Cup. He made his List A debut for the West Indies Under-19s in the 2016-17 Regional Super50 and went on to make his T20 debut for St Lucia Kings in the 2017 CPL. In June 2018, Obed was named in the squad for Cricket West Indies B for the inaugural edition of the Global T20 Canada tournament. He was the leading wicket-taker with eleven dismissals in seven matches. In October 2018, Obed McCoy made his international debut, in a match against India and a few months later, he was added to the West Indies T20I squad for the series against England. McCoy was also a part of the West Indies squad for the 2021 ICC Men's T20 World Cup. In April 2021, he was signed by Multan Sultans to play in the rescheduled matches in the 2021 Pakistan Super League and the pacer was bought by the Rajasthan franchise in the mega auction for the 2022 Indian T20 League.",
  "nationality": "West Indies",
  "career_span": {
    "Test": "",
    "ODI": "2018-2018",
    "IPL": "2022-2023"
  }
}