{
  "id": "pprofile_74296",
  "type": "player_bio",
  "player": "Ashwani Kumar",
  "full_name": "Ashwani Kumar",
  "dob": "August 29, 2001",
  "role": "Bowler",
  "batting_style": "Left Handed",
  "bowling_style": "Left-arm medium",
  "teams": [
    "Mumbai Indians",
    "Punjab",
    "BLV Blasters",
    "Agri King's Knights"
  ],
  "bio": "Ashwani Kumar, a promising left-arm fast bowler from Mohali, Punjab in India, is steadily making his mark in the domestic cricket circuit. Known for his ability to swing the ball both ways, Kumar has shown glimpses of brilliance in his early career. Despite not having made his international debut yet, his performances in domestic competitions have caught the attention of selectors and cricket enthusiasts alike. Kumar's journey began in the domestic first-class arena, where he debuted for Punjab against Rajasthan in December 2019. In his brief first-class career, he has had an economy of under 4 that highlights his ability to maintain pressure on the batters. In the List A format, his best performance came against Arunachal Pradesh, where he took 3-37, showcasing his potential to deliver in crucial moments. In the T20 format, Kumar has been more prolific. His standout performance was a 4-21 against the Trident Stallions, demonstrating his knack for picking up wickets in clusters. His economy rate of over 10 in T20s suggests room for improvement, but his strike rate of under 17 indicates his ability to take wickets regularly. Kumar's domestic T20 journey includes stints with teams like BLV Blasters and Agri King's Knights, where he has been a key figure in their bowling line-up. His performances in the Syed Mushtaq Ali Trophy and the Sher-E-Punjab T20 have been noteworthy, with several match-winning spells that have helped his teams secure victories. As Ashwani Kumar continues to hone his skills, the cricketing fraternity eagerly awaits his transition to the international stage. With his ability to swing the ball and deliver under pressure, Kumar has the potential to become a vital asset for the Indian cricket team in the future.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "",
    "IPL": "2025-2025"
  }
}