{
  "id": "pprofile_62576",
  "type": "player_bio",
  "player": "Axar Patel",
  "full_name": "Axar Rajeshbhai Patel",
  "dob": "January 20, 1994",
  "role": "All-Rounder",
  "batting_style": "Left Handed",
  "bowling_style": "Slow left-arm orthodox",
  "teams": [
    "India",
    "Durham",
    "India A",
    "India B",
    "India Red",
    "West Zone",
    "Punjab Kings",
    "Delhi Capitals",
    "Mumbai Indians",
    "Gujarat",
    "India Under-23",
    "India C",
    "Indians",
    "India D"
  ],
  "bio": "Axar Patel is a left-arm orthodox spin-bowling all-rounder from the state of Gujarat. He started his journey in cricket at the age of 13 and made his List A debut for Gujarat when he was just 18, in a Vijay Hazare Trophy game against Maharashtra in 2012. However, the 2013-14 Ranji Trophy season was one to remember for him, performance-wise, as he picked up 29 wickets and also scored important runs for the team. In the sixth edition of the IPL, he was bought by the Mumbai franchise but mainly was used as a fringe player, as he was not part of any of the matches actively during the season. Punjab saw a talent that they thought they could utilise as they roped him in for the seventh edition of the IPL. This investment brought dividends as he performed well for Punjab, and he picked up 17 wickets during the course of the season. Axar also rightfully won the 'Emerging Player of the Year' award in 2014. He was retained for the 2015 edition too by Punjab, where he scored 206 runs down the order in addition to scalping wickets. Patel also scalped a hat-trick in the 2016 season of the Indian Premier League. Later, Axar was bought by the Delhi franchise for the 2018 IPL. Coming back to his Indian career, his good performances in the 2014 Indian Premier League bought him a ticket to Bangladesh for the ODI series in 2014. He played well against them, and also his performances kept the talented Ravindra Jadeja out of the side for the ODI series against Sri Lanka at home. His good performances consistently made the selectors also pick him for the squad for the 2015 ICC World Cup. Due to the conditions in Australia being more pace-friendly, he did not really get a chance to go out there and make an impact for the team. He did make it for the Indian squad that toured Bangladesh later in June. Sadly for him, he did not make it to the squad for the 2017 ICC Champions Trophy as Jadeja was eventually selected. With his left-arm spin and his exploits with the bat lower down the order, he was always a valuable asset. After a gap of almost three years, Axar once again managed to find a place in the national team for the Test series against England in 2021, once again due to the absence of Jadeja. Axar was a standout performer in India's 3-1 series win over England, finishing with an incredible tally of 27 wickets. He carried his stellar form into the Test series against New Zealand later that year, further solidifying his reputation as a vital cog in India’s cricketing setup. Over time, Axar has grown in stature, showcasing his all-round abilities across formats. His contributions were particularly pivotal in India’s triumphant campaign at the 2024 T20 World Cup. In the high-pressure semifinal against a formidable English side, Axar delivered a match-winning bowling performance, playing a crucial role in steering India into the final. In 2025, he was elevated to the vice-captaincy role in the T20I format, and due to his all-round exploits, he secured a spot in the squad for the 2025 Champions Trophy.",
  "nationality": "India",
  "career_span": {
    "Test": "2021-2024",
    "ODI": "2014-2025",
    "IPL": "2014-2025"
  }
}