{
  "id": "pprofile_63940",
  "type": "player_bio",
  "player": "Liam Livingstone",
  "full_name": "Liam Stephen Livingstone",
  "dob": "August 4, 1993",
  "role": "All-Rounder",
  "batting_style": "Right Handed",
  "bowling_style": "Leg break",
  "teams": [
    "England",
    "Lancashire",
    "Royal Challengers Bengaluru",
    "Punjab Kings",
    "Rajasthan Royals",
    "Melbourne Renegades",
    "Perth Scorchers",
    "England Lions",
    "Karachi Kings",
    "Peshawar Zalmi",
    "North",
    "Bangla Tigers",
    "Cape Town Blitz",
    "Team Abu Dhabi",
    "Birmingham Phoenix",
    "Team Morgan",
    "Lancashire CCC",
    "MI Cape Town",
    "Pretoria Capitals",
    "Abu Dhabi Knight Riders",
    "Sharjah Warriorz"
  ],
  "bio": "England’s transition into a more attacking brand of cricket coincided with the arrival of some devastating batters, and Liam Livingstone is one of the by-products of this change in mindset as he continues to enthrall the world with his hard-hitting abilities. Born on 4th August 1993 in Barrow-in-Furness, a port town situated in Cumbria in North West England, Liam grabbed headlines when he scored 350 runs in 138 balls for his club side Nantwich in a one-day match, which got him promoted into the Lancashire senior side midway through 2015. Liam made his T20 debut in the NatWest T20 Blast, which his side won, getting him his first trophy, and a few months later made his List A debut in the Royal London One-Day Cup, where he scored 91 in 88 balls to make an instant impact. The following year, he made his first-class debut in the County Championship Division One and demonstrated the ability to hang around at the wicket, scoring 70 runs in 124 balls, coming lower down the order. The right-handed batter, though, is mainly suited for white-ball cricket with his ability to hit massive sixes and is a proven spin bowling option who can bowl both leg-spin and off-spin. A successful stint with the England Lions side fast-tracked him into national contention, and he was given his opportunity to make his T20I debut against South Africa midway through 2017. He played two games and could not make an impact, which prompted the selectors to consider giving him more time to hone his skills at the domestic level. He scored a double-century in the 2017 first-class season on his return to the County Championship but suffered a blow in 2018 when he broke his thumb, and soon after, Lancashire was relegated under his captaincy. He gave up the leadership role and began his journey travelling around the world to play in the various T20 leagues, becoming a hot commodity in the player market. He was bought by the Rajasthan franchise at his base price for the 2019 Indian Premier League but played just 4 games and was released at the end of the season. Towards the end of the year, he signed for the Perth franchise for the Australian T20 League but in 2020 decided to opt out of playing in the Indian Premier League to focus his attention on playing red-ball cricket. His career graph began taking an upward trajectory in 2021 as he returned to the national side, making his ODI debut against India, scoring an unbeaten 27 to complete a massive run chase. He was bought by the Rajasthan franchise for the 2021 Indian Premier League but once again made just a handful of appearances and could not prove his worth to the side. He returned to the T20I side exactly four years after he made his debut, and in the following month, he proved his credentials by scoring his maiden T20I century against Pakistan in just 42 balls, which was the fastest hundred by an English player at that time. His exploits got him into England’s squad for the 2021 ICC Men’s T20 World Cup, and soon his stock began to grow, which prompted the Punjab franchise to pay INR 11.50 crore for his services in the 2022 Indian Premier League. He was the most expensive overseas player in the auction and justified his price tag by scoring 437 runs at a strike rate of 182.08 along with chipping in with 6 wickets. He was part of England’s squad that won the 2022 ICC Men’s T20 World Cup. Soon after the mega event, he made his Test debut against Pakistan but suffered a massive blow as he injured his right knee and missed the rest of the series. He was retained by the Punjab franchise for the 2023 Indian Premier League but played only nine games, scoring 279 runs, and did not live up to the expectations. Livingstone endured a lean run at the 2023 ODI World Cup and struggled to make an impact for Cape Town in the 2024 South African T20 League. Despite his inconsistent form, Punjab showed faith in him and retained him for the 2024 Indian Premier League. However, his struggles continued, leading to his release ahead of the 2025 auction, where Bengaluru secured his services for INR 8.75 crore. Named in England's squad for the 2025 Champions Trophy, Livingstone had a subdued tournament as England endured a disappointing campaign, failing to win a single game.",
  "nationality": "England",
  "career_span": {
    "Test": "2022-2022",
    "ODI": "2021-2025",
    "IPL": "2019-2025"
  }
}