{
  "id": "pprofile_67735",
  "type": "player_bio",
  "player": "Kartik Tyagi",
  "full_name": "Kartik Tyagi",
  "dob": "November 8, 2000",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm medium fast",
  "teams": [
    "India A",
    "Rajasthan Royals",
    "India Under-19",
    "Uttar Pradesh",
    "Sunrisers Hyderabad",
    "India Under-23",
    "India A Under-19",
    "Indians",
    "Gujarat Titans",
    "Meerut Mavericks"
  ],
  "bio": "A young talent with a promising future, Kartik Tyagi, born 8th of November 2000, is a right-arm fast-medium bowler known for his ability to swing the ball both ways. A kid from Hapur, a city in Uttar Pradesh, emerged in the cricketing industry with a first-class debut for Uttar Pradesh against the Railways in the 2017-18 Ranji Trophy in October 2017 just a month before he turned 17. He had a decent performance, picking up one wicket and having an economy of 1.66. After impressing the coaching staff with his bowling prowess, he also made his List A debut for Uttar Pradesh against Delhi in the 2017-18 Vijay Hazare Trophy in February 2018, in which he bagged two wickets. In December 2019, Tyagi was selected to serve the national team in the 2020 Under-19 Cricket World Cup. He played a key role in making India the champions, as he helped his side take 11 wickets throughout the campaign and became the second-highest wicket-taker for India. After his impeccable performance. He was bought by Rajasthan in the 2020 Indian Premier League auction for INR 1.3 Cr. He had 10 appearances in that season and took 9 wickets but his overs were a bit expensive which eventually faded the interest in him in the team. In the next season, the appearance dropped to 4, despite of having a Man of the Match where he defended 4 runs in the final over against Punjab on 21st September 2021. In the 2022 season he was sold to Hyderabad for INR 4 Cr. After not getting much chances in the first team he was further sold to Gujarat in the auction for the 2024 Indian Premier League and he is ready for redemption. Tyagi is a young and promising fast bowler with a bright future ahead of him. He has already impressed at the domestic and Under-19 levels and has the potential to develop into a valuable asset for the Indian team in the years to come.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "",
    "IPL": "2020-2024"
  }
}