{
  "id": "pprofile_64264",
  "type": "player_bio",
  "player": "Alzarri Joseph",
  "full_name": "Alzarri Shaheim Joseph",
  "dob": "November 20, 1996",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm fast",
  "teams": [
    "West Indies",
    "Leeward Islands Hurricanes",
    "West Indies B",
    "Worcestershire",
    "Royal Challengers Bengaluru",
    "Mumbai Indians",
    "West Indies Under-19",
    "Saint Lucia Kings",
    "St Kitts and Nevis Patriots",
    "Peshawar Zalmi",
    "West Indians",
    "Amsterdam Knights",
    "Fortune Barishal",
    "Gujarat Titans",
    "Joburg Super Kings",
    "MI Emirates"
  ],
  "bio": "A highly touted talent, Alzarri Joseph is a rare breed capable of bowling quick from a very young age. He was instrumental in West Indies' title triumph in the 2016 Under-19 World Cup and was the leading wicket-taker for the Caribbean side. He also bowled the fastest delivery of the tournament and his dream continued as a lot of West Indies legends heaped praise on the young pacer. Later that year, Joseph got his maiden Test call-up and his first wicket in international cricket was one to remember as he dismissed the modern-day great Virat Kohli. He later made his ODI debut against Pakistan in Sharjah. Though a young career, Joseph has had his fair share of injury concerns. He sustained a stress fracture in 2017 during a tour of New Zealand and had to sit out for 7 months. Alzarri came back from it and made an impact in the Caribbean Premier League. He was drafted into the side for the tour of India but was recommended to miss it and focus on his rehabilitation. Joseph continued his rehabilitation and his good work in the domestic circuit bore fruit. The injury to Adam Milne saw Alzarri Joseph get a chance in the Indian Premier League. He made an impact straight away on his debut as he helped Mumbai defend a small total and finished with one of the best bowling figures in the tournament with 3.4-1-12-6. His stint in India was cut short when he injured himself and had to miss out on the rest of the season. The same injury saw him miss out on a seat on the flight to the 2019 World Cup. Alzarri Joseph's short career got hampered by multiple injuries, but the tall fast bowler kept fighting and improving his fitness. The West Indian selectors also showed faith in his talent, and once he was fit, Joseph was included in the squad across all formats. Joseph also earned a contract with Gujarat in the auction for the 2022 Indian Premier League and played a key part in making them the champions. During his second season with Gujarat, Joseph's performance dipped slightly below his usual standards, prompting the team to release him. Bengaluru seized the opportunity and acquired him for the 2024 edition of the Indian T20 League. This marked Joseph's third team in the tournament. In addition to his success in Tests, ODIs, and the IPL, Joseph's T20I career also took a significant step forward. He was named in the West Indies' T20I squad for their series against India in 2022. He made his T20I debut on 29 July 2022, showcasing his skills in the shortest format of the game. However, as with any player's journey, there are ups and downs. After his time with Bengaluru in 2024, Joseph found himself in a difficult position ahead of the 2025 IPL auction. Despite his previous success in the league, he went unsold in the auction, reflecting the highly competitive nature of the T20 market.",
  "nationality": "West Indies",
  "career_span": {
    "Test": "2016-2025",
    "ODI": "2016-2025",
    "IPL": "2019-2024"
  }
}