{
  "id": "pprofile_98477",
  "type": "player_bio",
  "player": "Manvanth Kumar",
  "full_name": "L Manvanth Kumar",
  "dob": "January 11, 2004",
  "role": "All-Rounder",
  "batting_style": "Left Handed",
  "bowling_style": "Right-arm fast medium",
  "teams": [
    "Delhi Capitals",
    "Karnataka",
    "Hubli Tigers",
    "Karnataka U-19"
  ],
  "bio": "Manvanth Kumar is a talented all-rounder from Mysuru. He earned an IPL contract with DC for ₹30 lakh for the 2025 season, thanks to his impressive performances in domestic cricket. Known for his aggressive batting, disciplined bowling, and sharp fielding, he has excelled in tournaments like the Maharaja Trophy T20, CK Nayudu Trophy, and Syed Mushtaq Ali Trophy. His standout moment came in the Maharaja Trophy, where he played a crucial role in a thrilling third Super Over win for Hubli Tigers, showcasing his ability to perform under pressure. Coming from a middle-class family, Manvanth and his brother Hemanth Kumar faced financial struggles but never gave up on their cricketing dreams. Their father, a retired BMTC bus driver, and their mother supported them despite hardships. He trained at Balachandra Cricket Club, steadily rising through Karnataka’s ranks, and representing the state at U-14, U-16, and U-19 levels. His dedication and performances in domestic tournaments caught the attention of IPL scouts, leading to his selection by DC. As a bowler, Manvanth has impressed with his variations, including a sharp knuckleball and improved yorkers. In the Maharaja Trophy, he was among the top wicket-takers, with 22 wickets in 2023 and 15 in the latest season. Mentored by experienced players like Vinay Kumar and Manish Pandey, he has refined his skills, especially in handling pressure situations. His ability to bowl crucial overs and deliver breakthroughs has made him a promising addition to the DC squad. Now preparing for his IPL debut, Manvanth is eager to learn from the best, including Mitchell Starc, KL Rahul, and Axar Patel. While staying focused on improving his game, his ultimate dream is to represent India on the international stage. From cycling 15 km for practice to making it to the IPL, his journey is a testament to perseverance and passion.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "",
    "IPL": ""
  }
}