{
  "id": "pprofile_89196",
  "type": "player_bio",
  "player": "Harnoor Singh",
  "full_name": "Harnoor Singh Pannu",
  "dob": "January 30, 2003",
  "role": "Batsman",
  "batting_style": "Left Handed",
  "bowling_style": "Leg break",
  "teams": [
    "Punjab Kings",
    "India Under-19",
    "Punjab",
    "India A Under-19",
    "Chandigarh",
    "India D Under-19",
    "BLV Blasters",
    "Rock Zone"
  ],
  "bio": "Harnoor Singh is a young and talented left-handed batter. His elegant stroke play and consistent performances have been rewarded with an IPL contract. He was born and raised in Punjab, and cricket was never Harnoor's distant dream. His father was a former U-19 North Zone player, and his grandfather was a Ranji cricketer. Harnoor grew up surrounded by the game, and his cricketing journey began at a tender age, under the guidance of his uncle, who coached him in Chandigarh. From an early age, he displayed an exceptional ability to build innings, which would soon become his habit. Harnoor first made headlines during the 2022 U-19 World Cup, where he played a crucial role in India’s title-winning campaign. His batting style is graceful yet effective and drew comparisons to some of the best left-handers in the game. That same year, he shone in the U-19 Asia Cup, finishing as the highest run-scorer and winning the Player of the Tournament award. His performances in age-group cricket signaled that he was ready for bigger challenges. Despite his early success, breaking into the professional circuit was not an easy task. Harnoor made his Ranji Trophy debut for the UT Cricket Association (UTCA) in 2022, playing against Baroda. However, he soon decided to return to his home state and joined the Punjab Cricket Association (PCA), a move that proved to be a turning point in his career. Playing in the Sher-e-Punjab T20 Cup, he dominated the tournament, scoring 578 runs in just 12 matches and smashing 33 sixes. His remarkable performance caught the attention of selectors and fans alike, reinforcing his reputation as a dependable and aggressive top-order batter. His hard work paid off when Punjab picked him up for his base price of ₹30 lakh at the IPL 2025 auction. This marked a significant milestone in his career. Harnoor is part of the Punjab senior team in the Syed Mushtaq Ali Trophy, where he continues to impress with his batting prowess.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "",
    "IPL": ""
  }
}