{
  "id": "pprofile_63706",
  "type": "player_bio",
  "player": "Alex Carey",
  "full_name": "Alex Tyson Carey",
  "dob": "August 27, 1991",
  "role": "Wicket-Keeper",
  "batting_style": "Left Handed",
  "bowling_style": "-",
  "teams": [
    "Australia",
    "South Australia",
    "Australia A",
    "Delhi Capitals",
    "Sussex",
    "Australian XI",
    "Adelaide Strikers",
    "Islamabad United",
    "Australians",
    "Prime Ministers XI",
    "Los Angeles Knight Riders"
  ],
  "bio": "Alex Carey’s journey to becoming one of Australia’s finest wicket-keepers is nothing short of remarkable, a story of resilience, reinvention, and unwavering determination. Born on August 27, 1991, Carey grew up juggling two sporting passions - cricket and Australian Rules football. As a teenager, his talent on the football field shone brightly. By the age of 15, he was already playing in the South Australian National Football League reserves competition, a remarkable feat for someone so young. His leadership qualities came to the fore in 2010 when he captained the Greater Western Sydney Giants in the TAC Cup. Despite missing the final rounds due to injury, he won the team’s best and fairest award. However, when the Giants joined the Australian Football League in 2012, Carey was left out of the squad - a crushing blow that forced him to reevaluate his path. Returning to South Australia, Carey initially aimed to continue his football career with Glenelg. But life had other plans. He decided to switch focus back to cricket, playing grade cricket for the Glenelg Cricket Club in the 2012–13 season. Starting as a specialist batter, Carey’s early performances showed promise, but his debut in South Australia’s domestic team as a top-order batter in 2013 didn’t yield the success he hoped for. Averaging just 10.1 in six innings, he was dropped from the side. Yet, this setback became a turning point. Carey reinvented himself as a wicket-keeper, a role that transformed his career. Carey’s hard work and persistence began to pay off during the 2015–16 season, where he scored over 800 runs at an astonishing average of 90.22 for Glenelg. His breakthrough performances earned him a call-up to the South Australian side, where he replaced the experienced Tim Ludeman as wicket-keeper during the final rounds of the Sheffield Shield season. The following season, Carey’s meteoric rise continued. He became just the fourth player in Sheffield Shield history to record 500 runs and 50 dismissals in a single season, setting a record for the most dismissals by a wicket-keeper in a Shield season. By 2017, Carey was recognized as one of Australia’s most promising wicket-keepers. His selection for Australia A and his performances in domestic cricket underscored his potential. Although he narrowly missed out on a spot in the Test team for the 2017–18 Ashes, he didn’t let the disappointment deter him. That season, he scored his maiden first-class century and solidified his reputation as a dependable batter and a brilliant wicket-keeper. Carey’s international debut came in January 2018 during an ODI against England, stepping in for an ill Tim Paine. Shortly after, he made his T20I debut during the Trans-Tasman Tri-Series. His performances earned him a national contract with Cricket Australia for the 2018–19 season. The 2019 ICC Cricket World Cup marked a defining moment in Carey’s career. He scored 375 runs and set a record for the most dismissals by a wicket-keeper in a single World Cup, earning a spot in the ICC’s Team of the Tournament and the title of the squad’s rising star. While Carey’s journey wasn’t without challenges, losing his spot as Australia’s T20I wicket-keeper in 2020, he consistently fought back. His maiden ODI century against England in September 2020 and his appointment as ODI captain in 2021 showcased his resilience and leadership. That same year, he made his Test debut during the Ashes, equaling the record for most catches by a wicket-keeper on debut. Carey continued to make waves in Test cricket. In December 2022, he scored his maiden Test century during the Boxing Day Test, becoming only the second wicket-keeper to achieve this feat at the MCG. The following year, he played a crucial role in Australia’s World Test Championship victory and made headlines during the Ashes for his controversial yet astute stumping of Jonny Bairstow. In 2023, Carey was named in the ICC Men’s Test Team of the Year, a testament to his growing stature in world cricket. His heroics continued into 2024, equaling Adam Gilchrist’s record for the most catches in a match by an Australian wicket-keeper and playing a match-winning knock of 98* against New Zealand. Alex Carey’s story is a testament to the power of resilience and reinvention. From the heartbreak of missing out on an AFL career to becoming one of cricket’s most reliable wicket-keepers, Carey has shown that setbacks are just stepping stones to success. His journey inspires not just cricketers but anyone striving to turn challenges into opportunities.",
  "nationality": "Australia",
  "career_span": {
    "Test": "2021-2025",
    "ODI": "2018-2025",
    "IPL": "2020-2020"
  }
}