{
  "id": "pprofile_82839",
  "type": "player_bio",
  "player": "Arshad Khan",
  "full_name": "Mohd Arshad Khan",
  "dob": "December 20, 1997",
  "role": "Bowler",
  "batting_style": "Left Handed",
  "bowling_style": "Left-arm medium",
  "teams": [
    "Mumbai Indians",
    "Madhya Pradesh",
    "Lucknow Super Giants",
    "Gujarat Titans",
    "Reliance 1",
    "Bhopal Leopards"
  ],
  "bio": "Arshad Khan, a talented left-arm medium pacer from India, has been making a name for himself in domestic cricket with his remarkable performances. Khan has become a key figure in the Madhya Pradesh bowling attack. His standout performance in the 2023 Vijay Hazare Trophy, where he claimed three wickets for just nine runs against Punjab, underscored his potential to make a significant impact on the Indian cricketing stage. Arshad first attracted attention during the 2019-20 Under-25 CK Nayudu Trophy, where he emerged as the top wicket-taker with 36 wickets and also accumulated 400 runs. His notable contributions included a century (134) against Assam and an aggressive 86 off 54 balls, which featured five sixes and nine fours, against Mumbai. Khan's IPL journey began in 2022 when he was picked by Mumbai Indians, but an injury kept him out of action that season. He made his IPL debut in 2023 with Mumbai Indians and was later bought by Lucknow Super Giants for the 2024 season at INR 20 lacs. Although his wicket tally in the IPL has been modest, his best bowling figures of 3/39 against Rajasthan Royals in 2023 highlighted his ability to perform under pressure. His batting skills have also been promising, with a highest score of 58* against Delhi Capitals in the 2024 IPL season, showcasing his potential as a lower-order hitter. In the domestic T20 circuit, Khan has remained consistent, with his recent performance in the 2024 Syed Mushtaq Ali Trophy standing out—he took three wickets for just five runs against Meghalaya, proving his ability to deliver in crucial moments. His reliable bowling, reflected in a healthy average and strike rate in List A cricket, makes him a valuable asset in the domestic arena. Recognizing his continued growth, Arshad Khan has found a new opportunity in the IPL, as he was picked up by Gujarat Titans for the 2025 season in the mega auction, at a whopping INR 1.30 crores, way more than his base price, which further signals his rise as a promising talent in Indian cricket.",
  "nationality": "India",
  "career_span": {
    "IPL": "2023-2025"
  }
}