{
  "id": "pprofile_67172",
  "type": "player_bio",
  "player": "Suyash Prabhudessai",
  "full_name": "Suyash S Prabhudessai",
  "dob": "December 6, 1997",
  "role": "Batsman",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm medium",
  "teams": [
    "India B",
    "Royal Challengers Bengaluru",
    "Goa",
    "DY Patil Group A"
  ],
  "bio": "Suyash Prabhudessai is an upcoming young batter from Goa. He made his List A debut in the 2016–17 Vijay Hazare Trophy, and then in the next season, he represented Goa in the Ranji Trophy. In the same year, Suyash made his T20 debut in the Syed Mushtaq Ali Trophy. His impressive batting in the T20 format was noticed by Bengaluru as they bagged him in the 2021 Indian Premier League auction. Prabhudessai became the fourth player from Goa to have landed a contract in the league. Considering the big Indian and overseas names in the Bengaluru setup, Suyash could not make it to the playing XI and warmed the bench for the entirety of the 2021 Indian Premier League season. In the 2021–22 Vijay Hazare and Syed Mushtaq Ali Trophy, Suyash did a decent job as a finisher for Goa. He was retained by Bengaluru for the 15th edition of the Indian Premier League in 2022, where he was able to show promise to some extent in the limited opportunities that season. The right-hander took this invaluable Indian Premier League experience to the domestic arena, where he was able to hit his stride for Goa. Although the 2023 Indian Premier League season was not the one he hoped for, Bengaluru have kept faith in the talented young batter. Although his state team could not make it past the group stage in the 2023–24 Ranji Trophy, he was one of the bright spots for them, with three hundreds to his name and amassing 687 runs at an average of 57.25. As Bengaluru eye their first-ever Indian Premier League title, Suyash will be aiming to translate his success and repay the faith shown in him by the franchise.",
  "nationality": "India",
  "career_span": {
    "IPL": "2022-2024"
  }
}