{
  "id": "pprofile_4555",
  "type": "player_bio",
  "player": "Ravichandran Ashwin",
  "full_name": "Ravichandran Ashwin",
  "dob": "September 17, 1986",
  "role": "All Rounder",
  "batting_style": "Right Handed",
  "bowling_style": "Off break",
  "teams": [
    "India",
    "India A",
    "India Blue",
    "India Green",
    "India Red",
    "Nottinghamshire",
    "Rest of India",
    "Surrey",
    "South Zone",
    "Worcestershire",
    "Yorkshire",
    "Punjab Kings",
    "Chennai Super Kings",
    "Delhi Capitals",
    "Rajasthan Royals",
    "Tamil Nadu",
    "Rising Pune Supergiant",
    "Dindigul Dragons",
    "Indians",
    "Mylapore Recreation Club A"
  ],
  "bio": "Ravichandran Ashwin, affectionately known as Ash, stands as one of cricket's premier spin wizards. The tall, imposing off-spinner from India has made batters worldwide dance to his tactical mastery. His immaculate control over spin variations, combined with his analytical approach to bowling, quickly established him as an all-format player for India. With such refined artistry in his craft, it came as no surprise when he swiftly became a key asset in India's bowling arsenal and went onto becoming one of the most successful bowlers in Indian cricket. Ashwin's success in cricket stems not only from his intellectual approach to the game but also from his deep understanding of bowling techniques. Though now renowned for his mastery of spin, Ashwin's cricketing journey began quite differently. During his early days in Tamil Nadu's age-group cricket, he was primarily known as a top-order batsman, regularly opening the innings for his state team. Ashwin chose to switch roles and take up spin bowling, believing that the competition among batters for a spot in the Tamil Nadu Ranji Trophy team was intense. According to Ashwin, off-spin offered him a better opportunity to break into the side. This surprising fact adds an interesting layer to his evolution as one of cricket's premier spin bowlers. After honing his skills in domestic cricket, Ashwin's breakthrough moment came during the 2010 Indian T20 League. An impressive showing in the competition playing for Chennai, proved to be his gateway to international cricket, as he earned his maiden call-up to the Indian team for a tri-series in Zimbabwe in May 2010. The same year, Ashwin also made his ODI debut against Sri Lanka where he impressed with his bowling as well as batting stint. He not only picked up two crucial wickets with the ball but also demonstrated his batting capabilities by scoring a valuable 38 runs. Ashwin was also the part of the World Cup winning team in 2011. At a crucial juncture in Indian cricket, when the legendary Anil Kumble had just hung up his boots and Harbhajan Singh's influence was gradually diminishing, a void in India's spin department needed filling. It was then that Ravichandran Ashwin emerged as the perfect answer to India's spinning concerns. In his debut Test match against West Indies in 2011, Ashwin was the Player of the Series and also became the seventh bowler to take a 5-fer on Test debut. He also went onto picking up 18 wickets in his debut Test series, almost cementing his place in the side. With the bat, Ashwin notched up a century in the third Test against the same opposition and proved that he is no alien with this stint too. By the end of 2012, Ashwin had set a record as the fastest Indian bowler to reach 50 Test wickets, although this milestone was later surpassed by Jasprit Bumrah. In the subsequent year, he claimed his 100th Test wicket, becoming the quickest Indian to achieve this feat. Additionally, Ashwin was among India’s top wicket-takers during the 2013 ICC Champions Trophy where India clinched the title. During his peak years, Ashwin's skill and precision allowed him to thrive in both red and white-ball cricket simultaneously. He became a key figure in franchise cricket, playing for Chennai from 2009 to 2015 and representing five different franchises in the Indian T20 League. Ashwin also served as the captain of the Punjab team from 2018 to 2019. Ahead of the 2020 season, he was traded to Delhi, where he played for two years before eventually joining the Rajasthan team. Purchased for INR 9.75 crore in the Indian T20 League 2025 mega auction, Ashwin is set to make his return to Chennai. Life has come full circle for him as he rejoins the franchise that played a pivotal role in his early career and helped him find his footing. Additionally, he is expected to continue his participation in the Tamil Nadu Premier League (TNPL) and other club-level cricket. Ashwin's remarkable consistency and performances on the field earned him numerous accolades over the years. In recognition of his outstanding achievements, he was awarded the prestigious Arjuna Award by the Indian government in 2015. Following a stellar 2015-16 season, he was named the ICC Men's Cricketer of the Year as well as the Men's Test Cricketer of the Year in 2016. He was also named in the ICC Test Team of the Decade 2011-20. Ashwin, the quickest bowler to reach 250, 300, and 350 Test wickets, concludes his career with a total of 537 wickets, securing the seventh spot on the all-time list of highest wicket-takers in Test cricket history. Ashwin's record of 37 five-wicket hauls in Test matches, including one on debut, is the joint-second highest alongside the late Shane Warne, trailing only Muttiah Muralitharan's tally of 67. Ashwin also holds the record for most dismissals of left-handed batters in Test cricket, with 268 wickets of his own. A valuable lower-order batter, he scored 3503 runs in Test cricket, including six centuries and 14 fifties. He also holds the Indian record for the most instances of scoring a century and taking a five-wicket haul in the same Test, with four such occurrences, second only to Ian Botham, who achieved this feat five times. As he concludes his playing days, Ashwin announced his retirement from international cricket in December 2024 during the midway of the Border-Gavaskar Trophy 2024/25, bringing an end to a remarkable career that has left an indelible mark on Indian and world cricket. The prodigal son returned to his first IPL home when the paddles rose dramatically in Jeddah. After three seasons with Rajasthan Royals, the 38-year-old veteran found himself at the center of an intense bidding war that captivated the auction floor. Chennai Super Kings, where his IPL journey began in 2009, locked horns with Royal Challengers Bangalore and Lucknow Super Giants in a high-stakes battle for his signature. As the bids climbed higher, the atmosphere grew electric. When the dust settled, it was the familiar yellow of Chennai that secured his services for a commanding INR 9.75 crores. Sixteen years after first donning the CSK colors, his career had come full circle, a homecoming that promised to write one more chapter in his storied IPL legacy.",
  "nationality": "India",
  "career_span": {
    "Test": "2011-2024",
    "ODI": "2010-2023",
    "IPL": "2009-2025"
  }
}