{
  "id": "pprofile_68182",
  "type": "player_bio",
  "player": "Mohsin Khan",
  "full_name": "Mohsin Khan",
  "dob": "July 15, 1998",
  "role": "Bowler",
  "batting_style": "Left Handed",
  "bowling_style": "Left-arm medium fast",
  "teams": [
    "Central Zone",
    "Mumbai Indians",
    "Uttar Pradesh",
    "Lucknow Super Giants",
    "Kanpur Superstars",
    "Gaur Gorakhpur Lions"
  ],
  "bio": "Mohsin Khan is another rising speedster produced by India in recent times. Born on 15th July 1998 in Sambhal in Uttar Pradesh, the tall and well-built left-arm quick bowler has shown he can consistently bowl around the 140 kph mark. Mohsin made his T20 debut for Uttar Pradesh in the 2018 Syed Mushtaq Ali Trophy. He rose to fame in that competition when he ended up with 13 wickets in eight matches. He played his first List A game in the Vijay Hazare Trophy the following month and a couple of years later, he made his first-class debut in the Ranji Trophy. In 2018, he was picked up by the Mumbai franchise for the Indian Premier League but did not get an opportunity to play games. However, doing net sessions with the likes of Jasprit Bumrah and Mustafizur Rahman helped him learn and improve his game. He was released ahead of the 2019 season but re-signed for the franchise in 2020 but once again remained as a squad player for two seasons. His big break came when he was bought by Lucknow in the mega auction for the 2022 Indian Premier League and he showed his pace to trouble the batters. He finally played his first game in the competition against Gujarat and finished the season with 14 wickets in nine matches. His best figures came against the Delhi franchise when he picked up four wickets for 16 runs in his four overs and helped his side to a narrow win. Mohsin is a skiddy customer, and it is hard for the batters to judge his pace, which makes him more dangerous. He is still very young and, with proper training and management, could become a huge asset for Lucknow as well as India in the future.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "",
    "IPL": "2022-2024"
  }
}