{
  "id": "pprofile_89168",
  "type": "player_bio",
  "player": "Raj Angad Bawa",
  "full_name": "Raj Angad Bawa",
  "dob": "November 12, 2002",
  "role": "All-Rounder",
  "batting_style": "Left Handed",
  "bowling_style": "Right-arm medium fast",
  "teams": [
    "India A",
    "Punjab Kings",
    "Mumbai Indians",
    "India Under-19",
    "India A Under-19",
    "India B Under-19",
    "Chandigarh",
    "Talanoa Tigers"
  ],
  "bio": "Raj Angad Bawa has quickly established himself as a promising all-rounder in Indian cricket, known for his ability to make an impact with both bat and ball. Born on 12th November 2002 in Nahan, Himachal Pradesh, he developed his game in Chandigarh, where he honed his skills as a left-handed batter and right-arm medium-fast bowler. His breakout moment came during the 2022 ICC U19 World Cup, where he was instrumental in India’s title-winning campaign. Scoring 252 runs at an average of 63 and taking nine wickets, Bawa’s standout performance in the final against England U19, where he took five wickets and contributed 35 runs, earned him the Player of the Match award. In domestic cricket, Bawa has continued to impress, proving himself as a dependable all-rounder. In the Ranji Trophy, he has amassed over 630 runs at an average above 42, with a top score of 146 against Assam. His bowling has also been effective, securing more than 12 wickets and providing crucial breakthroughs for his team. In the Syed Mushtaq Ali Trophy, he has been a vital contributor, scoring over 300 runs and claiming more than 20 wickets, further strengthening his reputation as a reliable performer in the shortest format. Bawa’s IPL journey began when he was picked up by Punjab for INR 2 crore in 2022. Although his early appearances were limited, he showcased glimpses of his potential, particularly in domestic T20 cricket. One of his most notable performances came in an unofficial ODI against New Zealand A, where he recorded figures of 4/11, underlining his ability to deliver match-winning spells. Ahead of the 2025 IPL season, Mumbai secured his services, recognizing his growing potential. As Raj Angad Bawa continues to refine his skills, his next challenge lies in successfully transitioning to the international stage. With his all-round capabilities and a strong domestic record, he remains a player to watch in Indian cricket's future.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "",
    "IPL": "2022-2025"
  }
}