{
  "id": "pprofile_63797",
  "type": "player_bio",
  "player": "Shai Hope",
  "full_name": "Shai Diego Hope",
  "dob": "November 10, 1993",
  "role": "Wicket-Keeper",
  "batting_style": "Right Handed",
  "bowling_style": "-",
  "teams": [
    "West Indies",
    "Barbados Pride",
    "Yorkshire",
    "Delhi Capitals",
    "Hobart Hurricanes",
    "West Indies Cricket Presidents XI",
    "Rangpur Riders",
    "Barbados Royals",
    "Guyana Amazon Warriors",
    "Lahore Qalandars",
    "Khulna Tigers",
    "West Indians",
    "Multan Sultans",
    "Dubai Capitals"
  ],
  "bio": "Class apart cricketer and a highly talented one too, Shai Hope started his cricketing journey with the traditional format of the game when he made his first-class debut in the year 2013. But he only came into the reckoning after a remarkable 2014-15 season where he was the fourth highest run-getter with a double century to his name. Soon after his domestic heroics, Shai was selected for the series against England. He made his Test debut as a 21-year old against in the year 2015 but couldn't replicate his domestic form. In 2016, he made his white-ball debut against Sri Lanka in the ODI tri-series involving Zimbabwe. In just his second ODI appearance, he scored his maiden ODI century against Zimbabwe. When West Indies toured England in the year 2017, Hope was all over the record books. He helped his team beat England for the first time since 2000 and also became the first player in 127 years to score centuries in each innings at Headingley, Leeds. Shai established himself as the key member of the Test and ODI squads and in the year 2019, he along with John Campbell stitched the highest opening partnership of 365 runs in an ODI against Ireland. In that same series, he became the fastest West Indian to score 2000 runs in just 47 innings. Hope's prowess in ODI cricket has been remarkable, evidenced by his inclusion in the ICC ODI Team of the Year on multiple occasions. His milestone achievements include becoming the third-fastest batter to reach 4,000 ODI runs and the fastest West Indian to surpass 5,000 ODI runs, equalling the legendary Sir Vivian Richards' record. With 16 ODI centuries to his name, Hope's batting prowess and consistency have been instrumental in West Indies' success in the limited-overs format.",
  "nationality": "West Indies",
  "career_span": {
    "Test": "2015-2025",
    "ODI": "2016-2025",
    "IPL": "2024-2024"
  }
}