{
  "id": "pprofile_67859",
  "type": "player_bio",
  "player": "Daniel Sams",
  "full_name": "Daniel Richard Sams",
  "dob": "October 27, 1992",
  "role": "All-Rounder",
  "batting_style": "Right Handed",
  "bowling_style": "Left-arm fast medium",
  "teams": [
    "Australia",
    "Canterbury",
    "Essex",
    "Nottinghamshire",
    "Royal Challengers Bengaluru",
    "Delhi Capitals",
    "Mumbai Indians",
    "New South Wales",
    "Sydney Sixers",
    "Sydney Thunder",
    "Barbados Royals",
    "Karachi Kings",
    "Peshawar Zalmi",
    "Bangla Tigers",
    "Vancouver Knights",
    "Northern Superchargers",
    "Trent Rockets",
    "New South Wales XI",
    "Lucknow Super Giants",
    "Sharjah Warriorz",
    "Texas Super Kings"
  ],
  "bio": "Daniel Sams is an Australian all-rounder who bowls right-arm fast-medium and is a right-handed batter who plays the role of a reliable finisher lower down the order. He can use the slower ball extremely well while deceiving the batters with tons of variations and is better suited for the requirements of white-ball cricket. Sams was born on 27th October 1992 in Milperra in New South Wales and he made his first-class debut for Canterbury in the 2017-18 Plunket Shield. Although he started his domestic career relatively late, he made an instant impact as he scored 49 runs in the first innings picking up three wickets, and followed it up with a brilliant 88 in the second outing with the bat. The following year, he made his List A debut for New South Wales in the 2018–19 JLT One-Day Cup where he made 62 runs and picked up three wickets which resulted in him being adjudged the Player of the Match. Daniel Sams had by then already proven his worth as a white-ball bowler. About a year prior, he had made his T20 debut for Sydney Sixers in the Australian T20 League. 20-over cricket seemed to suit him immediately as he produced a magical spell of four wickets for 14 runs in his four overs on debut. Sams wasn't initially picked in the squad and was on his way back to the domestic circuit grind but destiny had better things planned for the lanky pace bowler as he was drafted into the Sydney Sixers' side as an injury replacement for Henry Thornton. And the rest, as they say, is history. In his first two Australian T20 League seasons he took 45 wickets and his 30 wickets in the 2019-20 edition set a new record for most wickets in a single tournament overtaking Melbourne paceman Kane Richardson who claimed 24 in 2018/19. He continued to perform well in the shortest format resulting in a call-up to the national side and he made his T20I debut against India in 2020. He continued to be in contention for national selection in the shortest format of the game and was named as one of three players as injury cover in Australia's squad for the 2021 ICC Men's T20 World Cup. In 2022, while playing against Melbourne, he just fell short of his maiden ton when he scored a four in the last ball of the innings and ended on 98 not-out. In the Indian Premier League, Sams has been a journeyman, with his first stint at the Delhi franchise in the 2020 season before he was traded to Bangalore the following year. In 2022, the Mumbai franchise bought him in the auctions but he was unable to make a solid impact which prompted them to release the all-rounder. After being overlooked for the 2022 ICC Men's T20 World Cup by the Australian selectors, Sams was raring to prove his abilities and the Lucknow franchise gave him a good opportunity when they bought him in the auction at his base price for the 2023 Indian T20 League. He is a great asset to have with his all-round abilities well-honed and it is only a matter of time before he gives a massive performance.",
  "nationality": "Australia",
  "career_span": {
    "Test": "",
    "ODI": "",
    "IPL": "2020-2022"
  }
}