{
  "id": "pprofile_4330",
  "type": "player_bio",
  "player": "Kane Williamson",
  "full_name": "Kane Stuart Williamson",
  "dob": "August 8, 1990",
  "role": "Batsman",
  "batting_style": "Right Handed",
  "bowling_style": "Off break",
  "teams": [
    "New Zealand",
    "Gloucestershire",
    "Northern Districts",
    "New Zealand A",
    "Yorkshire",
    "Middlesex",
    "New Zealand Under-19",
    "Sunrisers Hyderabad",
    "Barbados Royals",
    "Karachi Kings",
    "New Zealanders",
    "Surrey Jaguars",
    "Birmingham Phoenix",
    "London Spirit",
    "Gujarat Titans",
    "Durban's Super Giants"
  ],
  "bio": "At a time when New Zealand were struggling to get to grips with Test cricket after the retirement of the likes of Stephen Fleming, on came Kane Williamson, a technically sound batter with the skill to face lethal pace attacks and, at the same time, tackle quality spinners with nimble footwork. Born in a cricketing family, the right-hander was a sensation from his school days and went on to represent Northern Districts at the Under-17 level. He made his first-class debut against Auckland in 2007 before captaining New Zealand in their 2008 Under-19 WC campaign. A decent 2008-09 season was followed by a fantastic 2009-10 one where he excelled particularly in the shorter format. This earned him a contract with the national side, and he made his ODI debut in 2010 against India. He fell for a duck in his first two games, but in his fifth game, despite being injured and aided by a runner, Williamson showed great determination to score his maiden century, which very nearly won the game for the Kiwis against Bangladesh. Later that year, he went on to score his maiden Test century in his very first game against India in Ahmedabad. A quiet 2011 was followed up with a brilliant 2012 when a gritty, unbeaten Test ton against the fiery fast bowling attack of Dale Steyn and Co. saved New Zealand from a humiliating defeat. In 2012, he was appointed stand-in skipper in place of injured Ross Taylor for the ODI series against West Indies. Williamson continued to perform well in international games and was appointed the deputy to Brendon McCullum for the 2015 World Cup. The Kiwi batter had a quiet World Cup according to his standards, but his knock against Australia when he took the Kiwis home after surviving a devastating spell of fast bowling from Mitchell Starc proved his credentials. After the retirement of Brendon McCullum in 2016, Williamson was appointed the captain of New Zealand for all formats. Williamson made his Indian Premier League debut in 2015 for the Hyderabad team as a backup for David Warner and hence did not get many opportunities in the initial seasons. In the 2018 edition, Kane was appointed the captain of Hyderabad in the absence of David Warner. He had a prolific tournament as he ended up as the highest run-scorer (735 runs) and also led his team to the final, where they lost to Chennai. Riding on his great leadership and batting form, the Kiwis entered the final of the 2019 World Cup and gave England a good run for their money, missing the trophy by a whisker. Kane had an outstanding World Cup and was adjudged the Player of the Tournament. The wait for an ICC title finally ended for Kane Williamson and New Zealand when they defeated India in the inaugural World Test Championship final in 2021. The victory was even more special for Kane, as he was at the other end when Ross Taylor hit the winning runs. Later that year, he led New Zealand to the T20 World Cup final, but they fell short against Australia. In 2022, Kane stepped down as Test captain, passing the baton to Tim Southee. In 2023, Williamson made a fresh start in the IPL, joining Gujarat after an eight-season stint with Hyderabad, where he had won the title in 2016. However, his season was cut short in the very first game due to a knee injury, casting doubts over his participation in the World Cup later that year. Despite the setback, he made a strong recovery and led New Zealand in the tournament, but their hopes of going one step further than 2019 were dashed by India in the semifinal. A year later, in 2024, New Zealand endured another disappointment, failing to progress beyond the group stage at the T20 World Cup. Soon after, Kane stepped down as white-ball captain and declined a central contract to keep his overseas playing opportunities open. Later that year, Kane missed the tour of India, raising concerns about how the Kiwis would fare in challenging conditions without their talismanic batter. However, the Kiwi spirit was on full display as others stepped up in his absence, delivering a stunning whitewash against India in their backyard. After being released by Gujarat following the 2024 season, Williamson went unsold at the IPL auction. However, he found a new opportunity when Karachi Kings picked him up for the 2025 season in the Pakistan Super League draft.",
  "nationality": "New Zealand",
  "career_span": {
    "Test": "2010-2024",
    "ODI": "2010-2025",
    "IPL": "2015-2024"
  }
}