{
  "id": "pprofile_3674",
  "type": "player_bio",
  "player": "Dale Steyn",
  "full_name": "Dale Willem Steyn",
  "dob": "June 27, 1983",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm fast",
  "teams": [
    "South Africa",
    "Africa XI",
    "Essex",
    "Glamorgan",
    "Hampshire",
    "Northerns",
    "South Africa A",
    "Titans",
    "Warwickshire",
    "Royal Challengers Bengaluru",
    "Deccan Chargers",
    "Cape Cobras",
    "Brisbane Heat",
    "Melbourne Stars",
    "Sunrisers Hyderabad",
    "Jamaica Tallawahs",
    "Gujarat Lions",
    "Islamabad United",
    "Quetta Gladiators",
    "Cape Town Knight Riders",
    "Cape Town Blitz",
    "Glasgow Giants",
    "Kandy Falcons",
    "World Giants",
    "South Africa Champions"
  ],
  "bio": "The relatively quick metamorphosis of Dale Steyn from an express bowler to an express world class bowler mirrors South Africa's progress from mediocrity to world beaters. Inspired by the generation of Lees and Akhtars, the shortcomings on pace alone were grasped sooner by Steyn than his contemporaries. With a mixture of accuracy and swing to combine with pace, he soon rose to the pinnacle of Test bowling to become one of cricket's most dangerous strike bowlers. On the tour to Sri Lanka in 2006 where bulk wickets at irregular intervals were masked by an economy rate higher than six, led to him being dropped in the return series against Pakistan in the same year. However, he was recalled for the subsequent Test series against New Zealand. He ended up playing both Tests, dismantling the Kiwis with 10 wickets in each of them, leading South Africa to historic victories. It was a timely improvement as veteran Shaun Pollock announced his retirement a few months later. Following the New Zealand tour, Steyn's bowling displays often revolved around refreshing discipline with a decrease in economy. On the tour to Australia in 2008-09, in tandem with Makhaya Ntini, Steyn helped South Africa clinch their first Test series win against the Aussies. He added another 10-wicket haul to his credit in Melbourne, in a match which the Proteas won by 9 wickets. In Nagpur, Steyn inflicted an innings defeat on India when he picked up a 10-fer in the game which included his career best 7/51 in the first innings. Indian T20 League contracts too, ensued soon after with Steyn penning a jackpot deal with Bengaluru and then with Hyderabad. In one of the most devastating spells in Test cricket in February 2013, Steyn rattled Pakistan helping South Africa bundle them out for 49 with breathtaking figures of 6-8. While comparisons with contemporaries continue, it is fair to say Steyn's consistency over large periods has been unmatched in the modern era of cricket, already making him the best fast bowling product following the turn of the millennium. Steyn is well on his way to becoming the leading wicket-taker for South Africa in Tests. He continued his brilliant year taking 30 wickets of his next 7 Test matches rattling the opposition's batting line-up. Steyn was pretty successful in World T20 too, taking nine wickets of five matches and bowled one of the best over of T20 history when he defended seven runs of the last over against New Zealand. Steyn was retained by his Hyderabad franchise at the starting of the seventh season of Indian T20 League. Dale Steyn was always destined for greatness and in 2017, he completed 400 Test wickets. Soon he surpassed Shaun Pollock to become the leading wicket-taker for South Africa in Tests. The fast bowler had his fair share of struggle with injuries which restricted his presence in the national team. The speedster eventually announced his retirement from Test cricket to focus on limited-overs cricket. He had high hopes of signing off with a bang by participating in the 2019 World Cup but once again Steyn was ruled out owing to a shoulder injury. With age getting to him and his body not able to withstand all the pressure, Dale Steyn found it tough to return on the field. He went unsold twice during the auction of the 13th edition of the Indian T20 League but eventually found a bid from Bengaluru at his base price.",
  "nationality": "South Africa",
  "career_span": {
    "Test": "2004-2019",
    "ODI": "2005-2019",
    "IPL": "2008-2020"
  }
}