{
  "id": "pprofile_64440",
  "type": "player_bio",
  "player": "Rahul Tewatia",
  "full_name": "Rahul Tewatia",
  "dob": "May 20, 1993",
  "role": "All-Rounder",
  "batting_style": "Left Handed",
  "bowling_style": "Leg break",
  "teams": [
    "India",
    "Punjab Kings",
    "Delhi Capitals",
    "Rajasthan Royals",
    "Haryana",
    "Gujarat Titans",
    "DY Patil Group A"
  ],
  "bio": "Rahul Tewatia, born on the 20th of May, 1993, is known for his explosive batting style and has an exquisite ability that a finisher desires to have in his/her dreams. His career trajectory has been through incredible highs and unexpected lows as well, which showcases his resilience and ability to bounce back from any position. His grandfather desired to make his grandson a wrestler, as his grandfather, Karanveer Tewatia, was a farmer and a wrestler. His uncle, Dharmbir Tewatia, was also in an attempt to develop Rahul into a hockey player, but he had other plans for himself. Tewatia burst out on the domestic scene in December 2013, where he made his debut in the 2013-14 Ranji Trophy for Haryana against Karnataka. After some years, in February 2017 he made his List A for Haryana in the 2016-17 Vijay Hazare Trophy, in which, he picked up a wicket and scored crucial 62 runs not out, and helped his team win the match. He continued performing pretty decent and to date he represents his state in First Class as well as List A campaigns. In 2014, Rahul was recruited by Rajasthan just before the 2014 Indian Premier League and also made his debut in the same season. But due to lack of appearances, in 2017, he was bought by Punjab for INR 25 Lakhs. Then in the next season, Delhi saw some spark in the youngster and bid INR 3 Cr. For Tewatia. However, his performance was not that up to the mark, despite of getting quite a few chances. In the 2019 Indian Premier League, he was able to set the joint record for taking the maximum number of catches by a non-wicketkeeper. But in 2019, he was traded to his debut team, Rajasthan before the start of the 2020 season. But not only Tewatia knew that the season was going to change his career. Rajasthan was up against his former team, Punjab and they needed 24 runs in the last over. It was when the charms worked for Rahul and he single-handedly snatched the victory by smoking five consecutive sixes off the park. This sensational inning not only secured a thrilling win for his team but also pushed him into the limelight. On the same night, he also leveled up the record of Chris Gayle’s record for hitting the most number of sixes in an over of an Indian Premier League match. He also made his highest number of runs scored in the Indian Premier League, scoring 53 runs from 31 deliveries. He also helped his team to chase the target of 224 runs, which was registered as the highest run chase in the history of the Indian Premier League. In 2022, Gujarat paid the price of INR 9 Cr. to buy him in the auction of the season 2022. He also helped his team a couple of times to win the match despite being in a tough position. He played a pivotal role in winning his team the maiden League title. After that, Gujarat renewed him till season 2024 knowing his explosive potential and adaptability which makes him a valuable asset in any team. While Tewatia's run tally may not feature massive scores, his ability to consistently contribute quickfire 30s and 40s towards the end of innings, along with his knack for batting deep, has made him a valuable asset for GT. With 188 runs at an impressive strike rate of 135 in the year 2024, Tewatia became an obvious choice for retention, and GT decided to keep him on board for the 2025 IPL season as well.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "",
    "IPL": "2014-2025"
  }
}