{
  "id": "pprofile_67628",
  "type": "player_bio",
  "player": "Vyshak Vijaykumar",
  "full_name": "Vyshak Vijaykumar",
  "dob": "January 31, 1997",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm medium",
  "teams": [
    "India",
    "South Zone",
    "Royal Challengers Bengaluru",
    "Punjab Kings",
    "Karnataka",
    "Mangalore United",
    "Mysore Warriors",
    "Bijapur Bulls",
    "India C",
    "Gulbarga Mystics"
  ],
  "bio": "Vijaykumar Vyshak, hailing from Bengaluru, is a right-arm fast bowler whose cricketing journey is marked by determination and versatility. Starting his cricketing career primarily as a batter, Vyshak excelled in junior cricket, even notching up a century while leading Karnataka U-16. However, it was at the age of 17 when Vyshak decided to add medium-pace bowling to his repertoire. Driven by the desire to prove his academy coach wrong, who doubted his ability to bowl fast, Vyshak embarked on a transformation journey to become an out-and-out pacer. His breakthrough came in the 2020–21 Vijay Hazare Trophy, where he made his List A debut for Karnataka, showcasing his skills in the domestic arena. He continued to impress, making his T20 debut in the 2021–22 Syed Mushtaq Ali Trophy and subsequently his first-class debut in the 2021–22 Ranji Trophy. In the 2023 edition of the Indian Premier League, Vyshak received a significant opportunity when he was named as a replacement for the injured Rajat Patidar. In a matter of weeks, he transitioned from serving as a net bowler for Bengaluru to securing a spot in the playing XI. His debut game was memorable, with figures of 3 for 20 in Bengaluru's victory over Delhi. Finishing the season with 9 wickets from 7 matches, Vyshak was retained by the franchise for the following edition. His stellar performance in the 2023/24 Ranji Trophy season, where he claimed 39 wickets and also scored a century, further underscored his potential as a dynamic cricketer. After Bengaluru released him following the 2024 IPL season, Punjab acquired his services by picking him in the auction for the 2025 edition, showing faith in his potential.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "",
    "IPL": "2023-2025"
  }
}