{
  "id": "pprofile_65748",
  "type": "player_bio",
  "player": "Rashid Khan",
  "full_name": "Rashid Khan Arman",
  "dob": "September 20, 1998",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Leg break googly",
  "teams": [
    "Asia XI",
    "ICC World XI",
    "Afghanistan Under-19",
    "Sussex",
    "Afghanistan",
    "Adelaide Strikers",
    "Sunrisers Hyderabad",
    "Barbados Royals",
    "Guyana Amazon Warriors",
    "St Kitts and Nevis Patriots",
    "Comilla Victorians",
    "Quetta Gladiators",
    "Lahore Qalandars",
    "Band-e-Amir Dragons",
    "Speen Ghar Tigers",
    "Bangla Tigers",
    "Maratha Arabians",
    "Kabul Zwanan",
    "Durban Heat",
    "Rotterdam Rhinos",
    "Oval Invincibles",
    "Trent Rockets",
    "Gujarat Titans",
    "New York Strikers",
    "MI Cape Town",
    "MI Emirates",
    "MI New York"
  ],
  "bio": "Born into a Pashtun family in the village of Nangarhar, Afghanistan, Rashid Khan's early life was spent in a refugee camp in Peshawar. He developed a passion for cricket after watching Shahid Afridi and soon began to idolize him. Rashid modeled his bowling action on Afridi's quick-arm technique and worked tirelessly to develop a range of variations to succeed in the batting-dominated sport. A few months after his 17th birthday, Rashid Khan received the opportunity to represent Afghanistan. He made his ODI debut in 2015 against Zimbabwe in Bulawayo. The young Afghan leg-spinner quickly made a mark, dominating among Associate Nations, particularly in the shortest format of the game. His remarkable bowling figures of 2-1-3-5 against Ireland in a T20I match caught the attention of many, and Rashid soon found himself playing for the Hyderabad franchise in the Indian T20 League. Rashid's career trajectory soared as he and Mohammad Nabi became the two standout stars of Afghan cricket. Rashid broke numerous records on his journey to success, including becoming the first Associate nation cricketer to take a 7-wicket haul in an ODI match, against the West Indies. In 2018, the ICC named him the Associate Cricketer of the Year, and there seemed to be no stopping this Afghan sensation. Following his success in the Indian Premier League, Rashid signed with Guyana Amazon Warriors in the Caribbean Premier League (CPL), where he also took the first-ever hat-trick in the tournament's history. He later played for Adelaide Strikers in the Big Bash League (BBL) and played a key role in their successful campaign. Rashid's performances coincided with Afghanistan's rise in international cricket, and soon the ICC granted the country Full Membership and Test status. Expectations were high for Rashid Khan at the 2019 Cricket World Cup, but the Afghan star's performance did not meet those expectations, reflecting in Afghanistan's overall performance. Nevertheless, the selectors showed faith in Rashid’s potential and appointed the 20-year-old leg-spinner as the captain of Afghanistan's national teams across all formats immediately after the World Cup. Later, Asghar Afghan was reappointed as captain, allowing Rashid to focus on his bowling. The year 2020 began with a spectacular hat-trick for Rashid in the Big Bash League, playing for Adelaide Strikers. He became the fifth player in BBL history to take a hat-trick, achieving the feat against the Sydney Sixers in January. Rashid also played for Barbados Tridents in the CPL, where he took his 300th T20 wicket, becoming both the youngest and fastest player to reach the milestone - all at the age of 22. In November 2020, he was nominated for the ICC Men’s T20I Cricketer of the Decade award and won it in December. In 2021, Rashid was once again named the captain of Afghanistan’s T20I squad and led the team in the ICC Men’s T20 World Cup. During the tournament, he took his 400th T20 wicket against New Zealand. In the Indian Premier League 2022, Rashid was bought by Gujarat for a whopping INR 15 crore. He proved his worth by taking 19 wickets during the season and serving as the team’s vice-captain. Rashid helped Gujarat win their first-ever Indian T20 League title in the team's inaugural season, adding another prestigious achievement to his career. In April 2023, Rashid's fortunes in the Indian T20 League continued, although Gujarat lost in the final to Chennai following a tight Decision Review System (DRS) call. Rashid took a hat-trick against Kolkata, becoming the fourth player in league history to do so. Rashid Khan is one of the most sought-after players in T20 franchise leagues worldwide. He plays for Gujarat in the Indian Premier League, Adelaide Strikers in the BBL, Lahore Qalandars in the PSL, and various other teams across different leagues. His exceptional skill set and vast experience make him a prized asset for any team. With the age factor still in his favor, Rashid Khan has already achieved extraordinary milestones in his career. His skill, combined with his experience across different formats and leagues, positions him to be a dominant force in world cricket for years to come. As he continues to refine his abilities, Rashid Khan is poised to lead Afghanistan cricket to even greater heights.",
  "nationality": "Afghanistan",
  "career_span": {
    "Test": "2018-2025",
    "ODI": "2015-2025",
    "IPL": "2017-2025"
  }
}