{
  "id": "pprofile_3700",
  "type": "player_bio",
  "player": "Suresh Raina",
  "full_name": "Suresh Kumar Raina",
  "dob": "November 27, 1986",
  "role": "Batsman",
  "batting_style": "Left Handed",
  "bowling_style": "Off break",
  "teams": [
    "India",
    "Central Zone",
    "India A",
    "India Blue",
    "Indian Board Presidents XI",
    "India Green",
    "Indian Inv XI",
    "India Seniors",
    "Rest of India",
    "Chennai Super Kings",
    "India Under-19",
    "Uttar Pradesh",
    "Gujarat Lions",
    "India C",
    "Deccan Gladiators",
    "Bharat Legends",
    "Kandy Falcons",
    "India Maharajas",
    "Indore Knights",
    "Bulawayo Brave Jaguars",
    "California Knights",
    "Toyam Hyderabad",
    "Toyam Hyderabad",
    "Chhattisgarh Warriors",
    "VVIP Uttar Pradesh",
    "Delhi Devils",
    "Indian Royals",
    "India Champions",
    "New York Lions CC",
    "Southern Spartans",
    "India Masters",
    "Asian Kings"
  ],
  "bio": "Well known for his exploits in T20 cricket, both for India and his Indian T20 League franchise, Chennai, Suresh Raina made his international debut against Sri Lanka in the 1 st ODI on 30 July 2005. He is a multiple package - powerful hitter of the ball, bowls occasional yet useful offspin, excellent fielder and a quick runner between the wickets. Despite his abilities, Raina largely was dormant on the international scene and it was the inception of the Indian T20 League and his performances there that made him a name to reckon with. Purchased for 2.6 crores in the inaugural auctions, Raina was the highest scorer for his team and eighth highest in the first edition, with 421 runs. This showing propelled him back into the national side. He cashed in on this opportunity to solidify his credentials as a reliable finisher for India, with a mix of quick-fire knocks and an ability to get the bigger ones too, as the situations demanded. In those stages, India already had a well-built top and middle order and Raina’s role, coming in the lower middle-order, was to provide final impetus to the innings. In the 2011 World Cup, Raina made small yet handy knocks against Australia and Pakistan in the Quarter-Final and Semi-Final respectively. He is very strong on the leg side and the heave over mid-wicket is one of his most favorite and successful shots. He is also extremely proficient in giving himself him room on the off-side and going for the lofted inside out drive, either chipping down the track or as a stand-and-deliver. Despite making 120 in his Test debut, against Sri Lanka, Raina was not much of a red-ball cricketer, going on to feature in just 18 matches. He is the first Indian player to score a century in all three formats of the game. He had a decent outing in the 2010 ICC World T20, including scoring a hundred against South Africa. He is known for his weakness against the short ball and has been widely criticized for the same. In the 2015 World Cup, his notable contributions include 74 against Pakistan, 110* against Zimbabwe and 65 against Bangladesh in the Quarter-Final. He however failed to get going in the Semi-Final against Australia, collapsing along with the top-order. He didn’t do well in a few series after the tournament and was subsequently dropped from the side. Even though he was able to make a comeback thereafter, fitness concerns and several young contenders pushed him out of the selectors’ radars. Fondly called as ‘Chinna Thala’ by the Chennai fans, he is second in the all-time highest run-getters in the league with 5368 runs from 193 matches. Although he has a hundred in the League, his most incredible knock is the 87 (25) that he got against Punjab in 2015. When Chennai was banned for two seasons after 2015, Raina plied his trade for Gujarat and captained them. After Chennai returned in 2018, he was one among the three retained by the franchise. He is very close to MS Dhoni and the skipper always backed his abilities, be it in the national side or when playing for Chennai. Suresh announced his retirement from all formats of international cricket on 15 August 2020 - minutes after the retirement of MS Dhoni. In the 2020 season of the Indian T20 League, Raina pulled out at the last moment citing family reasons and was retained by the franchise for the following edition in 2021.",
  "nationality": "India",
  "career_span": {
    "Test": "2010-2015",
    "ODI": "2005-2018",
    "IPL": "2008-2021"
  }
}