{
  "id": "pprofile_66243",
  "type": "player_bio",
  "player": "Romario Shepherd",
  "full_name": "Romario Shepherd",
  "dob": "November 26, 1994",
  "role": "All-Rounder",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm fast medium",
  "teams": [
    "West Indies",
    "West Indies A",
    "Royal Challengers Bengaluru",
    "Mumbai Indians",
    "Guyana Harpy Eagles",
    "Chattogram Challengers",
    "West Indies Cricket Presidents XI",
    "Sunrisers Hyderabad",
    "Guyana Amazon Warriors",
    "Karachi Kings",
    "West Indians",
    "Toronto Nationals",
    "Northern Warriors",
    "Delhi Bulls",
    "Colombo Strikers",
    "Lucknow Super Giants",
    "Profilbau Victoria United SC",
    "New York Strikers",
    "Joburg Super Kings",
    "MI Emirates",
    "MI New York",
    "San Francisco Unicorns"
  ],
  "bio": "Romario Shepherd is a tall, well-built giant of a man who can use his height to great effect to trouble the batters and strike the cricket ball a long way lower down the order. Shepherd rose through the ranks in Guyana, where he played at the U-17 level. However, looking at his potential, he was included in the senior team and made his List A debut at the start of 2016 against Leeward Islands, where he picked up three wickets to be awarded the Player of the Match. After that, he made rapid strides and made his first-class and T20 debuts in the following year. Shepherd continued to improve his game at the domestic level and garnered the attention of the Windies selectors after his consistent performance for Guyana and West Indies A. His performances in the Caribbean T20 League were also instrumental in bringing his death bowling skills and power-hitting ability to the forefront. His three-dimensional qualities helped him break into the national side, and in 2019, he made his ODI debut for West Indies against Afghanistan, where he picked up a couple of wickets. The start of 2020 saw him make his T20I debut against Ireland. Shepherd was the second-highest wicket-taker in the 2021 edition of the Caribbean T20 League with 18 wickets in 9 games and also played some handy cameos with the bat. He continued to be a part of the national side in limited overs but couldn't perform consistently but made an impact in the series against Pakistan with his all-round skills after the 2021 ICC Men's T20 World Cup, which he missed out on. Hyderabad picked him up for the 2022 season at a hefty INR 7.75 crore, but he played just three games before being released. In 2023, Lucknow signed him at his base price, but once again, he got limited chances, featuring in only one match before being released at the end of the season. Despite his IPL struggles, Shepherd found success in the 2023 Caribbean Premier League, where he played a crucial role in Guyana's title-winning campaign with his all-round contributions. Shepherd's IPL journey took another turn in 2024, as he joined Mumbai for the season. He made headlines with a stunning display of power-hitting, smashing Anrich Nortje for 32 runs in a single over during a game against Delhi. However, his T20 World Cup campaign was relatively quiet. Following the IPL season, Mumbai released him ahead of the 2025 auction, but as expected, there was still demand for his all-round skills. Bengaluru secured his services for INR 1.5 crore, showing faith in his explosive batting and useful pace bowling.",
  "nationality": "West Indies",
  "career_span": {
    "Test": "",
    "ODI": "2019-2025",
    "IPL": "2022-2025"
  }
}