{
  "id": "pprofile_5448",
  "type": "player_bio",
  "player": "Jaydev Unadkat",
  "full_name": "Jaydev Dipakbhai Unadkat",
  "dob": "October 18, 1991",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Left-arm medium",
  "teams": [
    "India",
    "India A",
    "India B",
    "India Blue",
    "Indian Board Presidents XI",
    "India Red",
    "Rest of India",
    "West Zone",
    "Royal Challengers Bengaluru",
    "Kolkata Knight Riders",
    "Delhi Capitals",
    "Rajasthan Royals",
    "Mumbai Indians",
    "India Under-19",
    "Sussex",
    "Saurashtra",
    "Sunrisers Hyderabad",
    "Rising Pune Supergiant",
    "Anmol Kings Halar",
    "JMD Kutch Riders",
    "Dita Gohilwad Titans",
    "Lucknow Super Giants"
  ],
  "bio": "Jaydev Unadkat, the Saurashtra lad, who was first spotted by coach Ram Odedra at the Duleep Singh School of Cricket in Porbandar, spearheaded India’s bowling attack in the 2010 Under-19 WC before being usurped by Kolkata in the Indian T20 League that year. It was followed by a dream first-class debut against West Indies A, where he accounted for more than half of the West Indies wickets. With figures of 4-41 in an innings of an Irani Trophy game against Mumbai, he put himself firmly in contention for an inclusion in the Test squad. A month later, Unadkat was included in India's Test side for the tour of South Africa, where he made his international debut. With an enviable height of 6 feet 3 inches, the tall, left-arm medium pacer can land the ball on seam and swing with variety as well. His ability as an aggressive fielder is an added asset. In 2013, he was one of the top players bought by the Bangalore franchise for the sixth edition of the Indian T20 League. In 2014, he was bought by the Delhi franchise for 2.8 crores. Unadkat had been a part of the Kolkata franchise and later represented the now defunct Rising Pune Supergiants for whom he picked up a hat-trick as well. He finished the 2017 season with 24 wickets and was one of the hotcakes during the 2018 auction. Every team wanted to buy him and Rajasthan won that bidding war by spending a whopping INR 11.5 crore for Unadkat, making him the most expensive Indian cricketer in the auction. His performance though hasn't been upto the mark, he continues to be a part of the Rajasthan franchise. Despite an early start to his international career, Unadkat had to wait over a decade for a second opportunity in Test cricket. His persistence paid off in December 2022 when he made a long-awaited return to India’s Test XI, replacing Kuldeep Yadav in the second Test against Bangladesh at Mirpur. His selection was a testament to his remarkable domestic performances and unwavering determination. Unadkat had previously made his T20I debut in 2016 against Zimbabwe at Harare Sports Club. Though he has had sporadic appearances in international cricket, he remains a dependable performer in the domestic circuit, consistently pushing for a spot in the national team. Jaydev Unadkat's career is a story of resilience, hard work, and never giving up. From being an aspiring youngster in the Under-19 setup to leading his state team to a Ranji Trophy title, his contributions to Indian cricket are immense. His ability to swing the ball, coupled with his strategic bowling in T20s, makes him a valuable asset to any team he represents. His IPL journey, filled with ups and downs, reflects his determination to constantly evolve and adapt. While he may not have cemented a permanent place in the Indian national team, his performances in domestic cricket and the IPL ensure that he remains a prominent name in Indian cricket and he will be a part of the IPL once again in the 2025 season, playing for Hyderabad.",
  "nationality": "India",
  "career_span": {
    "Test": "2010-2023",
    "ODI": "2013-2023",
    "IPL": "2010-2025"
  }
}