{
  "id": "pprofile_69238",
  "type": "player_bio",
  "player": "Yashasvi Jaiswal",
  "full_name": "Yashasvi Bhupendra Kumar Jaiswal",
  "dob": "December 28, 2001",
  "role": "Batsman",
  "batting_style": "Left Handed",
  "bowling_style": "Leg break",
  "teams": [
    "India",
    "India A",
    "India B",
    "Rest of India",
    "West Zone",
    "Rajasthan Royals",
    "India Under-19",
    "Mumbai",
    "India Under-23",
    "India Blue Under-19",
    "India Red Under-19",
    "North Mumbai Panthers",
    "India A Under-19",
    "Indian Oil",
    "Team B"
  ],
  "bio": "Yashasvi Jaiswal was born on 28 Dec 2001. He rose to prominence in Indian cricket as a result of his outstanding performance at the Under-19 World Cup in 2020, where he won the Player of the Tournament award. He amassed more than 400 runs during the competition and the fact that he had to work really hard to get there made his accomplishment all the more spectacular. When Yashasvi was a young cricket player and was not chosen for the Indian U-19 team, he had to endure massive disappointment. Jaiswal was born in Uttar Pradesh, but his desire to play cricket and represent India led him to Mumbai at the age of 12 where he had to wander from field to field looking for opportunities to play. Jwala Singh, a local coach, took him under his wing two years later, after watching him at Azad Maidan after which his career blossomed. He worked odd jobs in the street to sustain himself while living in the tents in the 'maidan' and played cricket during the remaining hours to hone his skills. The excellent top-order batter turned 17 during the 2018–19 Ranji Trophy season where he made his first-class debut against Chhattisgarh. Later in September, he earned his List–A debut during India's U–23 tour of Bangladesh. Jaiswal was chosen for the U-19 World Cup that was held in 2020 due to his improvement at the domestic and age-group levels. Even after being chosen for the Indian U-19 team, he did not immediately succeed and had to work harder at everything. He was able to secure a spot in the U-19 World Cup thanks to a century in the youth Asia Cup before the World Cup. Jaiswal was chosen by the Rajasthan franchise for the Indian Premier League, just like many other U-19 players before him, based on his exceptional talent. Jaiswal was purchased for INR 2.4 crore, which is a significant sum given the difficulties he had to face in his quest to become a cricket player. A million hearts were won when the young player made his IPL debut against MS Dhoni's Chennai franchise and gave the renowned wicketkeeper a \"namaste\" as he came to the crease. Jaiswal struggled and faltered with the bat in his maiden IPL season, hence he didn't have much success. After an underwhelming performance in his first three games, he was benched. The young man returned to domestic cricket and improved himself in preparation for the most competitive T20 competition. He announced himself to the world during the 2023 Indian Premier League as he finished 5th on the runs scoring charts having accumulated 625 runs at an average of 48.07 and striking it at 163.61. This got him his maiden call-up to the Indian squad for the Test and T20I series against West Indies. Jaiswal's performance in the five-match Test series against England in 2024, was what really made him known on the international scene. Over the course of the series, the youthful opener hit two double-hundreds and scored 712 runs in the nine innings he batted. Later in the year, when New Zealand visited, Jaiswal couldn’t make much of an impact in what was a forgettable series for India. The tour of Australia followed, and in his first Test on Australian soil, Jaiswal smashed a stellar century as India took the lead. However, he struggled with consistency in the following Tests as Australia bounced back to clinch the series. Given Jaiswal’s immense talent, Rajasthan had no hesitation in retaining him for the 2025 IPL season. It was a surprise to many that Jaiswal hadn’t featured for India in ODIs until then, but the wait came to an end when he was picked for the ODI series against England before the Champions Trophy, where he made his debut.",
  "nationality": "India",
  "career_span": {
    "Test": "2023-2025",
    "ODI": "2025-2025",
    "IPL": "2020-2025"
  }
}