{
  "id": "pprofile_66939",
  "type": "player_bio",
  "player": "Riyan Parag",
  "full_name": "Riyan Parag",
  "dob": "November 10, 2001",
  "role": "All-Rounder",
  "batting_style": "Right Handed",
  "bowling_style": "Off break",
  "teams": [
    "India",
    "East Zone",
    "India A",
    "Rajasthan Royals",
    "India Under-19",
    "Assam",
    "Brahmaputra Boys",
    "Assak CC",
    "Bud Cricket Club",
    "Assam CC",
    "RBI",
    "Team A"
  ],
  "bio": "Born in Guwahati, Riyan Parag comes from a sporting lineage, with his mother being a former international swimmer and his father a former first-class cricketer. It was no surprise, then, that Riyan gravitated toward cricket, carving out a promising career for himself. Rising through the ranks in junior cricket, Parag transitioned to senior cricket in 2017, debuting for Assam in all three formats. His talent and potential quickly became evident, earning him a spot in India's squad for the victorious 2018 Under-19 World Cup campaign. Later that year, Parag experienced his first Indian Premier League auction, being picked up by Rajasthan. While he remained under the radar during his first few IPL as well as domestic seasons, his breakthrough came in the 2022-23 season. Parag emerged as Assam's leading run-scorer in the Vijay Hazare Trophy and followed it up with a standout performance in the 2023 Deodhar Trophy, topping the scoring charts for the runners-up East Zone. His white-ball exploits continued into the 2023-24 season, this time in the T20 format, as he amassed 510 runs to propel Assam into the semifinals. Riding on this form, Parag delivered a stellar 2024 Indian Premier League campaign, finishing as Rajasthan Royals' highest run-scorer and playing a pivotal role in their journey to the playoffs. These consistent performances earned him debuts in both ODI and T20I formats for India in 2024. Given his heroics in the 2024 IPL season, it was no surprise that Parag was retained for the 2025 edition.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "2024-2024",
    "IPL": "2019-2025"
  }
}