{
  "id": "pprofile_3722",
  "type": "player_bio",
  "player": "Shikhar Dhawan",
  "full_name": "Shikhar Dhawan",
  "dob": "December 5, 1985",
  "role": "Batsman",
  "batting_style": "Left Handed",
  "bowling_style": "Off break",
  "teams": [
    "India",
    "Asia XI",
    "India A",
    "India B",
    "India Blue",
    "Indian Board Presidents XI",
    "India Green",
    "India Red",
    "India Seniors",
    "North Zone",
    "Rest of India",
    "Punjab Kings",
    "Delhi Capitals",
    "Mumbai Indians",
    "Deccan Chargers",
    "India Under-19",
    "India Under-19",
    "Delhi",
    "Mumbai A",
    "Sunrisers Hyderabad",
    "Gujarat Greats",
    "DY Patil Group B",
    "Indian Royals",
    "India Champions",
    "Karnali Yaks",
    "Northern Challengers",
    "Delhi Royals",
    "Indian Warriors"
  ],
  "bio": "Shikhar Dhawan is considered one of the most explosive and exciting players in the world and like most left-handed batters he possesses a certain kind of flair in his strokeplay. The opening batter is known for his aggressive and powerful style of batting and is quite a fan-favorite, especially for his customary kabaddi thigh slap celebration after taking a catch. Born on 5th December 1985 in New Delhi the capital of India, Dhawan started playing for Sonnet Club at the age of 12 under the guidance of renowned coach Tarak Sinha and started as a wicket-keeper. He began his first stint in youth cricket for Delhi U16 followed by his selection into the North Zone U16 side and he amassed runs freely. He was picked for the India U17 side for the 2000/01 ACC Under-17 Asia Cup as he turned 15 and it became clear that he was good enough to play for the Delhi U19 side. He performed outstandingly well over the next few years at the under-19 levels and even went to captain his side. His transition into India U19 was seamless as he won the Player of the Tournament award in the 2004 U19 Cricket World Cup for scoring 505 runs with three hundreds and a half-century. Dhawan made his first-class debut towards the end of the World Cup year in the Ranji Trophy and ended that season as Delhi’s leading run-getter accumulating 461 runs in 6 games. The start of 2005 saw him make his List A debut against Jammu and Kashmir in the Ranji One-Day Trophy where he scored just 10 runs but followed it up with two centuries in consecutive games. He continued to dominate the domestic circuit over the next few years and made his T20 debut in the Inter-State Twenty-20 Tournament in the first half of 2007. His Indian Premier League journey started in the Delhi franchise for the 2008 edition but was traded to the Mumbai franchise the following year and he played there for two seasons. He made his ODI debut towards the end of 2010 against Australia as India picked a weaker side for the series but he could not stake a claim for a spot due to a large amount of competition for the openers spot. He shifted to the Hyderabad franchise for the 2011 Indian Premier League. He was included in the tour of the West Indies midway through 2011 and made his T20I debut in a one-off game. He had a disappointing tour of the Caribbean and returned to honing his skills at the domestic level. His efforts bore fruit as he had a remarkable 2012-13 domestic season and this paved way for his return to the international squad for a four-match series against Australia as a third-choice opener. He made his Test debut in the third game of the series and scored the fastest century by a debutant in his first outing, leading his side to victory with a Player of the Match performance. However, he suffered a fracture on his left hand and was ruled out of the fourth Test. Dhawan returned from injury to captain the Hyderabad franchise for the 2013 Indian Premier League but was later replaced by Darren Sammy. His good run in the tournament got him selected in the ODI squad for the 2013 ICC Champions Trophy and he scored his maiden ODI century in the first game of the competition against South Africa. He followed it with another 100 in the next game and went on to score 363 runs in 5 matches at an average of 90.75 striking at over a run a ball, as India lifted the trophy. He received the Golden Bat award for scoring the most runs and was also adjudged the Player of the Tournament. He continued to perform throughout the year as he cemented his spot at the top of the order in the 50-over format and was named in the 2013 World ODI XI by ICC. However, he had a poor run of form in 2014 including a disappointing ICC World Twenty20 where he was dropped from the side after a string of low scores. His form duly returned during the 2015 ICC Cricket World Cup where he scored two centuries and ended the competition as the fifth-highest run-scorer getting 412 runs at an average of 51.50. This prompted his return to the Test side midway through 2015 and he carried his ODI form into red-ball cricket as he started accumulating centuries. In the 2017 ICC Champions Trophy midway through the year, Dhawan continued his love affair with the competition as he received the Golden Bat once again for being the highest scorer with 338 runs. He had cemented his spot in India’s limited overs side and continued to be a big-match player scoring runs heavily. Dhawan was retained by the Hyderabad franchise for the 2017 Indian Premier League following his international exploits. The franchise bought him back for the 2018 Indian Premier League for INR 5.2 crore using their right-to-match card but traded him to the Delhi franchise the following year where he proved to be an instant hit racking up 521 runs. He was a part of India’s squad for the 2019 ICC Cricket World Cup and scored a century against Australia despite fracturing his thumb which ruled him out of the rest of the tournament. He continued to play for the Delhi franchise for two more seasons and became the first batter to score consecutive centuries in the 2020 edition. Midway through 2021, he captained India for the first time for the ODI and T20I series against Sri Lanka but was dropped out of the squad for the 2021 ICC Men’s T20 World Cup. He was bought by the Punjab franchise for the 2022 Indian Premier League for INR 8.25 crore. During this season, he played his 200th game in the League and became the second batter after Virat Kohli to complete 6000 runs in the Indian Premier League. He was retained for the 2023 edition as the captain of the side after Mayank Agarwal was released. He enjoyed a decent season scoring 373 runs in 11 games with his highest being an unbeaten 99 against Hyderabad which was enough to retain his place as skipper for the next edition. With age catching up Dhawan’s international career seems to be dwindling as younger players look to leave their mark. He has been a true servant of Indian cricket and has always had a smile on his face while playing the sport.",
  "nationality": "India",
  "career_span": {
    "Test": "2013-2018",
    "ODI": "2010-2022",
    "IPL": "2008-2024"
  }
}