{
  "id": "pprofile_94786",
  "type": "player_bio",
  "player": "Musheer Khan",
  "full_name": "Musheer Naushad Khan",
  "dob": "February 27, 2005",
  "role": "All-Rounder",
  "batting_style": "Right Handed",
  "bowling_style": "Slow left-arm orthodox",
  "teams": [
    "India B",
    "West Zone",
    "Punjab Kings",
    "India Under-19",
    "Mumbai",
    "ARCS Andheri",
    "India A Under-19",
    "India B Under-19",
    "Team B"
  ],
  "bio": "Musheer Khan is one of the brightest young talents in Indian cricket who is making waves with his all-round abilities. He was born in Mumbai and he grew up surrounded by cricket. His father, Naushad Khan, was a passionate coach who shaped both Musheer and his elder brother, Sarfaraz Khan, into top-level cricketers. From an early age, Musheer spent countless hours at Mumbai’s famous Azad Maidan, where he learned the fundamentals of the game and honed his skills. Musheer first gained attention when he made his first-class debut for Mumbai in December 2022 during the Ranji Trophy. But it was in 2024 that he truly announced himself on the big stage. Representing India in the U-19 Cricket World Cup, Musheer emerged as one of the tournament’s best all-rounders. He scored 360 runs in seven matches and picked up seven wickets, playing a crucial role in India's journey to the final. His standout performances included centuries against New Zealand and Ireland, making him the second-highest run-scorer in the tournament, just behind captain Uday Saharan. Despite India finishing as runners-up, Musheer’s performances earned him a place in the ICC Team of the Tournament. Back in domestic cricket, Musheer continued to impress. In February 2024, he played a match-winning knock for Mumbai in the Ranji Trophy quarterfinals against Baroda. His double century in a high-pressure situation proved his temperament and skill. Just a few weeks after turning 19, he created history in the Ranji Trophy final against Vidarbha by scoring a century, becoming the youngest Mumbai batter to achieve this feat, breaking Sachin Tendulkar’s long-standing record. His red-ball exploits didn’t stop there. In September 2024, Musheer made his Duleep Trophy debut for India B against India A at Bengaluru’s Chinnaswamy Stadium. In his very first match, he scored a magnificent century, reinforcing his reputation as a player to watch. Musheer’s journey has not been without challenges. In early 2025, he suffered an unfortunate setback when he was involved in a road accident while traveling with his father. The injuries sidelined him for a few months, forcing him to miss the prestigious Irani Cup and the initial rounds of the Ranji Trophy season. However, with his resilience and dedication, Musheer is expected to make a strong comeback. Adding to his growing list of achievements, Musheer was picked by Punjab in the IPL 2025 auction at a base price of ₹30 lakh. While his elder brother, Sarfaraz Khan, went unsold in the same auction, Musheer’s selection marked the beginning of his IPL journey, giving him a chance to showcase his talent on the biggest T20 stage.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "",
    "IPL": "2025-2025"
  }
}