{
  "id": "pprofile_65051",
  "type": "player_bio",
  "player": "Jhye Richardson",
  "full_name": "Jhye Avon Richardson",
  "dob": "September 20, 1996",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm fast",
  "teams": [
    "Australia",
    "Australia A",
    "Punjab Kings",
    "Delhi Capitals",
    "Mumbai Indians",
    "Western Australia",
    "Australia Under-19",
    "Australian XI",
    "Perth Scorchers",
    "Australians",
    "Welsh Fire",
    "Western Australia XI",
    "Perth Scorchers Academy"
  ],
  "bio": "There are some people who crumble when they are put under pressure and then there are those who rise higher than anyone ever imagined. Such a person is Jhye Richardson. Since he was young, he was told that he would not succeed as a pacer due to his physical attributes. With a stature of 178 cms and 70 odd kilos, even his coaches told that he would not get to the top. But come the 2018-2019 season for the Australian national team, there was a new kid on the block challenging established bowlers like Mitchell Starc, Pat Cummins, Josh Hazlewood and he was giving them a good run for their money. A small man with whippy fast-arm action, Richardson is a right-arm fast bowler who can swing the ball in both directions. Richardson made his List A debut at the tender age of 19 years for Western Australia. In December 2015, he was named in Australia's squad for the U-19 ICC World Cup. He made his mark in the Big Bash League in 2016 for Perth Scorchers. In the final of the tournament, he rattled the middle order of Sydney Sixers taking 3 wickets and giving away just 30 runs. He was adjudged 'Man of the Match' for his performance and he hasn't looked back since then. He made his first-class debut for Western Australia in March 2016. Since then his progression has been rapid. Richardson made his international bow in a T20I against Sri Lanka in February 2017, aged just 20 years. He made his ODI debut against England almost a year after. He was also included in the Test squad of Australia's tour of South Africa in 2018. However, he did not make an appearance in any of the matches and missed out on his Test debut. In April 2018, he was awarded a national contract by Cricket Australia for the 2018–19 season. In January 2019, the selectors showed faith in Richardson by selecting him for India's tour of Australia. He was not in the best of forms preceding that series. However, he came with his 'A' game to face India. In the first match at the Sydney Cricket Ground, he recorded his career-best figures of 4/26. He dismissed Indian skipper Virat Kohli thrice in three ODIs in the series, thereby displaying his true potential. He was re-selected for Sri Lanka's tour of Australia after Josh Hazlewood got injured. He made his Test debut in January 2019, taking three wickets in the first innings. His control on pace, pitching and swing grew as he gained more and more experience. He was selected in Australia's squad for the ICC World Cup 2019. The ICC named him as one of the five exciting talents to make their World Cup debuts. Unfortunately for Jhye, he was ruled out of the tournament due to a dislocated shoulder. He was replaced by Kane Richardson in the squad. Jhye will be looking to make a good comeback after recovering from the injury and become a regular starter for Australia.",
  "nationality": "Australia",
  "career_span": {
    "Test": "2019-2021",
    "ODI": "2018-2022",
    "IPL": "2021-2024"
  }
}