{
  "id": "pprofile_65038",
  "type": "player_bio",
  "player": "Charith Asalanka",
  "full_name": "Kariyawasam Indipalage Charith Asalanka",
  "dob": "June 29, 1997",
  "role": "Batsman",
  "batting_style": "Left Handed",
  "bowling_style": "Off break",
  "teams": [
    "Sri Lanka",
    "Galle Cricket Club",
    "Sri Lanka Emerging",
    "Sri Lanka A",
    "Sinhalese Sports Club",
    "Mumbai Indians",
    "Sri Lanka Under-19",
    "Sri Lanka Cricket Board President XI",
    "Sri Lanka Under-23",
    "Mohammedan Sporting Club",
    "Colombo",
    "Kandy",
    "Kandy District",
    "Sri Lanka Development Emerging Team",
    "Colombo Strikers",
    "Jaffna Kings",
    "Kandy Falcons",
    "SLC Blues",
    "SLC Reds",
    "SLC Greys",
    "Chennai Brave Jaguars",
    "Morrisville Samp Army",
    "Abu Dhabi Knight Riders",
    "Joburg Bangla Tigers",
    "Jaffna Titans"
  ],
  "bio": "Charith Asalanka, born on June 29, 1997, in Elpitiya, Sri Lanka, is a prominent figure in Sri Lankan cricket, known for his elegant left-handed batting and intelligent game sense. From his early days, Asalanka displayed signs of cricketing maturity beyond his years. He rose to prominence while playing for Richmond College in Galle, where he captained the school team and became one of the most celebrated school cricketers in the country. His outstanding performances at the school level earned him the Schoolboy Cricketer of the Year award in consecutive years, 2015 and 2016, an accolade shared by only a few of Sri Lanka’s greats. Asalanka represented the national Under-19 side, captaining them on several occasions, including during the 2016 ICC Under-19 World Cup, where his leadership and consistency with the bat were widely praised. He transitioned to first-class cricket with ease and built a strong reputation in domestic competitions, representing teams like Galle and the Sinhalese Sports Club. Asalanka’s ability to adapt to various match situations, whether anchoring an innings or shifting gears in the middle overs, made him a standout performer. His domestic success paved the way for his international debut in 2021 when he was called up for Sri Lanka’s limited-overs tour of England. He immediately impressed with his temperament and technique, earning praise for his composure in challenging overseas conditions. His T20I debut followed shortly after in the same year, and later, he made his entry into Test cricket against the West Indies. What sets Asalanka apart is his ability to deliver in high-pressure moments. Whether in bilateral series or multinational tournaments, he has often stepped up when Sri Lanka needed stability in the middle order. His calm demeanour and capacity to read the game have led to several match-winning and match-saving contributions, especially in white-ball cricket. Over time, he has also matured into a leader within the squad. In 2024, amid structural changes in the national team setup, Asalanka was entrusted with the captaincy of Sri Lanka’s ODI and T20I teams, a move that underscored the trust placed in his leadership and vision for the future. Beyond the field, Asalanka is known for his quiet confidence and work ethic. His evolution from a school-level prodigy to one of the mainstays of Sri Lanka’s batting unit is a testament to his perseverance and skill. As he continues to shape the team’s fortunes across formats, Asalanka remains a vital presence in Sri Lanka’s ongoing journey to reclaim their place among the world’s top cricketing nations.",
  "nationality": "Sri Lanka",
  "career_span": {
    "Test": "2021-2022",
    "ODI": "2021-2025",
    "IPL": ""
  }
}