{
  "id": "pprofile_28891",
  "type": "player_bio",
  "player": "Faf du Plessis",
  "full_name": "Francois du Plessis",
  "dob": "July 13, 1984",
  "role": "Batsman",
  "batting_style": "Right Handed",
  "bowling_style": "Leg break",
  "teams": [
    "South Africa",
    "Kent",
    "Lancashire",
    "Northerns",
    "South Africa A",
    "Titans",
    "Royal Challengers Bengaluru",
    "Chennai Super Kings",
    "Delhi Capitals",
    "South Africa Under-19",
    "Melbourne Renegades",
    "Perth Scorchers",
    "Saint Lucia Kings",
    "St Kitts and Nevis Patriots",
    "Comilla Victorians",
    "Rising Pune Supergiant",
    "Quetta Gladiators",
    "Peshawar Zalmi",
    "Stellenbosch Kings",
    "World XI",
    "Bangla Tigers",
    "Surrey Jaguars",
    "Paarl Rocks",
    "Belfast Titans",
    "Northern Superchargers",
    "Southern Brave",
    "KG’s Kingfishers",
    "Colombo Strikers",
    "Jaffna Kings",
    "Morrisville Samp Army",
    "Joburg Super Kings",
    "Texas Super Kings",
    "South Africa Champions"
  ],
  "bio": "Francois du Plessis has elegance, charm and a certain regalia in terms of the way he bats and carries himself when on the field. He possesses the rare combination of being able to accelerate when needed and play classic, biding cricket, basis the situations at play. Extremely adept at his footwork, du Plessis is also rock solid in his defences. He made his T20I debut against England in the 1st T20I at Chester-le-Street in September 2012. Given his noticeable leadership prowess, du Plessis was made captain of the T20I side in early 2013 and was an important cog of the lineup in other versions. In 2007, he signed a Kolpak deal with Lancashire and represented them for 2 seasons. Changes in immigration criteria and the subsequent appeal filed against it being dismissed meant that they could no longer retain him for the 2010 season. He was more interested in playing cricket abroad in those years as he couldn’t quickly climb up the ladder back home. He eventually returned to South Africa and started playing domestic cricket. With the expiry of his deal, he was back in the South African squad for the ODI series against India in early 2011. With a 60 on debut, he booked a spot in the team’s 2011 World Cup squad. He had a memorable Test debut at Adelaide, against Australia. Scoring 78 in the first innings, du Plessis grinded it out like no other in the second, remaining unbeaten on 110 off 376 balls and helping the team salvage what seemed an imminent loss. Eventually, South Africa would win the next Test at Perth and clinch the series 1-0. Du Plessis took a while to register his maiden century in ODIs, coming against Australia in the 2014 Zimbabwe Tri Series. He subsequently brought up two more hundreds in the same series and an important 96 in the final ensured that South Africa won the series and himself the ‘Man of the Series’. He is the second South African to score a T20I century after Richard Levi and holds the record for the highest individual score by a South African in T20Is. He made 119 (56) in the 2nd T20I against West Indies in 2015. Du Plessis had a very good 2015 World Cup campaign, amassing 359 runs in the tournament. In later years, even though he continued his good run in the ODIs, his scoring rate started to dip. He led South Africa in the 2019 World Cup but had a horrible outing, with the Proteas managing only 3 wins in their 9 games. Faf was the only South African in the top-20 run-scorers list in the tournament, notching up a total of 387 runs in 8 innings, including a match-winning 100 against Australia. In February 2020, du Plessis resigned as the captain from all formats of the game. In the Indian Premier League, du Plessis has been a trusted and consistent workhorse for Chennai. The standout among his various critical knocks for the franchise was his 67*(42) in Qualifier 1 against Hyderabad that propelled Chennai to the finals and eventually their third title in 2018. Faf du Plessis was not offered a central contract in 2021 by the South African board despite his availability in white-ball cricket. Faf was set free to pursue opportunities in T20 leagues around the world and remained eligible to play for South Africa at ICC events. Despite numerous speculations about his return to the national side, du Plessis has not been summoned by the Proteas selectors, and it appears unlikely that he will be part of the South African squad for the 2024 T20 World Cup. Since retiring from Test cricket in 2021, du Plessis has showcased his skills in various franchise leagues worldwide and remains a crucial asset for any team he represents. Following the disappointment of the 2023 Indian Premier League season with Bengaluru, where his team narrowly missed out on the playoffs despite having fate in their hands, du Plessis was once again been entrusted with the leadership role for the 2024 season and this time, Bengaluru managed to qualify for the playoffs but couldn't get through to the Final, losing in Qualifier 2 against Hyderabad. Most recently, Faf was signed for 2 crores by Delhi Capitals in the Indian Premier League 2025 auction. His experience and leadership have been crucial in guiding young talents in T20 leagues globally.",
  "nationality": "South Africa",
  "career_span": {
    "Test": "2012-2021",
    "ODI": "2011-2019",
    "IPL": "2012-2025"
  }
}