{
  "id": "pprofile_63341",
  "type": "player_bio",
  "player": "Mohit Sharma",
  "full_name": "Mohit Mahipal Sharma",
  "dob": "September 18, 1988",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm medium",
  "teams": [
    "India",
    "India A",
    "India Blue",
    "North Zone",
    "Punjab Kings",
    "Chennai Super Kings",
    "Delhi Capitals",
    "Haryana",
    "Gujarat Titans"
  ],
  "bio": "Mohit Sharma, 18th September 1988, has carved a niche for himself with his consistent swing bowling. After a stellar domestic season in 2012-13, he rose to prominence. He made his first-class debut for Haryana against Gujarat and helped this side to win the match by picking up 2 wickets. In February 2012 he made his List A matches against Punjab and also had an exceptional performance by taking 2 wickets. He was under the guidance of Ian Pont, he picked up 37 wickets from 7 games at an average of 23 in 2012-13. In 2013 after he was crowned in the domestic season, he was bagged by Chennai in the Indian Premier League. He was given the chance to perform which he didn’t fail to capitalize and had 15 appearances to pick impeccable 20 wickets to finish the season as Chennai’s second-best bowler. He shocks worldwide cricket fans with his consistency in length and line-up for jagging the delivery in and out. In the same year of August, he also made his International ODI debut on the 4th ODI against Zimbabwe and had one of the best bowling figures in his career. He picked 2 wickets and only gave away 26 runs in 10 overs and became the second Indian to collect a Man of the Match on his ODI debut. But he got even more fuel in the tank to show the world as in the exact next season his performance event improved and topped the wicket-taking list for his team which eventually became his best career stats before the 2023 season of Indian Premier League. He served as the top preferred bowler for Chennai till 2015 as the team received a two-year ban due to illegal betting activities and joined Punjab in the 2016 season. In 2015 Mohit got selected for his nation in the ICC World Cup 2015 after Ishan Sharma was ruled out of the tournament due to a knee injury. He yet again helped his side to pick up 13 wickets in the campaign but sadly got eliminated by the Aussies. But after having numbers on his side he wasn’t preferred by the national selectors because of the competition. Nevertheless, his career didn’t have any boost as in Punjab as well he wasn’t performing at his peak but was able to find a couple of wickets in every match. However, it was not what the coaching staff of Punjab wanted, and started to lower his number of appearances in the match. In 2019 he once again returned to his former team for INR 5 Cr. but it was the same old story from Sharma’s perspective. After one season he moved to Delhi for INR 50 Lakhs but yet again the situation didn’t improve. After that season he was out of an Indian Premier League contract and also suffered a back injury. At the same time, he lost his father in those years and he was legitimately at the lowest point. But the story was not over for him. In 2023 he got a contract from the defending champion Gujarat for INR 50 Lakhs and got the best statistic in his entire career in the Indian Premier League showcasing his experience and skill sets on the bigger stage. He picked up 27 wickets in just 14 matches and was a single wicket away from Shami, who was the top wicket scorer of Indian Premier League 2023 while playing 17 matches. He also picked up 3 scalps in the final of the season but ended up on the losing end due to DLS against Chennai. His comeback in the league has put a sealed stamp on the face of the critics. But it might be the start of Mohit’s prime era as he might still have some surprises in store for the future. However, the IPL 2024 season brought an unexpected setback. During a match against Delhi, Sharma conceded 73 runs in his four-over spell, setting an unfortunate record for the worst bowling figures in IPL history. This surpassed the previous record held by Basil Thampi, who had conceded 70 runs. Despite this, Sharma remains a seasoned campaigner with valuable experience, and his resilience suggests that he will work towards a strong comeback as he will be a part of Delhi for the 2025 IPL season.",
  "nationality": "India",
  "career_span": {
    "ODI": "2013-2015",
    "IPL": "2013-2025"
  }
}