{
  "id": "pprofile_70376",
  "type": "player_bio",
  "player": "Akash Singh",
  "full_name": "Akash Maharaj Singh",
  "dob": "April 26, 2002",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Left-arm medium fast",
  "teams": [
    "India A",
    "Chennai Super Kings",
    "Rajasthan Royals",
    "India Under-19",
    "Rajasthan",
    "Baroda",
    "Sunrisers Hyderabad",
    "Arunachal Pradesh",
    "Nagaland",
    "India A Under-19",
    "India B Under-19",
    "Lucknow Super Giants",
    "Alembic Warriors"
  ],
  "bio": "Akash Singh, a promising left-arm medium-fast bowler from India, has been making waves in the domestic circuit with his impressive performances. Known for his ability to swing the ball both ways, Singh has been a vital cog in the bowling line-up for his teams. His journey began with the India Under-19 team, where he showcased his potential by taking crucial wickets in the ICC Under-19 Cricket World Cup 2020. Singh's best bowling figures in the tournament were 3-12 against Bangladesh Under-19, highlighting his knack for delivering under pressure. Despite not having made his debut in international cricket yet, Singh's domestic performances have been noteworthy. In the Ranji Trophy 2024/25 season, he has taken 24 wickets in 12 matches, with a bowling average of 39.95. His best performance came against Odisha, where he claimed 4-73, demonstrating his ability to dismantle batting line-ups. Singh's economy rate of 3.77 in first-class cricket further underscores his control and precision with the ball. Singh's IPL journey has seen him don the jerseys of various teams, including Chennai and Rajasthan. Although his IPL stats show room for improvement, with five wickets in eight matches, his potential is undeniable. His best IPL performance was a 2-40 against Rajasthan, showcasing his ability to perform on the big stage. In the domestic T20 circuit, Singh has been a consistent performer. In the Syed Mushtaq Ali Trophy 2024, he took three wickets for 19 runs against Tripura, proving his mettle in the shortest format. As Singh continues to hone his skills, the cricketing fraternity eagerly anticipates his potential debut in international cricket.",
  "nationality": "India",
  "career_span": {
    "IPL": "2021-2025"
  }
}