{
  "id": "pprofile_33031",
  "type": "player_bio",
  "player": "Jason Roy",
  "full_name": "Jason Jonathan Roy",
  "dob": "July 21, 1990",
  "role": "Batsman",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm medium fast",
  "teams": [
    "England",
    "England XI",
    "Surrey",
    "Kolkata Knight Riders",
    "Delhi Capitals",
    "Perth Scorchers",
    "Sydney Sixers",
    "Sydney Thunder",
    "Chattogram Challengers",
    "Sylhet Strikers",
    "England Lions",
    "Sunrisers Hyderabad",
    "Trinbago Knight Riders",
    "Dhaka Capitals",
    "Gujarat Lions",
    "Quetta Gladiators",
    "Lahore Qalandars",
    "Benoni Zalmi",
    "Bangla Tigers",
    "Nelson Mandela Bay Giants",
    "Delhi Bulls",
    "Deccan Gladiators",
    "Northern Superchargers",
    "Oval Invincibles",
    "Southern Brave",
    "Team Buttler",
    "Chennai Brave Jaguars",
    "Gujarat Titans",
    "Paarl Royals",
    "Abu Dhabi Knight Riders",
    "Sharjah Warriorz",
    "Los Angeles Knight Riders",
    "Colombo Jaguars"
  ],
  "bio": "A destructive opening batter, Jason Roy was one the key architects of England's renaissance after the 2015 ICC Cricket World Cup debacle when they were dumped out in the group stages. As stylish and destructive as they come, Jason Roy became the epitome of the modern-day opening batter. He lit up the 2019 ICC Cricket World Cup alongside his opening partner Jonny Bairstow as the Three Lions won their maiden World Cup on home soil. Born on 21st July 2000 in South Africa, Jason Roy and his family moved to England when he was 10 years old. He started to play for Surrey representing the U-11 team and he made his T20 and List A debut for Surrey just before he turned 18 years old. Roy started to make his mark on the Surrey team in 2010 as he played several good innings in the Friends' Provident T20. He made his first-class debut in the County Championship Division Two against Leicestershire in 2010 and scored a half-century on his first outing. It became evident though that Jason was an aggressive batter by nature and was believed to be more suitable for the shorter formats of the game. In the England T20 Blast 2014, Jason hammered 677 runs at a superb average of 48.35, leading to his T20I debut against India in a one-off match in September 2014. Following the dismal performance of England in the 2015 ICC World Cup, they needed a new positive approach by revamping the whole team and Jason Roy became one of the faces of that revolution. He made his ODI debut against Ireland in May 2015 and was slotted in as their opener. The 'New England' team led by Eoin Morgan was keen to put behind the woes of 2015 and head in a new direction where the players would be able to play to their strengths and express themselves. This was the perfect platform for Roy to bring out the 'X-factor' in him and start the inning all guns blazing. He scored his maiden ODI ton against Pakistan towards the end of 2015 and began announcing himself on the world stage. He had an amazing series against Sri Lanka where he scored two big hundreds and had an average above 100. Jason Roy, along with Alex Hales and Jonny Bairstow began to demonstrate how much England's approach to the limited-overs format had changed. Jason was always going to be one of the first names on the team sheet for England in the 2019 World Cup and he proved to be a huge hit in the tournament. He scored a total of 443 runs in the 7 innings that he played with an average of 63.28 along with a strike rate of 115.36 as England won the tournament and lifted their maiden World Cup trophy after a long wait. Owing to his strong ODI form, the English team management decided to try him in the longer version of the game as well and he made his Test debut in a one-off game against Ireland. He was included in the 2019 Ashes squad and played in the first four matches but was dropped for the final game after a string of low scores. An injury in 2020 say him sidelined for a bit but was part of the England squad for the 2021 ICC Men's T20 World Cup. He was however not picked for the 2022 edition after some poor performances and the ferocious competition saw him lose his place in the squad. Jason started his global T20 journey in 2015 when he participated in the Australian T20 League, following which he took part in T20 Leagues in Bangladesh, Pakistan, South Africa, and India. His first stint in the Indian T20 League was in 2017 when he played three games for the now-defunct Gujarat franchise. Delhi bought him in 2018 and he scored an unbeaten 91 in his first outing which prompted them to re-sign him for the 2019 edition but he later pulled out to work on his fitness. After opting out of the 2020 season as well, Delhi released him and he was picked up by the Hyderabad franchise for their 2021 campaign in place of Mitchell Marsh. In the 2022 mega auction, the Gujarat franchise purchased him for their maiden season but he once again withdrew from the tournament citing personal reasons. The withdrawal of Shakib Al Hasan from the 2023 Indian T20 League forced the Kolkata franchise to look for options and they turned to Jason Roy who when in the groove can dismantle any bowling attack in the world.",
  "nationality": "England",
  "career_span": {
    "Test": "2019-2019",
    "ODI": "2015-2023",
    "IPL": "2017-2023"
  }
}