{
  "id": "pprofile_115918",
  "type": "player_bio",
  "player": "Bevon Jacobs",
  "full_name": "Bevon-John Jacobs",
  "dob": "May 6, 2002",
  "role": "Batsman",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm medium",
  "teams": [
    "New Zealand",
    "Auckland Aces",
    "Canterbury",
    "Mumbai Indians",
    "New Zealand XI",
    "MI Emirates",
    "South Brisbane",
    "Antigua & Barbuda Falcons"
  ],
  "bio": "Bevon Jacobs, a promising young batter from South Africa, has quickly made a name for himself in New Zealand cricket. Known for his right-handed batting style and right-arm medium bowling, Jacobs has shown immense potential in domestic circuits. His journey began with the Auckland Aces, where he debuted in the Plunket Shield in November 2024. Since then, he has consistently impressed with his performances, including a standout innings of 157 against Central Stags in March 2025. With a batting average of above 58 in first-class cricket, Jacobs has showcased his ability to anchor innings and score big. Jacobs' prowess isn't limited to the longer format. In the Ford Trophy, he has accumulated 352 runs across 18 matches, maintaining a strike rate of above 100. His highest score of 63 against Otago Volts in February 2025 highlights his capability to perform under pressure. In the T20 format, Jacobs has been a revelation too with a strike rate of above 147. His explosive innings of 105 against Toombul in the KFC T20 Max Competition in 2024 is a testament to his aggressive style and ability to dominate bowlers. Jacobs' career statistics reflect his versatility and adaptability across formats. His performances underscore his ability to adapt to different formats and conditions, making him a valuable asset to any team. As Jacobs continues to develop his skills, his innings of 90 against Northern Districts in January 2025 and 53 against Canterbury in the same month highlight his growing confidence and consistency. Looking ahead, Jacobs is poised to take on new challenges in the upcoming domestic and international fixtures. He is expected to play a pivotal role in New Zealand's cricketing future, potentially earning a spot in the national team.",
  "nationality": "New Zealand",
  "career_span": {
    "Test": "",
    "ODI": "",
    "IPL": ""
  }
}