{
  "id": "pprofile_74097",
  "type": "player_bio",
  "player": "Kumar Kushagra",
  "full_name": "Kumar Kushagra",
  "dob": "October 23, 2004",
  "role": "Wicket Keeper",
  "batting_style": "Right Handed",
  "bowling_style": "-",
  "teams": [
    "East Zone",
    "India A",
    "Delhi Capitals",
    "India Under-19",
    "Jharkhand",
    "India C Under-19",
    "Dumka Daredevils",
    "Bokaro Blasters",
    "Gujarat Titans",
    "Jharkhand CC",
    "Team A"
  ],
  "bio": "Kumar Kushagra, born on October 23, 2004, is a rising star in Indian cricket known for his explosive batting and remarkable talent. Hailing from Jharkhand, Kushagra has made significant strides in his cricketing career, showcasing his prowess in various formats of the game. With a promising start to his professional career and a series of impressive performances at the domestic level, Kushagra has emerged as one of the most exciting young prospects in Indian cricket. Kumar Kushagra's journey in cricket began at a young age, driven by his passion for the sport and fueled by his natural talent. Growing up in Jharkhand, Kushagra honed his skills in the local cricketing circuits, catching the eye of selectors and coaches with his exceptional batting abilities. His dedication and determination to succeed saw him rise through the ranks, establishing himself as a standout performer in junior cricket. Kumar Kushagra made his List A debut for Jharkhand on February 20, 2021, in the prestigious Vijay Hazare Trophy, marking the beginning of his professional cricketing career. His inclusion in the Jharkhand squad was a testament to his talent and potential as a young cricketer. Prior to his List A debut, Kushagra was named in India's squad for the 2020 Under-19 Cricket World Cup, highlighting his status as one of the brightest prospects in Indian cricket. In the 2021–22 Syed Mushtaq Ali Trophy, Kushagra made his Twenty20 debut for Jharkhand on November 4, 2021, further solidifying his credentials as a versatile batsman capable of performing in different formats of the game. Kumar Kushagra's breakthrough moment came in the 2021–22 Ranji Trophy season when he made his first-class debut for Jharkhand on February 24, 2022. In a remarkable display of batting prowess, Kushagra scored his maiden century in first-class cricket during the preliminary quarter-final match of the Ranji Trophy. However, he didn't stop there, he went on to convert his maiden century into a sensational double century, showcasing his ability to dominate opposition bowlers with his aggressive stroke play and solid technique. His outstanding performances in the Ranji Trophy earned him widespread acclaim and established him as a future star of Indian cricket. Kushagra's ability to excel under pressure and deliver match-winning innings at crucial junctures marked him as a player to watch out for in the years to come. In a testament to his burgeoning reputation as a talented young cricketer, Kumar Kushagra was picked by the Delhi franchise for a whopping 7.2 crore in the Indian Premier League 2024 auctions held in Dubai. His selection in one of the premier T20 leagues in the world is a testament to his potential and the faith that the Delhi team has in his abilities. Despite receiving opportunities to play for Delhi Capitals, he couldn't make a significant impact and was released by the franchise ahead of the 2025 IPL mega auction. Teams like CSK and Punjab Kings showed interest in him during the bidding, but ultimately, he was picked up by Gujarat Titans for INR 65 lakhs. This was a notable drop in value compared to the previous year.",
  "nationality": "India",
  "career_span": {
    "IPL": "2024"
  }
}