{
  "id": "pprofile_88677",
  "type": "player_bio",
  "player": "Vipraj Nigam",
  "full_name": "Vipraj Nigam",
  "dob": "July 28, 2004",
  "role": "All-Rounder",
  "batting_style": "Right Handed",
  "bowling_style": "Leg break",
  "teams": [
    "Delhi Capitals",
    "Uttar Pradesh",
    "India A Under-19",
    "Uttar Pradesh U-19",
    "UP Timber Cricket Club",
    "Lucknow Falcons"
  ],
  "bio": "Vipraj Nigam is a young and exciting all-rounder who comes from Delhi and currently making waves in Indian domestic cricket. A right-handed batter and a crafty leg-break bowler, he has shown great promise with both bat and ball. Vipraj currently represents Uttar Pradesh in domestic tournaments and has been signed by DC for IPL 2025. His journey so far has been marked by impressive performances, proving his potential as a future star. Vipraj made his first-class debut in October 2024, playing for Uttar Pradesh against Bengal at the Ekana Cricket Stadium in Lucknow. He immediately caught attention by taking four wickets, leading a crucial fightback for his team. His ability to deliver breakthroughs at key moments established him as a valuable asset. Later, he made his List A debut against Mizoram in December 2024, in Visakhapatnam, and his T20 debut in November 2024, when Uttar Pradesh faced Manipur in Mumbai. One of Vipraj’s most memorable performances came in the Syed Mushtaq Ali Trophy quarterfinal in December 2024. Playing against Andhra Pradesh, he turned the game in Uttar Pradesh’s favor with an explosive batting cameo. Coming in at a critical stage when his team needed 48 runs off 24 balls, he smashed 27 runs off just 8 deliveries, including three massive sixes in a single over. His fearless hitting, combined with Rinku Singh’s steady presence, helped UP chase down the target in 19 overs. Vipraj also made an impact with the ball, taking 2 wickets for 20 runs, making him the standout performer of the match. Vipraj’s rise has been fueled by his consistent performances in domestic leagues. In the UP T20 League, he picked up 20 wickets in 11 matches while playing for the Lucknow Falcons, showing his ability to deceive batters with his leg-spin. His impressive returns in the tournament played a big role in earning him an IPL contract. In the Ranji Trophy, he made a mark with 13 wickets in just three matches against strong teams like Bengal, Haryana, and Karnataka, proving his skills in red-ball cricket as well. With DC securing his services for IPL 2025, Vipraj is now gearing up for the biggest stage of his career. His ability to bowl tight spells, pick crucial wickets, and finish games with the bat makes him an exciting prospect for the franchise. With hard work and determination, Vipraj Nigam could soon become a household name in Indian cricket.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "",
    "IPL": "2025-2025"
  }
}