{
  "id": "pprofile_71149",
  "type": "player_bio",
  "player": "Manav Suthar",
  "full_name": "Manav Jagdusakumar Suthar",
  "dob": "August 3, 2002",
  "role": "Bowler",
  "batting_style": "Left Handed",
  "bowling_style": "Slow left-arm orthodox",
  "teams": [
    "Central Zone",
    "India A",
    "Rest of India",
    "India Under-19",
    "Rajasthan",
    "India C",
    "Gujarat Titans",
    "Jaipur Indians"
  ],
  "bio": "Manav Suthar, 3rd August 2022, a left-arm orthodox bowler from Rajasthan, is an exciting prospect in Indian cricket. The exiting southpaw was born in Sri Ganganagar and his talent was evident early on. He started impressing various age group tournaments and drew the attention of the selectors on him. He debuted First-class domestic cricket for Rajasthan against Andhra Pradesh in February 2022. He took a bit of time to settle in a couple of matches but after that, in the first eight matches, he took 44 wickets which included 4 four-wicket hauls, 2 five-wicket hauls, and two 10-wicket hauls. In October of the same year, he made the debut for his state in the Syed Mushtaq Ali Trophy Twenty20 against Rajkot and also picked up two wickets for the side. In July 2023 he made his List A debut for India A in the ACC Men’s Emerging Cup against UAE A and bagged two wickets into his account and helped his team to win. He worked hard day by day to put up a sensational performance to solidify his reputation in domestic cricket. He also holds exceptional stats in the Rajasthan Premiere League for Jaipur Indians and received good learning from experienced players. His performance surely secured his services in the IPL. Gujarat acquired Manav for INR 20 Lakhs in the auction of the 2023 Indian Premier League and offered him a chance to showcase his bowling prowess on a bigger stage. Continuing his stint with Gujarat Titans in 2024, Manav Suthar may not have featured prominently in the matches, but he undoubtedly gained invaluable experience, training alongside some of the seasoned players in the squad. GT released him ahead of the 2025 IPL auction, but quickly reacquired his services, securing him for INR 30 lakhs. Manav Suthar, who is on the radar of the India Test team, has been steadily building his reputation with his performances in domestic cricket. His talent has not gone unnoticed, and his consistent progress could soon see him earning a call-up to represent the national team in the longest format.",
  "nationality": "India",
  "career_span": {
    "IPL": "2024"
  }
}