{
  "id": "pprofile_57903",
  "type": "player_bio",
  "player": "Mitchell Santner",
  "full_name": "Mitchell Josef Santner",
  "dob": "February 5, 1992",
  "role": "All-Rounder",
  "batting_style": "Left Handed",
  "bowling_style": "Slow left-arm orthodox",
  "teams": [
    "New Zealand",
    "Northern Districts",
    "New Zealand A",
    "Surrey",
    "Worcestershire",
    "Chennai Super Kings",
    "Mumbai Indians",
    "Barbados Royals",
    "New Zealanders",
    "Manchester Originals",
    "Northern Superchargers",
    "Southern Brave",
    "Texas Super Kings"
  ],
  "bio": "In Mitchell Santner, New Zealand cricket found a strong, resembling replacement for one of their veterans and the most successful bowler in ODIs, Daniel Vettori. This was not just because Santner too bowled left-arm orthodox but mainly because he carried the same potential to perform and excel when he joined the team that Vettori had displayed in his younger days. He toured England in 2015 but did not get to feature in the Tests, even though he was part of the squad for the same. He did, however, make the cut in the ODIs and the lone T20I that followed. Even though he is a bowling all-rounder, a glimpse of his batting capabilities was seen in the 4th ODI, where he smacked 44 off just 19 balls, coming in at No. 7. He had a decent T20I debut in the same tour, picking up 2/28 in his four overs, and was the best bowler for the Kiwis in that lone T20I. Santner shone in the 2016 T20 World Cup for New Zealand, picking up 11 wickets in the tournament, including a remarkable 4/11 against India in the very first game, where he and Ish Sodhi ran riot to bowl out India for just 79. But besides this, he had a rather lacklustre 2016-17 season. Santner was picked to play for Chennai in the 2018 Indian Premier League but missed the season owing to an injury. In the 2019 edition, Santner played 4 matches and managed to pick up 4 wickets at a decent economy rate. The next season, he was retained by the franchise, but he played just 2 matches. Santner also featured in all the games for the Black Caps in the 2019 World Cup. His most notable performance in the tournament came against India in the semi-final with figures of 2/34, wherein he picked the important wickets of Rishabh Pant and Hardik Pandya and was the second-best bowler in the game, behind Matt Henry’s 3 wickets. Over the years, he was given leadership opportunities in white-ball cricket when senior players were rested as part of New Zealand’s long-term planning to prepare for the future. Despite his talents with both bat and ball, Santner’s opportunities in the IPL remained limited while playing for Chennai. At the 2023 ODI World Cup, Santner impressed with his performances and finished as New Zealand’s highest wicket-taker at the tournament. In 2024, New Zealand’s cricketing hierarchy decided Santner was ready to take on more responsibility. When Kane Williamson stepped down from the white-ball captaincy after the T20 World Cup and declined the central contract, the talented all-rounder was handed the full-time leadership of both the ODI and T20I formats. Mitchell Santner's tenure as New Zealand's captain began with a challenging ODI series loss in Sri Lanka. However, he quickly turned things around when Sri Lanka toured New Zealand later that year, leading the team to victories in both the ODI and T20I series. Under his leadership, New Zealand showed strong signs of improvement, setting the stage for bigger challenges ahead. As part of their preparation for the 2025 Champions Trophy, New Zealand participated in a tri-series against South Africa and Pakistan, where they dominated the competition, remaining unbeaten to claim the title. Santner’s tactical acumen and ability to lead from the front were evident as he played a crucial role with both bat and ball. In the Champions Trophy 2025, Santner had a stellar campaign, spearheading New Zealand’s bowling attack while leading the side with composure. His efforts guided the team to yet another ICC final, but heartbreak followed as the Kiwis fell short once again. Despite the disappointment, Santner earned widespread praise for his leadership, resilience, and ability to rally his team on the big stage, reinforcing his reputation as a key figure in New Zealand cricket.",
  "nationality": "New Zealand",
  "career_span": {
    "Test": "2015-2025",
    "ODI": "2015-2025",
    "IPL": "2019-2025"
  }
}