{
  "id": "pprofile_67927",
  "type": "player_bio",
  "player": "Fazalhaq Farooqi",
  "full_name": "Fazalhaq Farooqi",
  "dob": "September 22, 2000",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Left-arm fast medium",
  "teams": [
    "Nottinghamshire",
    "Rajasthan Royals",
    "Afghanistan Under-19",
    "Afghanistan",
    "Sydney Thunder",
    "Sunrisers Hyderabad",
    "Rangpur Riders",
    "St Kitts and Nevis Patriots",
    "Dhaka Capitals",
    "Comilla Victorians",
    "Islamabad United",
    "Amo Region",
    "Amo Sharks",
    "Boost Defenders",
    "Bangla Tigers",
    "Kabul Region",
    "Toronto Nationals",
    "Nangarhar Leopards",
    "Delhi Bulls",
    "Manchester Originals",
    "Faryab Province",
    "Colombo Strikers",
    "MI Emirates",
    "Seattle Orcas"
  ],
  "bio": "Fazalhaq Farooqi, a left-arm fast bowler capable of swinging the ball both ways at high speeds, quickly established himself as Afghanistan’s primary pace spearhead in limited-overs cricket following his international debut in 2021. His ability to trouble batters with movement in the air and off the pitch made him a vital asset in both international cricket and various franchise leagues. Since his rise in the Afghanistan squad, Farooqi has become the first-choice bowler with the new ball, not only for his national team but also in the T20 leagues he participates in globally. Under the mentorship of Dwayne Bravo, whom he worked with at different franchises and during Bravo’s tenure as Afghanistan’s fast-bowling consultant, he refined his skills in death-over bowling, making him an effective weapon in the latter stages of an innings. By the time he represented Afghanistan in the 2020 ICC Under-19 Cricket World Cup in South Africa, Farooqi had already gained recognition in Afghanistan’s domestic circuit. He made his T20I debut in 2021, and his performances in the shortest format soon earned him a spot in the ODI team in early 2022. Although his performances in the 2022 ICC Men’s T20 World Cup were inconsistent, he found his rhythm ahead of the 2023 ICC Men’s Cricket World Cup, picking up 12 wickets across six matches against Bangladesh and Pakistan. During the tournament, he also delivered a match-winning four-wicket haul against Sri Lanka. His growing stature attracted interest from franchise leagues worldwide. However, in 2023, Farooqi, along with fellow Afghan cricketers Mujeeb-ur-Rahman and Naveen-ul-Haq, requested the Afghanistan Cricket Board (ACB) to release them from their central contracts to allow greater participation in franchise leagues. This led to a standoff with the board, which initially revoked their No Objection Certificates (NOCs), preventing them from participating in overseas leagues for two years. Eventually, a resolution was reached, and they were granted a limited number of NOCs and subjected to financial penalties. In the 2024 ICC Men’s T20 World Cup, Farooqi played a crucial role in Afghanistan’s historic semi-final run. He began the tournament with an outstanding five-wicket haul against Uganda and followed it up with four wickets in a dominant victory over New Zealand. Finishing as the joint-highest wicket-taker of the tournament with 17 dismissals, he demonstrated his effectiveness with the new ball, accounting for 10 wickets inside the Powerplay. Farooqi’s success in the T20 format has made him a sought-after bowler in franchise cricket. In 2024, he signed a contract to play for Nottinghamshire in England’s T20 Blast, further expanding his presence in global T20 competitions. After being released by Hyderabad following the 2024 season, Farooqi was snapped up by Rajasthan for the 2025 edition of the IPL.",
  "nationality": "Afghanistan",
  "career_span": {
    "Test": "",
    "ODI": "2022-2025",
    "IPL": "2022-2025"
  }
}