{
  "id": "pprofile_69879",
  "type": "player_bio",
  "player": "Luvnith Sisodia",
  "full_name": "Luvnith Sujith Sisodia",
  "dob": "January 15, 2000",
  "role": "Wicket-Keeper",
  "batting_style": "Left Handed",
  "bowling_style": "Left-arm medium",
  "teams": [
    "Royal Challengers Bengaluru",
    "Kolkata Knight Riders",
    "Karnataka",
    "Mysore Warriors",
    "Hubli Tigers",
    "Gulbarga Mystics",
    "Reliance 1"
  ],
  "bio": "Luvnith Sisodia, born and brought up in Bangalore, Karnataka, is a dynamic young cricketer making waves with his aggressive left-handed batting and exceptional wicketkeeping skills. His remarkable talent has drawn attention in major T20 competitions, establishing him as a standout player in Karnataka's domestic cricket landscape. Debuting in Twenty20 cricket on February 25, 2019, Sisodia played for Karnataka against Mizoram in the Syed Mushtaq Ali Trophy, where he quickly showcased his potential with his ability to score quick runs and some outrageous shots in his locker. In addition, his contributions behind the stumps are impressive as well. In a stunning display of his batting prowess during a corporate one-day competition in 2021, Sisodia struck an astounding 312 runs from just 129 balls, hitting 26 sixes and 26 fours. This extraordinary performance captured the attention of IPL scouts, leading to trials with multiple teams. In February 2022, he was signed by Bangalore for ₹20 lakhs, although he didn’t play that season. By the 2025 IPL season, his talent was recognized once again when Kolkata secured him for ₹30 lakhs. While his IPL match experience is still pending, Sisodia remains an active force in domestic cricket, representing Karnataka in various formats and diligently honing his skills for future opportunities. Beyond his batting expertise, he has demonstrated impressive leadership by guiding the Karnataka Under-23 team to victory in the 2020 Col CK Nayudu Trophy. With his remarkable track record in domestic cricket and undeniable growth potential, Luvnith Sisodia is undoubtedly a player worth following in the years to come.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "",
    "IPL": ""
  }
}