{
  "id": "pprofile_63345",
  "type": "player_bio",
  "player": "Shardul Thakur",
  "full_name": "Shardul Narendra Thakur",
  "dob": "October 16, 1991",
  "role": "All-Rounder",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm medium fast",
  "teams": [
    "India",
    "Essex",
    "India A",
    "India B",
    "India Blue",
    "Rest of India",
    "West Zone",
    "Kolkata Knight Riders",
    "Punjab Kings",
    "Chennai Super Kings",
    "Delhi Capitals",
    "Mumbai",
    "Mumbai A",
    "Western Wolves",
    "Rising Pune Supergiant",
    "Eagle Thane Strikers",
    "Indians",
    "Lucknow Super Giants",
    "Tata Sports Club"
  ],
  "bio": "There is that one bowler in every team who has that uncanny knack of providing breakthroughs when the team needs them the most, and whenever that bowler comes on to bowl, he brings wickets with him. Shardul Thakur is a right-arm pace bowling all-rounder who brings that same attribute to the table when representing the Indian national team. It was not a fairytale start for Shardul, as he managed just 4 wickets in his debut season in the Ranji Trophy. He redeemed himself in the 2013/14 season, picking up 27 wickets in 6 games, and came of age in the third season, snaring 48 wickets, which made him the joint-highest wicket-taker for the 2014/15 season. He was rewarded with an Indian Premier League contract as the Punjab franchise picked him up for the 2015 edition. In 2017, Indian selectors took notice of his performances at the domestic level for Mumbai and named him in India’s white-ball squad for the tour of Sri Lanka, where he made his ODI debut. Shardul went on to make his T20I and Test debuts for India. He was part of the Indian Test team during their 2020-21 tour of Australia. His maiden fifty in Brisbane was one of the high points of the series that India eventually pocketed. Shardul has a good outswinger going away from the right-handed batter. He can also extract purchase from the surface by hitting the wicket. Thakur is more than decent with the bat and can certainly show some fight lower down the order. His multi-dimensional skills make him a useful commodity in the team. After playing for the Punjab franchise, he represented the now-defunct Pune, Chennai, and Delhi franchises in the Indian Premier League. He won the Indian Premier League title with Chennai in 2018 and 2021. Despite being out of favour in the T20I setup since 2022, Shardul remained a valuable member of India’s ODI side and earned a place in the 2023 World Cup squad, where he had a mixed tournament. However, post the World Cup, injuries and competition from other all-rounders saw him lose his place in both ODIs and Tests. Adding to his struggles, Thakur went unsold at the 2025 IPL auction, a surprising turn for a player known for his knack of breaking partnerships and contributing with the bat. But as fate would have it, he was drafted in as a replacement by Lucknow Super Giants for the injured Mohsin Khan.",
  "nationality": "India",
  "career_span": {
    "Test": "2018-2025",
    "ODI": "2017-2023",
    "IPL": "2015-2025"
  }
}