{
  "id": "pprofile_65859",
  "type": "player_bio",
  "player": "Washington Sundar",
  "full_name": "Washington Sundar",
  "dob": "October 5, 1999",
  "role": "All-Rounder",
  "batting_style": "Left Handed",
  "bowling_style": "Off break",
  "teams": [
    "India",
    "India A",
    "India B",
    "India Red",
    "Lancashire",
    "South Zone",
    "Royal Challengers Bengaluru",
    "India Under-19",
    "Tamil Nadu",
    "Sunrisers Hyderabad",
    "Rising Pune Supergiant",
    "SKM Salem Spartans",
    "Siechem Madurai Panthers",
    "Trichy Grand Cholas",
    "India C",
    "Indians",
    "County Select XI",
    "Gujarat Titans",
    "Globe Trotters Sports Club",
    "Team B"
  ],
  "bio": "After coming into the scene in the 2016 Under-19 World Cup, Washington Sundar began his journey of becoming a household name in cricket. Owing to his decent outing in the multi-nation tourney, he was given a spot in the Tamil Nadu squad for the Ranji Trophy 2016-17. The initial impression about the youngster was that he was a top-order batter with useful off-spinning abilities under his belt. But as his career progressed, he became more of a bowler who could bat. Sundar grabbed the headlines when the Pune franchise signed him as a replacement for Ravichandran Ashwin, who was ruled out of the 2017 season of the Indian Premier League. He turned out to be one of the finds of the season as he weaved magic with his economical bowling. In Qualifier 1 of the 10th edition of the Indian Premier League, he was named the Man of the Match for picking up a 3-fer, which underlined his value as a player. Post that, he shone in the second edition of the Tamil Nadu Premier League by being the top run-scorer along with being in the top wicket-takers list as well. These performances paved the way for a call-up to the Indian side in 2017. He made his debut in the two white-ball formats in a space of a few days, with both his maiden games coming against Sri Lanka. In the following year, the Bengaluru franchise snapped him up in the auction but didn't hand him enough opportunities, however, in the coming seasons, Sundar became the go-to bowler for Virat Kohli, mainly in the Powerplay. Sundar was a part of India's squad for the Nidahas Tri-series against Bangladesh and Sri Lanka, where the Men in Blue won the title. He finished with 8 wickets in total and won the Man of the Series award as well. Later on, during India's 2020-21 tour of Australia, Sundar was picked as a net bowler, but due to a number of injuries in the squad, he was handed his debut in the Gabba Test, where he managed to impress one and all. Injuries over the course of the next couple of years hindered his progress, leading to him being in and out of the white-ball squads. While he did feature for India in white-ball formats whenever he was fit during the injury-plagued period, that was not the case in the Test format. It wasn't until 2024, with Gautam Gambhir's appointment as head coach, taking over from Rahul Dravid, that things changed for Sundar. Gambhir showed faith in him and called him up for the Test series at home against New Zealand, a series in which India suffered a whitewash. However, Sundar emerged as a rare bright spot in an otherwise forgettable campaign, claiming his maiden 10-wicket haul in Test cricket during the second Test in Pune. The promise he showed as an all-rounder earned him a spot on the flight to Australia for the Border-Gavaskar Trophy. However, he couldn't quite make the impact he had hoped for, particularly with the ball, as India endured a challenging series. After making the switch from Bengaluru to Hyderabad in the Indian Premier League, Sundar's stint coincided with his injury-plagued period, preventing him from getting a consistent run in the side. Following the 2024 season, Hyderabad released him, and he was subsequently picked up by Gujarat at the auction for the 2025 edition.",
  "nationality": "India",
  "career_span": {
    "Test": "2021-2025",
    "ODI": "2017-2025",
    "IPL": "2017-2025"
  }
}