{
  "id": "pprofile_63755",
  "type": "player_bio",
  "player": "Jasprit Bumrah",
  "full_name": "Jasprit Jasbirsingh Bumrah",
  "dob": "December 6, 1993",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm fast",
  "teams": [
    "India",
    "India A",
    "India Green",
    "Leicestershire",
    "West Zone",
    "Mumbai Indians",
    "Gujarat",
    "India Under-23",
    "Indians"
  ],
  "bio": "The Indian Premier League has been the making of many promising young players, and Jasprit Bumrah is one of them. Featuring for Mumbai, Bumrah first caught the eye with an unusual bowling action. Blessed with the ability to bowl yorkers and get the steep bounce off the pitch, the Gujarat pacer has arguably become India’s best bowler in limited-overs cricket since making his international debut. Jasprit made his T20 debut against Maharashtra in the 2012-13 Syed Mushtaq Ali Trophy and helped Gujarat clinch the title with his Man of the Match performance. After impressing in his debut Indian Premier League season for the Mumbai-based franchise, in the subsequent year, he was again bought by Mumbai for a whopping 1.2 crores. Bumrah's unusual angle with which he bowls made him a household name in the T20s. The Indian selectors took notice of it, and his skills, control, and accuracy got him on the flight to Australia in 2016 for the T20I series. When Mohammed Shami got injured, Bumrah was given the opportunity to make his ODI debut in Sydney before the T20Is. After an impressive outing there, he was given a place in the starting XI for the T20Is, and he didn't disappoint as he took six wickets. After great success during the Australian tour, it came as no surprise when Bumrah soon became the number two-ranked T20I bowler in the world. He played in the Asia Cup and T20I World Cup as well in the same year, spearheading the pace attack and cementing his place. His control in the death overs meant that the Indian selectors showed faith in him for the 2017 ICC Champions Trophy also. Though he bowled a no-ball on a wicket delivery to the eventual centurion Fakhar Zaman, he didn't let that setback worry him much. Proving his mantle time and again, Bumrah emerged as the go-to bowler for whichever captain he played under in the shorter formats and eventually, in the Tests as well. Bumrah was the strike bowler for India in the World Cup 2019 and showed the world his potential. His yorkers were as deadly as a bullet in that tournament, which helped him take wickets but also led to an injury to his teammate Vijay Shankar after he was struck by Bumrah's yorker on his toe during a net session. Post the 2019 World Cup, during India's second Test Championship match against West Indies in Jamaica, Bumrah struck gold as he registered a Test hat trick to his name, dismissing Darren Bravo, Shamarh Brooks, and Roston Chase, and became only the third Indian to do so after Harbhajan Singh and Irfan Pathan. In February 2022, Bumrah was named vice-captain of India for the T20I and Test series against Sri Lanka owing to the unavailability of regular vice-captain KL Rahul. A few months later, in July, Bumrah captained the Indian Test team against England for the first time instead of Rohit Sharma, who was ruled out due to suffering from COVID-19. On 21 August 2023, Bumrah was named in India's squad for the 2023 Asia Cup. He was also included in the squad for the 2023 ICC Men's World Cup, which was held in India, and Bumrah displayed great control and wicket-taking ability to take his side to the final, but unfortunately, India lost. Bumrah continued his exceptional form into 2024 across all formats, with his performances at the 2024 T20 World Cup standing out as India clinched their second title in the tournament's history. His 15 wickets at the event earned him the Player of the Series award. During the Border-Gavaskar Trophy in Australia, Bumrah captained India in the absence of Rohit Sharma, delivering a captain’s performance and guiding the tourists to a memorable victory in Perth. He finished the series with an outstanding 32 wickets, despite India’s series loss, and was named the Player of the Series for his efforts. For his remarkable contributions throughout 2024, Bumrah was awarded the prestigious Sir Garfield Sobers Award for ICC Men's Cricketer of the Year and the ICC Men's Test Cricketer of the Year.",
  "nationality": "India",
  "career_span": {
    "Test": "2018-2025",
    "ODI": "2016-2023",
    "IPL": "2013-2025"
  }
}