{
  "id": "pprofile_74055",
  "type": "player_bio",
  "player": "Akash Madhwal",
  "full_name": "Akash Madhwal",
  "dob": "November 25, 1993",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm medium fast",
  "teams": [
    "Central Zone",
    "Rajasthan Royals",
    "Mumbai Indians",
    "Uttarakhand",
    "Reliance 1",
    "Pithoragarh Hurricanes",
    "Nainital SG Pipers"
  ],
  "bio": "Akash Madhwal, a name that might not have been familiar to many cricket enthusiasts until recently, has quickly risen to prominence in the Indian cricket scene. This right-arm pacer from Roorkee, Uttarakhand, has captured the attention of fans and experts alike with his exceptional bowling skills and his meteoric rise to the top. Born on November 25, 1993, Madhwal initially started his cricketing journey playing tennis ball cricket until the age of 24. It was only in 2019 that he transitioned to leather ball cricket and made his debut for Uttarakhand. His talent was quickly recognized, and he was named the T20 captain of the state team ahead of the 2023 season. Madhwal's breakthrough moment came in the Indian Premier League (IPL) 2023. Playing for Mumbai, he made his IPL debut and immediately left a lasting impression. In an eliminator match against Lucknow, he delivered a spell of a lifetime, taking a remarkable five-wicket haul for just five runs. This performance shattered the record for the best bowling figures by an uncapped player in IPL history at that time. Madhwal's bowling style is characterized by his ability to generate pace and extract bounce from the pitch. He possesses a quick arm action and delivers the ball with precision, making it difficult for batsmen to read his deliveries. His yorkers are particularly lethal, and he has the knack of bowling in the death overs when the pressure is high. Akash Madhwal's journey from a tennis ball cricketer to an IPL sensation is a testament to his hard work, talent, and unwavering belief in himself. He has already made a significant impact on the cricket world, and his future looks incredibly promising. As he continues to hone his skills and gain experience, he has the potential to soon solidify a place in the national team as well. At the 2025 IPL Mega Auction held in Jeddah in November of 2024, Madhwal was picked up by the Rajasthan franchise for a sum of 1.2cr INR.",
  "nationality": "India",
  "career_span": {
    "IPL": "2023-2025"
  }
}