{
  "id": "pprofile_94784",
  "type": "player_bio",
  "player": "Eshan Malinga",
  "full_name": "Kiribathgala Kankanamalage Eshan Malinga Dharmasena",
  "dob": "February 4, 2001",
  "role": "Bowler",
  "batting_style": "Left Handed",
  "bowling_style": "Right-arm fast medium",
  "teams": [
    "Sri Lanka",
    "Bloomfield Cricket and Athletic Club",
    "Sri Lanka Emerging",
    "Ragama Cricket Club",
    "Sri Lanka A",
    "Sunrisers Hyderabad",
    "Colombo Strikers",
    "Jaffna Kings",
    "SLC Greys",
    "Jaffna",
    "Paarl Royals",
    "Hambantota Bangla Tigers"
  ],
  "bio": "Eshan Malinga, a promising young fast bowler from Sri Lanka, has been making waves in the cricketing world with his right-arm fast-medium deliveries. Born in Sri Lanka, Malinga has quickly established himself as a key player for his national team, showcasing his talent in various formats. His ODI debut against New Zealand in January 2025 marked the beginning of what promises to be a remarkable international career. In his short stint, Malinga has already taken four wickets in five ODIs, with a best bowling figure of 3-35 against New Zealand, demonstrating his potential to become a leading wicket-taker for Sri Lanka. Malinga's bowling style is characterized by his ability to generate pace and movement, making him a formidable opponent for batsmen. His recent performances in the ODI series against Australia and New Zealand have highlighted his knack for picking up crucial wickets, even in challenging conditions. Despite his limited experience, Malinga has shown a commendable bowling average of 39.25 and an economy rate of 6.03, indicating his effectiveness in containing runs while taking wickets. In the domestic circuit, Malinga has been a consistent performer for Ragama Cricket Club and Sri Lanka A. His first-class record includes 38 wickets in 16 matches, with a best performance of 4-33 against Negombo Cricket Club. His ability to adapt to different pitch conditions and maintain a steady line and length has been instrumental in his success. Malinga's fielding skills are also noteworthy, with five catches and two run-outs to his name, adding value to his all-round capabilities on the field. Malinga's journey in franchise cricket has seen him play for teams like Sunrisers Hyderabad and Jaffna Kings, where he continues to hone his skills against international players. His participation in the SA20 League with Paarl Royals has provided him with valuable exposure to different playing styles and conditions, further enhancing his growth as a cricketer. Looking ahead, Eshan Malinga is set to face new challenges as he prepares for upcoming season of the Indian Premier League where he will be with Sunrisers Hyderabad in the 2025 season. Eshan Malinga's rise in the cricketing world is a testament to his hard work and dedication. As he continues to develop his skills and gain experience, the cricketing fraternity eagerly anticipates his contributions to Sri Lankan cricket in the years to come.",
  "nationality": "Sri Lanka",
  "career_span": {
    "Test": "",
    "ODI": "2025-2025",
    "IPL": "2025-2025"
  }
}