{
  "id": "pprofile_60802",
  "type": "player_bio",
  "player": "Krishnappa Gowtham",
  "full_name": "Krishnappa Gowtham",
  "dob": "October 20, 1988",
  "role": "All-Rounder",
  "batting_style": "Right Handed",
  "bowling_style": "Off break",
  "teams": [
    "India",
    "India A",
    "India B",
    "India Red",
    "Rest of India",
    "South Zone",
    "Punjab Kings",
    "Chennai Super Kings",
    "Rajasthan Royals",
    "Mumbai Indians",
    "Karnataka",
    "Belagavi Panthers",
    "Mysore Warriors",
    "Shivamogga Lions",
    "Ballari Tuskers",
    "Malnad Gladiators",
    "Lucknow Super Giants",
    "Mangaluru Dragons"
  ],
  "bio": "An emerging off-spinner and explosive lower-order batter from Karnataka, Krishnappa Gowtham is still looking to make his mark in the international cricketing scene. His journey started when he made his first-class debut for Karnataka in 2012 against Uttar Pradesh, where he picked up 2 wickets in the game too. Then came a period where he was not able to showcase his skill consistently and that saw a dip in his stock price. Moving forward to 2017, Gowtham became a regular member of the Karnataka team. His call back happened due to his performances in the Karnataka Premier League, which saw him make a comeback into the Karnataka squad in 2016. He claimed 27 wickets in eight matches. These good performances meant the selectors decided to hand him a chance as he was picked in the India A squad for a tour game against Australia, who were visiting, in 2017. This opportunity was grabbed by both hands as he scored a quickfire 74 and showed what he could do, with a blade in hand. He continued his progress in the first-class cricket, beginning the 2017/18 Ranji Trophy with a cracking show - picking up seven wickets across two innings and he also scripted a wonderful victory for Karnataka, by scoring his maiden first-class ton, in a game against Assam. In the Indian T20 League, he was picked up by the Mumbai for a pretty high amount, for an uncapped player, in 2017. Unluckily for him, he did not play a game and was released before the 2018 auctions, where Rajasthan put their money on him and decided to rope him into their squad. He finally made his debut for them in 2018, where he snared 11 wickets in his debut season. Gowtham made history as he became the most expensive uncapped player to be sold in the auctions, when he was sold to Chennai for a whopping INR Rs. 9.25 crores, ahead of the 2021 season. The 2021 season will be important for him to showcase what he is capable of, with all the eyes on him, and if he does perform well, then a chance could be cropped up, for him to display his talents, with the Indian jersey on his back.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "2021-2021",
    "IPL": "2018-2024"
  }
}