{
  "id": "pprofile_58155",
  "type": "player_bio",
  "player": "Shreyas Gopal",
  "full_name": "Shreyas Gopal",
  "dob": "September 4, 1993",
  "role": "All-Rounder",
  "batting_style": "Right Handed",
  "bowling_style": "Leg break",
  "teams": [
    "India A",
    "India B",
    "India Blue",
    "India Green",
    "South Zone",
    "Chennai Super Kings",
    "Rajasthan Royals",
    "Mumbai Indians",
    "India Under-19",
    "Karnataka",
    "Kerala",
    "Sunrisers Hyderabad",
    "Southern Champs",
    "Mysore Warriors",
    "Shivamogga Lions",
    "Hubli Tigers",
    "Bengaluru Blasters",
    "KCA Eagles",
    "BPCL",
    "Mangaluru Dragons",
    "Kerala CC"
  ],
  "bio": "Shreyas Gopal, who action is quite reminiscent of the legendary Anil Kumble, one of India's greatest leg-spinners, has carved a niche for himself in the cricketing world as a dynamic all-rounder. Known for his leg-spin and right-handed batting, Gopal has been a pivotal figure in domestic cricket, particularly for Karnataka. His career is highlighted by a remarkable hat-trick in the 2019 IPL against Royal Challengers Bangalore, where he dismissed Virat Kohli, AB de Villiers, and Marcus Stoinis, showcasing his ability to rise to the occasion in high-pressure situations. Gopal’s cricketing journey began at a young age, having captained Karnataka at various age-group levels, including Under-13, Under-15, Under-16, and Under-19. He played three ODIs for the India Under-19 team in 2011, showing his promise on the national stage early on. His domestic debut for Karnataka came in 2013, and he progress was marked by a historic hat-trick in the Irani Cup against Rest of India, in 2019 which helped Karnataka secure the title, further underscoring his potential and skill. Over the years, Gopal has been a consistent performer in the Ranji Trophy, with a healthy bowling average and more than 250 first-class wickets. His best bowling figures of 5/17 against Hyderabad in 2017 remain a career highlight. In the IPL, Gopal has been a valuable asset. He began his journey with Mumbai Indians in 2014, spending almost four seasons before being bought by Rajasthan Royals. In the 2022 season, he was acquired by Sunrisers Hyderabad, but he struggled to make an impact and went unsold for the 2023 season. However, life came full circle for him when he was re-acquired by Mumbai Indians in 2024. Gopal’s form in domestic cricket continues to impress, as demonstrated in the 2024/25 Syed Mushtaq Ali Trophy, where he claimed a hat-trick against Baroda in Indore, dismissing Hardik Pandya, Krunal Pandya for golden ducks, and Baroda opener Shashwat Rawat. After a solid run, Gopal found a new home in the Chennai Super Kings for the 2025 season, where the team acquired him for a base price of INR 30 lakhs, adding another chapter to his journey in the IPL and domestic cricket.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "",
    "IPL": "2014-2024"
  }
}