{
  "id": "pprofile_65799",
  "type": "player_bio",
  "player": "Mohammed Siraj",
  "full_name": "Mohammed Siraj",
  "dob": "March 13, 1994",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm fast",
  "teams": [
    "India",
    "India A",
    "India B",
    "India Green",
    "Rest of India",
    "Warwickshire",
    "Royal Challengers Bengaluru",
    "Hyderabad",
    "Sunrisers Hyderabad",
    "Indians",
    "Gujarat Titans",
    "Team B"
  ],
  "bio": "Mohammed Siraj's story is what dreams are made of, as it is an inspiring rag to riches tale. From being an autorickshaw driver's son to being the leading wicket-taker for India during their second Test series win in Australia, Siraj has seen it all. He made his First-Class debut during the 2015-16 Ranji Trophy season for Hyderabad. In the 2016-17 season, Siraj picked up 41 wickets in 9 matches and was the highest wicket-taker for Hyderabad. Siraj was also the highest wicket-taker during the 2017-2018 Vijay Hazare Trophy after picking up 23 wickets in seven games. Siraj came to the spotlight after being bought for 2.6 crores by Hyderabad during the 2017 season of the Indian Premier league. He switched over to Bengaluru for the 2018 season and picked up 11 wickets in that season. His first taste of international cricket came in 2017 when he made his debut against New Zealand. Similar to his T20I debut, Siraj's first day in ODI cricket was a tough one, as he conceded 76 runs against Australia in 2019. He was a part of India's Test squad for the series against West Indies in 2018, but he had to wait two more years to make his debut. Siraj made his Test debut against Australia in December 2020. He played a pivotal role in India's victory in the series, as he picked up 13 wickets in the three games that he played and was also the leading wicket-taker for India in that series. Siraj has demonstrated remarkable growth year after year, emerging as a stalwart in India's pace attack on numerous occasions, particularly in the absence of Jasprit Bumrah and Mohammed Shami. The year 2023 proved to be a memorable one for the Hyderabad pacer. His stellar performance continued during India's victorious campaign in the Asia Cup, where Siraj played a pivotal role in the summit clash against Sri Lanka. In that match, he showcased his prowess by claiming career-best figures of 6/21, decimating the opposition by bowling them out for just 50. Siraj's contribution was equally significant in the 2023 ODI World Cup, where he played a supportive role alongside Bumrah and Shami. Ending the tournament with 14 wickets to his name, he played a crucial part in helping India reach the final. He became an obvious choice for the ICC T20 World Cup 2024 held in the USA and the Caribbean. However, he featured in just three matches, managing to pick up only one wicket. Fast forward to the 2024/25 Border-Gavaskar Trophy, and Siraj delivered a spectacular performance, claiming 20 wickets throughout the series. His best outing came in the Adelaide Test, where he picked up a 4-wicket haul. As the next IPL season approached, RCB decided to release the right-arm quick after he had taken 83 wickets for the franchise since his inclusion in 2018. They chose not to use the RTM card in the mega auction, but franchises like CSK and RR showed interest. In the end, it was GT that secured his services for a staggering INR 12.25 crores.",
  "nationality": "India",
  "career_span": {
    "Test": "2020-2025",
    "ODI": "2019-2024",
    "IPL": "2017-2025"
  }
}