{
  "id": "pprofile_66923",
  "type": "player_bio",
  "player": "Tom Banton",
  "full_name": "Thomas Banton",
  "dob": "November 11, 1998",
  "role": "Batsman",
  "batting_style": "Right Handed",
  "bowling_style": "-",
  "teams": [
    "England",
    "England XI",
    "Kolkata Knight Riders",
    "England Under-19",
    "Somerset",
    "Brisbane Heat",
    "England Lions",
    "Quetta Gladiators",
    "Peshawar Zalmi",
    "Delhi Bulls",
    "Qalandars",
    "Deccan Gladiators",
    "Team Abu Dhabi",
    "Northern Superchargers",
    "Trent Rockets",
    "Welsh Fire",
    "Colombo Strikers",
    "Fortune Barishal",
    "Team Morgan",
    "MI Cape Town",
    "Dubai Capitals",
    "Gulf Giants",
    "MI Emirates",
    "Joburg Bangla Tigers"
  ],
  "bio": "Tom Banton is a dynamic, new-age, young English wicket-keeper batsman who burst onto the scene in 2017 for Somerset. His big hitting, explosive batting, and quick glovework behind the stumps have seen him being touted as a successor for Jos Buttler. A product of the Warwickshire's system, Banton also played for the Under-19s and his potential was obvious to those who saw him and he was handed a contract at Somerset for the 2017/18 season. It was the 2019 T20 Blast where he truly made a name for himself, scoring over 500 runs at a staggering strike rate, including a breathtaking 100 off 51 balls against Kent. His ability to dominate bowlers with audacious shots, including reverse scoops and lofted drives, quickly made him one of England’s most exciting young prospects. Banton’s international career began in 2019 when he was called up to England’s T20I squad against New Zealand. He made an immediate impact with a quickfire 31 off 20 on debut, showcasing his aggressive intent. A few months later, he announced himself on the global stage with a brilliant 71 off 42 balls against South Africa. His ODI debut followed in 2020 against Ireland, where he scored a half-century in just his second match. However, with England’s top order stacked with experienced players, Banton found it difficult to cement a regular spot. Despite this, he remained on the selectors’ radar, particularly in T20Is, where his fearless batting style is suited to modern white-ball cricket. His ability to bat anywhere in the top order and provide wicketkeeping cover adds to his value in England’s limited-overs setup. Banton has also showcased his skills in different T20 leagues worldwide. He has featured in Australia’s Big Bash League (BBL) for Brisbane Heat, where he entertained fans with his aggressive starts. He has also played in the Pakistan Super League (PSL) for Peshawar Zalmi and had stints in the Abu Dhabi T10 and The Hundred, representing Welsh Fire. However, he had a stellar season playing for MI Emirates in the 2025 International League T20, smashing 493 runs in 11 matches. This once again put him on the radar for national selection. An injury to Jacob Bethell meant he was called up for the England ODI squad for the Indian tour in 2025, and later he was also named in the 2025 Champions Trophy squad as well.",
  "nationality": "England",
  "career_span": {
    "Test": "",
    "ODI": "2020-2025",
    "IPL": "2020-2020"
  }
}