{
  "id": "pprofile_63751",
  "type": "player_bio",
  "player": "Hardik Pandya",
  "full_name": "Hardik Himanshu Pandya",
  "dob": "October 11, 1993",
  "role": "All-Rounder",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm medium fast",
  "teams": [
    "India",
    "ICC World XI",
    "India A",
    "Mumbai Indians",
    "Baroda",
    "Gujarat Titans"
  ],
  "bio": "Hardik Pandya is the perfect modern-day cricketer. He can strike the ball big, roll his arm over decently, and is a livewire in the field. It is a combination of skills India has long waited for since the retirement of Kapil Dev. Irfan Pathan gave them hope for a while but then lost his mojo and soon disappeared into the wilderness. It was in January 2016 that things turned around for Hardik Pandya. He was the leading run-getter in the Syed Mushtaq Ali Trophy, a domestic T20 tournament, finishing with 377 runs in 10 innings at an average of 53.85 while maintaining a strike rate of 130.90. He also took 10 wickets and was instrumental in Baroda reaching the finals. His effective all-round show impressed Mumbai and they bought him in the 2015 edition of the Indian Premier League. He hit a 31-ball 61 for Mumbai against Kolkata in his first season to catch the attention of everyone. With the ability to strike big and bowl quick, he was so impressive that the then-coach, Ricky Ponting could not stop praising him. After a stellar performance, Pandya was picked for India's tour to Australia in 2015 for the T20Is. He started with a 19-run over on his international debut but came back strongly to almost take a hat-trick. He has had a love for the big stage, in the 2016 World T20, he helped India clinch a win from the jaws of defeat when Bangladesh needed two runs off three balls. It is how cruel the sport is at times that it takes you high enough only to make you vulnerable for a big fall. It was off his bowling that Lendl Simmons was dismissed off a no-ball and the West Indian went on to play an unbeaten inning to knock India out in the semi-final. Also, not to forget his heroics in the 2017 Champions Trophy final against Pakistan where he struck a 43-ball 76 and gave a real scare to the arch-rivals. His exploits in the limited-overs handed him a Test cap for India's tour of Sri Lanka in 2017. With his captain's and management's backing, the Indian selectors picked him for the England tour as well. In 2019, Hardik had a bumpy ride as he got into controversies, resulting in him getting sent back home from Australia in the middle of the series. After facing a lot of heat due to his derogatory comments on a reality TV show, Hardik made his comeback focused and with a point to prove. The dynamic all-rounder showed irresistible form in the 2019 season of the Indian Premier League and was one of the main reasons for Mumbai's 4th title. With his consistent all-round performance, Pandya cemented his place in the 15-man World Cup squad of India and had a decent outing. Hardik Pandya has had his fair share of issues with injuries which kept him out of the national team for quite some time. He, though, returned fitter and stronger and once again proved his mettle as an all-rounder during the 2022 Indian Premier League. Released by Mumbai before the auction, Hardik was bought by Gujarat and given captaincy. The talented cricketer showcased brilliant leadership qualities and led Gujarat to the title in their first attempt. Pandya’s stellar 2022 continued as he was named the white-ball captain for the national side in the absence of Rohit Sharma and had a fair bit of success in bilateral series, especially at home. Coming into 2023, Pandya had re-established himself as India’s top white-ball all-rounder and had another productive outing as the captain of the Gujarat franchise in the Indian Premier League, helping them reach consecutive finals. Gujarat did come up short against Chennai in the final but Pandya sealed his place in the 2023 ODI World Cup. Leading into the big tournament, Pandya was classed as one of the key assets for India but a few games into the tournament, he suffered an ankle injury while bowling and was sidelined for the remainder of the tournament. India did reach the final of the World Cup but came up short against Australia. Since the World Cup, the focus shifted back to the 2024 Indian Premier League, and in a surprising move, Pandya was traded back to the Mumbai franchise, a team that gave him the platform and a team with whom he had won it all and he was eventually appointed as the leader of the side, replacing Rohit Sharma. Mumbai was able to complete the move by trading Aussie talent Cameron Green to Bengaluru. Given Rohit's immense success as the leader of the Mumbai franchise, the decision to appoint Hardik as captain did not sit well with some fans. Their displeasure was evident during Mumbai’s home games, and it turned out to be a forgettable season for the team as they finished at the bottom of the standings with just four wins from 14 games. However, in a matter of months, Hardik managed to turn the boos into cheers with his final-over heroics in the 2024 T20 World Cup final against South Africa. With the Proteas needing 16 runs off the last over, Hardik held his nerve to close out the game, sealing India's long-awaited ICC title and cementing his place in history.",
  "nationality": "India",
  "career_span": {
    "Test": "2017-2018",
    "ODI": "2016-2025",
    "IPL": "2015-2025"
  }
}