{
  "id": "pprofile_67516",
  "type": "player_bio",
  "player": "Azmatullah Omarzai",
  "full_name": "Azmatullah Omarzai",
  "dob": "March 24, 2000",
  "role": "All-Rounder",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm medium fast",
  "teams": [
    "Punjab Kings",
    "Afghanistan Under-19",
    "Afghanistan",
    "Rangpur Riders",
    "Barbados Royals",
    "Dhaka Capitals",
    "Peshawar Zalmi",
    "Afghanistan Emerging",
    "Speen Ghar Region",
    "Mis-e-Ainak Region",
    "Amo Region",
    "Amo Sharks",
    "Band-e-Amir Dragons",
    "Kabul Eagles",
    "Montreal Tigers",
    "Paktia Panthers",
    "Northern Warriors",
    "Lalitpur Patriots",
    "Qalandars",
    "Jaffna Kings",
    "Gujarat Titans",
    "Maiwand Defenders",
    "MI Cape Town",
    "Gulf Giants",
    "Kathmandu Knights",
    "MI New York",
    "Durban Wolves",
    "Antigua & Barbuda Falcons"
  ],
  "bio": "Azmatullah Omarzai is an exciting prospect for Afghanistan. Azmatullah is from Nurgal District of Kunar province in the eastern part of Afghanistan. In August 2017, he participated in the 2017 Ghazi Amanullah Khan Regional One-Day Tournament and made his List A debut for Mis Ainak Region. Omarzai's journey started off with his batting and bowling prowess, which impressed local selectors. As he advanced through the domestic cricket leagues, he showed his capacity to score large runs and claim vital wickets. He was selected for Afghanistan's squad for the 2018 Under-19 Cricket World Cup thanks to his persistent work ethic. He was included in Paktia's squad for the inaugural Afghanistan Premier League competition in September 2018. On October 7, 2018, he made his Twenty20 league debut for Paktia Panthers in the 2018–19 Afghanistan Premier League. He shared first place in the 2020 Shpageeza Cricket League's Player of the Tournament award in September 2020. He competed in the 2018 ACC Emerging Teams Asia Cup with Afghanistan's under-23 squad. He was included in Afghanistan's squad for the ACC Emerging Teams Asia Cup in Bangladesh in November 2019. He was included in the Afghanistan Twenty20 International (T20I) squad for their series against Ireland in February 2020. The year 2021 proved to be a pivotal moment in Omarzai's career. He made his international debut in both the ODI and T20I formats, quickly establishing himself with his fearless batting and precise bowling. His standout performances in the 2021 T20 World Cup, where he scored 62 runs and took 4 wickets, firmly positioned him as an emerging talent. Omarzai was named to Afghanistan's ODI squad for their series against Ireland in January 2021, where he made his debut in that format. In March 2021, the Afghanistan Cricket Board announced that he would be selected for the T20I series against Zimbabwe, once his visa issues were resolved. He was eventually included in Afghanistan's T20I squad for their series against Bangladesh in February 2022. In 2023, Azmatullah Omarzai was called up by the national team for the World Cup 2023. He had a pretty decent campaign as he scored 353 runs in nine innings in the 2023 World Cup while picking up seven wickets. In the ICC ODI World Cup match between Afghanistan and South Africa at the Narendra Modi Stadium in Ahmedabad, all-rounder Azmatullah Omarzai scored the greatest amount of runs by an Afghanistan batsman ranked number five. The 23-year-old young man finished the inning at 97 runs not out and helped his nation to post a total of 244 runs on board. But unfortunately, the result didn’t end up on their side. Just after the World Cup campaign because of his effective efforts in the World Cup, he was called by Peshawar Zalmi in Pakistan Super League and Rangpur Riders in Bangladesh Premier League. He was also bagged by the runner-up team of the Indian T20 League 2022, Gujarat. Gujarat spent INR 50 Lakhs on him and for the 2024 season. In January 2024, Omarzai played a remarkable innings against Sri Lanka. Coming in with Afghanistan struggling at 19 for 3 in pursuit of 383, and then 55 for 5, he built an incredible 242-run partnership with Mohammad Nabi. Omarzai finished unbeaten on 149, almost guiding Afghanistan to a miraculous chase. Omarzai's efforts were also crucial in helping Afghanistan reach their first-ever T20 World Cup semi-final in 2024. As Omarzai's reputation continued to grow, he was snapped up by the Punjab franchise during the mega auction for the 2025 edition of the Indian T20 League, securing a staggering INR 2.4 crore contract.",
  "nationality": "Afghanistan",
  "career_span": {
    "Test": "2024-2024",
    "ODI": "2021-2025",
    "IPL": "2024-2025"
  }
}