{
  "id": "pprofile_71152",
  "type": "player_bio",
  "player": "Rajvardhan Hangargekar",
  "full_name": "Rajvardhan S Hangargekar",
  "dob": "November 10, 2002",
  "role": "All Rounder",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm fast medium",
  "teams": [
    "India A",
    "West Zone",
    "Chennai Super Kings",
    "India Under-19",
    "Maharashtra",
    "India A Under-19",
    "India C Under-19",
    "Maharashtra U-19",
    "Lucknow Super Giants",
    "Jain Irrigation",
    "Chhatrapati Sambhaji Kings",
    "Satara Warriors"
  ],
  "bio": "Rajvardhan Hangargekar is a promising young cricketer from India known for his fierce right-arm pace bowling, effortlessly clocking speeds of up to 145 km/h. Born on November 24, 2002, in Tuljapur, Maharashtra, Hangargekar has already showcased remarkable performances in domestic cricket. He made his Twenty20 debut on January 16, 2021, representing Maharashtra in the 2020–21 Syed Mushtaq Ali Trophy. His standout performance in the T20 format earned him a spot in Maharashtra's List A squad for the 2020–21 Vijay Hazare Trophy. With more than 50 wickets in the domestic circuit, Hangargekar continues to impress selectors and cricket enthusiasts alike. Despite a lukewarm outing in the ICC Under-19 Cricket World Cup 2022 in the West Indies, where he managed to secure just 5 wickets, his consistent performances earned him a spot in the Indian Premier League auction for the 2022 season. During the auction, a dramatic bidding war unfolded between Mumbai and Chennai, with Hangargekar eventually being picked by Chennai for a staggering INR 1.5 crores, surpassing his base price of INR 30 lakhs. Although his playing opportunities were limited, he displayed his ability to generate pace and benefited from sharing the dressing room with cricketing greats like MS Dhoni, making it a valuable learning experience for the young cricketer. On July 19, 2023, in the 2023 ACC Emerging Teams Asia Cup, Rajvardhan Hangargekar delivered a sensational performance against Pakistan A, claiming five wickets for just 42 runs. His brilliant spell played a pivotal role in India A’s commanding victory, showcasing his immense potential on the big stage. Ahead of the 2025 IPL season, Lucknow Super Giants secured Hangargekar for 30 lakh rupees in the mega auction.",
  "nationality": "India",
  "career_span": {
    "IPL": "2023"
  }
}