{
  "id": "pprofile_3852",
  "type": "player_bio",
  "player": "Rohit Sharma",
  "full_name": "Rohit Gurunath Sharma",
  "dob": "April 30, 1987",
  "role": "Batsman",
  "batting_style": "Right Handed",
  "bowling_style": "Off break",
  "teams": [
    "India",
    "India A",
    "India Blue",
    "Indian Board Presidents XI",
    "India Green",
    "India Red",
    "West Zone",
    "Mumbai Indians",
    "Deccan Chargers",
    "India Under-19",
    "Mumbai",
    "Sunrisers Hyderabad",
    "ARCS Andheri",
    "Indians"
  ],
  "bio": "Rohit Sharma, famously known as 'Hit-Man', has earned his nickname for his effortless ability to clear the boundary with ease. Renowned not only in India but globally, he is regarded as one of the finest cricketers of his generation. A stylish and elegant batter, Sharma is particularly known for his awe-inspiring pull shots, so much so that it is often said no one plays the shot better than he does. Born in Nagpur, Maharashtra, Rohit was raised by his grandparents in Mumbai, where he first discovered his love for cricket in a summer camp. It was here that he caught the attention of his coach, Dinesh Lad, who saw his potential and encouraged him to transfer to a school with better sporting facilities, where Lad himself was the coach. Initially an off-spinner, Rohit’s batting prowess soon became apparent, leading to a promotion to open the batting. He quickly began to dominate school competitions, smashing centuries with ease. His List-A debut came in 2006 in the Deodhar Trophy, where he impressed with an unbeaten 142 against North Zone, marking his entry into the spotlight. Later that year, he made his first-class debut for India A against New Zealand A and continued to shine. By the same year, he was representing Mumbai in the prestigious Ranji Trophy, becoming an integral part of their squad. Rohit’s international career began at a young age. Just a year after his domestic debut, he made his ODI debut for India against Ireland in 2007, followed by his T20I debut in the inaugural ICC T20 World Cup the same year. Called up as a replacement for the injured Yuvraj Singh, he made the most of his opportunity, scoring a half-century against top-tier bowlers like Makhaya Ntini, Shaun Pollock, and Morne Morkel, announcing his arrival on the world stage. Despite his promising start, Rohit’s early years in international cricket were marred by inconsistency. A series of low scores led to his omission from the squad, and he was also left out of India’s World Cup squad in 2011. However, his standout performances in the Indian Premier League that year earned him a recall to the ODI squad for the series against the West Indies. Though he impressed in parts, it wasn’t until MS Dhoni made the game-changing decision to promote him to open the batting that Rohit’s fortunes truly turned. This move solved India’s long-standing opening woes and proved to be a masterstroke by Dhoni. Rohit formed a lethal opening partnership with Shikhar Dhawan, and together, they dominated the white-ball cricket. His breakthrough came during the 2013 ICC Champions Trophy, where he played a crucial role in helping India win the tournament, cementing his place as a top-order star in India’s white-ball team. Rohit was part of India’s World Cup squads in 2015 and 2019, with the 2019 World Cup being a standout for him. Scoring a record five centuries in the tournament, he finished as the leading run-scorer and solidified his legacy as one of the best ODI batters of all time. Rohit also became the first player to score multiple double centuries in ODI cricket, a feat that further exemplified his unparalleled abilities in the 50-over format. In Test cricket, Rohit made his debut in 2013 against the West Indies in Kolkata, where he scored an elegant 177, a performance that remains one of the highlights of his career. However, after his strong debut, his form in Tests was inconsistent, and he was in and out of the squad. His performances outside the subcontinent were a particular concern, but all this changed as soon as he solidified his place as one of India’s most dependable openers in Test cricket. After Virat Kohli’s tenure as captain, Rohit was appointed as the captain of India across all formats. His leadership saw remarkable success, including leading India to their 14th consecutive T20I victory in July 2022, and becoming the first captain in history to achieve such a feat. Furthermore, with his participation in the 2022 ICC T20 World Cup, Rohit became the only Indian cricketer to have played in every edition of the tournament since its inception in 2007. Rohit’s IPL journey began in 2008 when he was signed by the now-defunct Deccan team. In 2011, he was bought by Mumbai, where he became a key figure in the squad. Under his leadership, Mumbai won the IPL in 2013, 2015, 2017, 2019, and 2020, also lifting the Champions League T20 trophy in 2013. As one of the leading run-scorers in the IPL, Rohit cemented his place as one of the tournament’s greats. However, for the 2024 season, Rohit was replaced as Mumbai's captain by Hardik Pandya. Rohit Sharma’s performances in ICC tournaments have been nothing short of extraordinary. As captain, he led India to their second ICC T20 World Cup title in 2024, further enhancing his status as one of the game's greats. During the tournament, he became the first batter to hit 200 sixes in T20Is, proving his reputation as 'Hit-Man'. Following his triumph, Rohit announced his retirement from T20I cricket, leaving behind a remarkable legacy as India's most successful T20I captain, with 49 victories to his name. A lean period followed for Rohit, particularly in the red-ball format, after the high of the T20 World Cup triumph. The struggles culminated in a historic Test series whitewash at home against New Zealand, marking the first time India had suffered such a fate on home soil. His own batting slump coincided with the team's poor results, and critics questioned whether it was affecting his leadership. The challenges continued as India travelled to Australia for the Border-Gavaskar Trophy, where they lost 1-3, allowing Australia to reclaim the trophy. However, Rohit rediscovered his form when white-ball cricket resumed. In a home series against England, he scored a commanding century, signalling a return to his fluent best in the format he has dominated for years. His resurgence carried over into the 2025 Champions Trophy, where he played a pivotal role in India’s campaign. In the final against New Zealand, Rohit delivered a match-winning performance, top-scoring for his side to secure another ICC trophy - India’s second in just nine months. His contribution earned him the Man of the Match award, reaffirming his status as one of the greatest white-ball players of his generation.",
  "nationality": "India",
  "career_span": {
    "Test": "2013-2024",
    "ODI": "2007-2025",
    "IPL": "2008-2025"
  }
}