{
  "id": "pprofile_67443",
  "type": "player_bio",
  "player": "Gerald Coetzee",
  "full_name": "Gerald William Coetzee",
  "dob": "October 2, 2000",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm fast",
  "teams": [
    "South Africa",
    "Free State",
    "South Africa A",
    "Titans",
    "Rajasthan Royals",
    "Mumbai Indians",
    "South Africa Under-19",
    "Knights",
    "Jozi Stars",
    "Gujarat Titans",
    "Joburg Super Kings",
    "Seattle Orcas",
    "Texas Super Kings"
  ],
  "bio": "Gerald Coetzee is a towering figure on the field, standing at an imposing 6'3\", with a long, athletic frame that complements his fearsome pace. His lanky build, combined with the ability to regularly hit speeds of 145 kph, makes him a formidable presence. His aggressive bowling style has drawn comparisons to one of South Africa’s greatest fast bowlers, Dale Steyn, solidifying Coetzee as a rising star in world cricket. Coetzee made his List A debut for Free State in the 2018–19 CSA Provincial One-Day Challenge on 14 October 2018. He made his Twenty20 debut for Knights in the 2018–19 CSA T20 Challenge on 12 April 2019. He made his first-class debut for Knights in the 2019–20 CSA 4-Day Franchise Series on 7 October 2019. In December 2019, he was named in South Africa's squad for the 2020 Under-19 Cricket World Cup. In April 2021, he was named in Free State's squad, ahead of the 2021–22 cricket season in South Africa. On 1 May 2021, he was signed by the Rajasthan team as a replacement for Liam Livingstone, during the 2021 Indian Premier League. In June 2023, Coetzee was added to the Texas Super Kings roster for the inaugural season of Major League Cricket in the USA. In June 2022, Coetzee was named in South Africa's T20I squad for their tour of England to play the England and Ireland cricket teams. In February 2023, he was selected in the South Africa Test squad for the series against West Indies. He made his Test debut against West Indies on 28 February 2023. In March 2023, he was named in South Africa's ODI squad for their series against West Indies. He made his ODI debut in the second ODI of the series on 18 March 2023 in East London, when he took three wickets. Following his standout domestic cricket performances, Coetzee earned a spot in the 2023 World Cup, where he made an indelible mark by taking an impressive 20 wickets, becoming South Africa’s leading wicket-taker in a single World Cup edition. His exceptional showing also secured him a place in the 2024 T20 World Cup, where he claimed 12 wickets, including his best figures of the tournament, reading 3/32 against India. In the same year, Coetzee made his IPL debut with the Mumbai Indians, picking up 13 wickets in 10 matches. Additionally, he became a key player for the Joburg Super Kings in South Africa’s SA20 League, where he continues to be an integral part of the team, though an injury kept him sidelined for the 2025 season. After recovering from his injury, Coetzee found a new opportunity in the IPL 2025 auction, where the Gujarat Titans snapped him up for a staggering INR 2.4 crores, further strengthening their pace attack. His inclusion in the team added another layer of firepower to an already formidable bowling lineup, marking an exciting new chapter in his IPL journey.",
  "nationality": "South Africa",
  "career_span": {
    "Test": "2023-2024",
    "ODI": "2023-2023",
    "IPL": "2024-2025"
  }
}