{
  "id": "pprofile_67905",
  "type": "player_bio",
  "player": "Arshdeep Singh",
  "full_name": "Arshdeep Singh",
  "dob": "February 5, 1999",
  "role": "Bowler",
  "batting_style": "Left Handed",
  "bowling_style": "Left-arm medium fast",
  "teams": [
    "India",
    "India A",
    "India Emerging",
    "Kent",
    "North Zone",
    "Punjab Kings",
    "India Under-19",
    "Punjab",
    "India Under-23",
    "DY Patil Group A",
    "India D"
  ],
  "bio": "India has always been on the hunt for a quality left-arm seam bowler, with their past successes heavily dependent on some fast-bowling southpaws who wore the Indian colours. With India’s fast bowling stock rising, Arshdeep Singh has emerged as one of the most exciting prospects with the ability to swing the ball early in the inning as well as bowl precise yorkers towards the tail end of the game. Born on 5th February 1999 in Guna in Madhya Pradesh, Arshdeep moved to Chandigarh with his family and began playing at Jaswant Rai’s cricket academy in 2015. He soon found himself picked in the U19 squad for the 2018 U19 Cricket World Cup, where he played just two games in his team’s title run but showed enough ability to pique the interest of the domestic selectors. He was picked for the Punjab U23 team a few months after the World Cup, and he justified the faith shown in him by picking 8 wickets against Rajasthan in the CK Nayudu Trophy, which included a hat-trick. This prompted his selection into the senior side, and towards the end of the year, he made his List A debut against Himachal Pradesh in the Vijay Hazare Trophy, claiming 2 wickets in his first outing. He was scouted by the Mumbai and Punjab franchises, and eventually the latter picked him up in the auction to play in the 2019 Indian Premier League. He made his T20 debut against the Rajasthan franchise, and though he was slightly expensive, he took two crucial scalps in his team's win. Towards the end of 2019, he made his first-class debut against Vidarbha in the Ranji Trophy and once again exhibited his ability to swing the ball both ways as he took three wickets. He was in his element in the shortest format as he continued to impress everyone with his accurate yorkers and slower deliveries to become a death-over specialist. After an impressive showing in the 2021 Indian Premier League, where he picked up 18 wickets in 12 games for the Punjab side, Arshdeep found himself on the fringes of the national squad, and it was a year later, in 2022, that he got his opportunity to make his T20I debut against England. He showed no nerves as he started his international career with a maiden and ended up with two wickets at an economy rate of 5.14. He continued his good form in the following series against West Indies as he claimed 7 wickets in 5 games and was adjudged the Player of the Series. His impressive showing in the previous edition prompted Punjab to retain him in the mega auction for the 2022 season for INR 4 crore. His rapid rise saw him included in the T20 squad for the Asia Cup as well as the 2022 ICC Men’s T20 World Cup. He was the leading wicket-taker for India in the mega event, claiming 10 wickets in six games, and later that year made his ODI debut against New Zealand but went wicketless in that game. He was retained by Punjab for the 2023 Indian Premier League season and did not disappoint, forming a formidable duo with Kagiso Rabada. With Mohammed Shami absent, Arshdeep emerged as Jasprit Bumrah's new-ball partner at the 2024 T20 World Cup. In India's title-winning campaign, he finished as their leading wicket-taker with 17 scalps. His penultimate over in the final against South Africa, where he conceded just four runs under immense pressure, proved to be a defining moment in India's triumph. It came as a surprise to many that, despite his promise, Arshdeep was released by Punjab following the 2024 season. However, Punjab brought him back for the 2025 season using the Right to Match card. For his sensational performances in 2024, Arshdeep was the recipient of the ICC T20I Player of the Year award. With his ability to make the new ball talk, excel at the death, and provide a valuable left-arm option, he earned a spot in India's squad for the 2025 Champions Trophy.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "2022-2025",
    "IPL": "2019-2025"
  }
}