{
  "id": "pprofile_68003",
  "type": "player_bio",
  "player": "Aryan Juyal",
  "full_name": "Aryan Juyal",
  "dob": "November 11, 2001",
  "role": "Wicket-Keeper",
  "batting_style": "Right Handed",
  "bowling_style": "-",
  "teams": [
    "Central Zone",
    "India Emerging",
    "Mumbai Indians",
    "India Under-19",
    "Uttar Pradesh",
    "India Under-23",
    "India C",
    "Lucknow Super Giants",
    "Gaur Gorakhpur Lions"
  ],
  "bio": "Aryan Juyal, a promising young talent from India, has been making waves in the domestic cricket circuit with his exceptional wicket-keeping skills and solid batting performances. Born on 11 November 2001, Juyal has quickly risen through the ranks, showcasing his potential as a future star for Indian cricket. As a right-handed batter and a proficient wicket-keeper, he has been a vital asset for his teams, particularly in the domestic formats. Juyal's journey began with the India Under-19 team, where he made his Youth Test debut against Sri Lanka Under-19 in 2018. His performance in the Youth ODIs was notable, with a batting average of over 30 and a highest score of 60 against Sri Lanka Under-19. In the domestic circuit, Juyal has been a consistent performer for Uttar Pradesh, including seven centuries and six fifties. His highest score of 201 against Assam in the Ranji Trophy 2024 further highlights his batting prowess. In the shorter formats, Juyal has been equally effective. In List A cricket, he has maintained an average of above 45 with four centuries and nine fifties. His highest List A score of 159 came against Maharashtra in the Vijay Hazare Trophy 2022. Juyal's performances in the Ranji Trophy 2024/25 have been exceptional, with scores of 200 against Bihar and 138 against Madhya Pradesh, showcasing his ability to play long innings and anchor the team's batting. His consistent performances have made him a key player for Uttar Pradesh, and his contributions have been crucial in their domestic campaigns. As Aryan Juyal continues to develop his skills, the cricketing fraternity eagerly anticipates his transition to the international stage. With his talent and determination, Juyal is poised to become a significant figure in Indian cricket, potentially following in the footsteps of legendary Indian wicket-keepers.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "",
    "IPL": ""
  }
}