{
  "id": "pprofile_63641",
  "type": "player_bio",
  "player": "Anrich Nortje",
  "full_name": "Anrich Arno Nortje",
  "dob": "November 16, 1993",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm fast",
  "teams": [
    "South Africa",
    "Eastern Province",
    "South Africa A",
    "Kolkata Knight Riders",
    "Delhi Capitals",
    "Warriors",
    "Saint Lucia Kings",
    "St Kitts and Nevis Patriots",
    "Cape Town Blitz",
    "Deccan Gladiators",
    "Quinny’s Kites",
    "Morrisville Samp Army",
    "Pretoria Capitals",
    "Los Angeles Knight Riders",
    "MI New York",
    "Washington Freedom"
  ],
  "bio": "Anrich Arno Nortje, born on November 16, 1993, is a dynamic South African cricketer known for his prowess as a fast bowler. With his ability to generate raw pace and extract bounce from the pitch, Nortje has established himself as a valuable asset for both his domestic teams and the South African national side. His journey from the domestic circuit to the international arena is a testament to his talent, dedication, and hard work, earning him recognition as one of the premier fast bowlers in contemporary cricket. Anrich Nortje's cricketing journey began in the domestic circuit, where he honed his skills and showcased his potential as a fast bowler. He made significant strides in his career, representing Eastern Province in various domestic tournaments. Notably, he was included in Eastern Province's squad for the 2016 Africa T20 Cup, marking his first step towards professional cricket. In October 2018, Nortje's talent caught the attention of selectors when he was named in Cape Town Blitz's squad for the inaugural edition of the Mzansi Super League T20 tournament. Despite facing setbacks due to injuries, Nortje continued to impress with his pace and accuracy, solidifying his reputation as a rising star in South African cricket. Nortje's journey in T20 franchise cricket has been marked by his stints with various teams, both in domestic leagues and international tournaments. He made his presence felt in the Indian Premier League, representing Kolkata Camp in the 2019 edition of the tournament. However, his campaign was cut short due to a shoulder injury, hampering his progress in the lucrative T20 competition. In subsequent years, Nortje's fortunes in T20 cricket improved as he found success with different franchises. He was named in the squad for the Cape Town Blitz team for the 2019 Mzansi Super League tournament, showcasing his skills on the domestic circuit. Additionally, he joined the St Lucia Zouks squad for the 2020 Caribbean Premier League, highlighting his growing stature as a T20 specialist. One of the defining moments of Nortje's T20 career came during his stint with the Delhi franchise in the 2020 Indian Premier League. In a memorable match against Rajasthan, Nortje bowled the fastest delivery in the history of the tournament, clocking an astonishing speed of 156.22 km/h (97 mph). This feat solidified his reputation as one of the fastest bowlers in the T20 format, earning him widespread acclaim from fans and pundits alike. Anrich Nortje's international debut for South Africa marked the beginning of a promising career at the highest level of the game. He made his ODI debut against Sri Lanka in March 2019, showcasing his ability to deliver consistent performances under pressure. Despite facing injury setbacks early in his international career, Nortje's talent and determination shone through, earning him a spot in South Africa's squad for the 2019 Cricket World Cup. Although Nortje was ruled out of the 2019 Cricket World Cup due to a hand injury, he continued to make significant contributions to the national team across formats. He made his Test debut against India in October 2019, followed by his T20I debut against the same opposition later that month. Nortje's performances in Test cricket were particularly noteworthy, as he displayed his ability to trouble batters with his pace and bounce. In January 2020, Nortje achieved a major milestone in his Test career by taking his maiden five-wicket haul against England, further establishing himself as a key asset for South Africa in the longest format of the game. His consistent performances earned him a national contract with Cricket South Africa, reaffirming his status as a vital cog in the national team setup. Despite his talent and potential, Nortje's career has been marred by injuries at crucial junctures. He was ruled out of several tournaments and series due to shoulder and hand injuries, including the 2019 Cricket World Cup and various T20 leagues. However, Nortje's resilience and determination have been instrumental in his comeback from setbacks, as he continues to strive for excellence on the cricketing field. Nortje was named in the South Africa squad for the 2021 T20 World Cup and then in the 2023 ODI World Cup too but was later ruled out due to an injury. In the 2024 T20 World Cup, he played a key role in Proteas' run to the final where they faced a heartbreaking defeat against India. After, that he struggled with a few injuries and was ruled out of the Champions Trophy 2025, but in the middle of all this, he managed to get a place in the Kolkata team for the 2025 IPL. Anrich Arno Nortje's journey in cricket is a testament to his resilience, talent, and determination to succeed at the highest level. From humble beginnings in domestic cricket to representing South Africa on the international stage, Nortje has overcome numerous obstacles to establish himself as one of the premier fast bowlers in contemporary cricket. As he continues to evolve and grow as a cricketer, Nortje remains a key figure in South African cricket, inspiring aspiring cricketers and leaving a lasting legacy in the sport.",
  "nationality": "South Africa",
  "career_span": {
    "Test": "2019-2023",
    "ODI": "2019-2023",
    "IPL": "2020-2025"
  }
}