{
  "id": "pprofile_88873",
  "type": "player_bio",
  "player": "Nishant Sindhu",
  "full_name": "Nishant Sunil Kumar Sindhu",
  "dob": "April 9, 2004",
  "role": "All Rounder",
  "batting_style": "Left Handed",
  "bowling_style": "Slow left-arm orthodox",
  "teams": [
    "India A",
    "North Zone",
    "Chennai Super Kings",
    "India Under-19",
    "Haryana",
    "India A Under-19",
    "Haryana U-19",
    "India F Under-19",
    "Gujarat Titans",
    "India D"
  ],
  "bio": "Nishant Sindhu, born on April 9, 2004, is an Indian cricketer known for his batting prowess, having represented India in the Under-19 World Cup 2022. Hailing from Rohtak, Haryana, he is the son of Sunil Kumar, a former state-level boxer. Despite his father's background, Nishant opted for cricket, influenced by India's victory in the 2011 World Cup and inspired by MS Dhoni. He began his cricket journey at the Shri Ram Narain Cricket Academy under the guidance of Ashwani Kumar, a former Haryana first-class cricketer and coach. Nishant gained attention after his outstanding performance in the U-14 Dhruv Pandove Trophy in 2017, where he scored 290 runs and took 24 wickets for Haryana. His consistent excellence earned him a spot in the Haryana U-16 team and later in the 2017-18 Vijay Merchant Trophy. The turning point came in the 2018-19 season when he amassed 572 runs and claimed 23 wickets, leading Haryana to victory over Jharkhand in the final under his captaincy. In 2021, Nishant Sindhu was selected for the India U-19A Squad, featuring in the triangular series and the Under-19 Asia Cup, eventually earning a spot in the ICC Under-19 World Cup 2022 squad. He also captained the Indian team against Uganda and Ireland due to Yash Dhull's COVID-19 positive test. His crucial 50 against England in the World Cup final showcased his potential. Following his impressive performances in the junior circuit, the Chennai franchise acquired him for 60 Lakhs in the 2023 Auction of the Indian Premier League. Sharing the dressing room with veterans like MS Dhoni promises invaluable experience and learning opportunities for this talented youngster. He continues to impress domestic cricket and has around 1500 runs behind his name in the First Class and List A cricket combined. Also, he has picked up around 55 wickets, which makes him a pivotal left-handed all-rounder option for any team he represents in franchise cricket. His all-round performance caught the attention of Gujarat Titans, who were quick to secure him in the TATA IPL 2025 Auction.",
  "nationality": "India",
  "career_span": {}
}