{
  "id": "pprofile_63865",
  "type": "player_bio",
  "player": "Kyle Jamieson",
  "full_name": "Kyle Alex Jamieson",
  "dob": "December 30, 1994",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm fast medium",
  "teams": [
    "New Zealand",
    "Auckland Aces",
    "Canterbury",
    "New Zealand A",
    "Surrey",
    "Royal Challengers Bengaluru",
    "Punjab Kings",
    "Chennai Super Kings",
    "New Zealand Under-19",
    "New Zealand XI",
    "Quetta Gladiators",
    "New Zealanders"
  ],
  "bio": "Hailing from Auckland, Kyle Jamieson is one of those towering fast bowlers who can be truly intimidating for batters at the top of their mark. Given his height, one would naturally associate him with pace bowling, but interestingly, he began his cricketing journey as a batting all-rounder. Adding to his intriguing background, Jamieson also played basketball, a choice unsurprising given his stature. However, he eventually decided to pursue cricket as his professional career. Jamieson first caught the eye during the 2014 Under-19 World Cup, where New Zealand had a disappointing campaign, finishing with a loss to Bangladesh in the Plate Final. Despite the team’s struggles, Jamieson emerged as a bright spot, taking 7 wickets in 4 games. Upon his return, he made his List A debut for Canterbury instead of Auckland, his city of birth. A few months later, he got his first taste of first-class cricket with Canterbury. However, it wasn’t until 2019 that he made headlines, producing extraordinary figures of 6 for 7 in a Super Smash game. The New Zealand selectors took notice of Jamieson's exceptional performances and called him up for the home ODI and subsequent Test series against the visiting Indian side, where he made his debut in both formats. Later that year, he earned his T20I cap as well. Jamieson played a pivotal role in New Zealand’s journey to the inaugural World Test Championship final. On the grandest stage of the final, he delivered a Man-of-the-Match performance against India, claiming a crucial five-wicket haul in the first innings and setting the tone for New Zealand's historic victory as the inaugural WTC champions. It was clear that New Zealand viewed Jamieson primarily as a Test format bowler, and he consistently delivered on that front. After a stint with Canterbury, the right-arm quick made the switch to Auckland, only to return to Canterbury ahead of the 2023 season. Unfortunately, injuries kept him sidelined for much of 2023, and he made his return late in the year. However, disaster struck when he played his first Test of 2024 in February. Jamieson experienced soreness, and subsequent scans revealed a stress fracture in his back, not the same one he had undergone surgery for in 2023, but a new injury that kept him out of action for the remainder of 2024. Jamieson's return to cricket came with the 2024-25 Super Smash, where the fast bowler wasted no time in finding his rhythm. With 14 wickets from 12 games, he was instrumental in leading Canterbury to the final. Despite the injury layoff, Jamieson’s performance was a clear indication that he was back to his best. The Kiwi selectors initially did not include Jamieson for the Champions Trophy and the tri-series leading up to it, as he was still making his way back from injury. However, as fate would have it, Lockie Ferguson was ruled out due to a foot injury just before the tournament. Jamieson's form could not have been overlooked, and as one man’s loss became another’s gain, he was called up as Ferguson’s replacement for the Champions Trophy.",
  "nationality": "New Zealand",
  "career_span": {
    "Test": "2020-2024",
    "ODI": "2020-2025",
    "IPL": "2021-2025"
  }
}