{
  "id": "pprofile_60173",
  "type": "player_bio",
  "player": "Srikar Bharat",
  "full_name": "Kona Srikar Bharat",
  "dob": "October 3, 1993",
  "role": "Wicket-Keeper",
  "batting_style": "Right Handed",
  "bowling_style": "-",
  "teams": [
    "India",
    "India A",
    "India B",
    "India Blue",
    "India Red",
    "Rest of India",
    "South Zone",
    "Royal Challengers Bengaluru",
    "Kolkata Knight Riders",
    "Delhi Capitals",
    "Andhra",
    "Indians",
    "Chargers XI",
    "Gujarat Titans",
    "Uttarandhra Lions",
    "Vizag Warriors",
    "India D",
    "Kakinada Kings"
  ],
  "bio": "KS Bharat, born on October 3rd, 1993, hails from Visakhapatnam, Andhra Pradesh. Initially, Bharat, a batter and wicketkeeper, found himself growing bored at summer camps until he tried on the keeping gloves for the first time. He went on to become the first Indian wicketkeeper to score a triple century in the Ranji Trophy, showcasing his batting prowess along with his wicketkeeping skills. Inspired by the composure of MS Dhoni on the field and impressed by the gentlemanly demeanor of his India-A coach, Rahul Dravid, Bharat developed a deep respect for both cricketing stalwarts. Despite never having kept wickets before the age of 19, Bharat seized the opportunity when his state team needed a batter who could also keep wickets. Bharat made his List-A debut against Tamil Nadu in February 2012, marking his introduction to the domestic circuit for the 2012–13 season. He later joined the T20 team after making his first-class debut the following year. Bharat's breakthrough moment came in the 2014–15 season when he scored 758 runs, including a career-high 308 off 311 balls against Goa. Although he was acquired by Delhi prior to the 2015 Indian Premier League, Bharat didn't get the chance to play any matches. Despite this setback, Bharat continued to excel in domestic cricket and earned call-ups to the Indian team as a replacement for Wriddhiman Saha and Rishabh Pant on multiple occasions. He made his Test debut against Australia in the Nagpur Test and has been part of the Indian squad for various series. In the Indian Premier League, Bharat was signed by Bengaluru in February 2021 but was later released by the franchise. He then played for Delhi in 2022 before being acquired by Gujarat in the subsequent year's auction. Kolkata secured Bharat's services in the 2024 Indian Premier League auction for INR 50 lakhs, adding depth to their wicketkeeping options for the upcoming season.",
  "nationality": "India",
  "career_span": {
    "Test": "2023-2024",
    "ODI": "",
    "IPL": "2021-2024"
  }
}