{
  "id": "pprofile_25422",
  "type": "player_bio",
  "player": "Sikandar Raza",
  "full_name": "Sikandar Raza Butt",
  "dob": "April 24, 1986",
  "role": "All-Rounder",
  "batting_style": "Right Handed",
  "bowling_style": "Off break",
  "teams": [
    "Zimbabwe",
    "Lahore Whites",
    "Mashonaland Eagles",
    "Matabeleland Tuskers",
    "Northamptonshire",
    "Northerns",
    "Southern Rocks",
    "Southerns",
    "Zimbabwe A",
    "Punjab Kings",
    "Chattogram Challengers",
    "Zimbabwe XI",
    "Rangpur Riders",
    "Saint Lucia Kings",
    "Trinbago Knight Riders",
    "Kalabagan Cricket Academy",
    "Sheikh Jamal Dhanmondi Club",
    "St Kitts and Nevis Patriots",
    "Karachi Kings",
    "Lahore Qalandars",
    "Peshawar Zalmi",
    "Gazi Group Cricketers",
    "Khulna Tigers",
    "Mis-e-Ainak Knights",
    "Shinepukur Cricket Club",
    "Toronto Nationals",
    "Montreal Tigers",
    "Paktia Panthers",
    "Tshwane Spartans",
    "Northern Warriors",
    "Biratnagar Warriors",
    "Amsterdam Knights",
    "Heat Stormers",
    "Manchester Originals",
    "Dambulla Sixers",
    "Chennai Brave Jaguars",
    "Takashinga 1",
    "Harare King Cricket Club",
    "Paarl Royals",
    "Dubai Capitals",
    "Sharjah Warriorz",
    "Biratnagar Super Kings",
    "Seattle Orcas",
    "Bulawayo Brave Jaguars",
    "Joburg Bangla Tigers",
    "New York Cowboys",
    "Caribbean Tigers",
    "Grand Cayman Jaguars",
    "Chicago CC"
  ],
  "bio": "Sikandar Raza Butt was born on 24th April 1986 in Sialkot in the Punjab region of Pakistan. He studied in an Air Force public school and aspired to become a pilot in the Pakistani Air Force. His dreams were cut short as he failed his vision test and soon after emigrated to Zimbabwe with his family in 2002. His potential for cricket came to the forefront when he went to Scotland to study at the Glasgow Caledonian University and started playing semi-professional cricket. This turn of fate resulted in him embarking on a journey as a talented cricketer. While he was still studying, he played some domestic cricket in Zimbabwe making his List A debut for the Northerns in 2007 playing in the Faithwear Clothing Inter-Provincial One Day Competition. He did not do well but soon after made his first-class debut against the Easterns in the Logan Cup. He played very few games till he completed his education in 2010 and had just one half-century under his belt until then. However, playing full-time cricket got the best out of Raza as he went on to plunder 625 runs at a healthy average of 41 in the 2010-11 domestic season. He got his chance to play the T20 format for Southern Rocks and made his debut in the 2010 Stanbic Bank T20 competition. Over the years he went on to represent several teams around the world in their T20 league competitions. Early in 2011, the selectors decided to include him in their plans and gave him an opportunity in a practice match against Bangladesh in place of Vusi Sibanda, who got injured. Raza made a strong case for himself with his performance and identifying his abilities, the selectors began making efforts to complete his citizenship process. He was included in the World Cup squad for the 2011 edition but he acquired his citizenship only later that year. It still took him two more years to eventually make his international debut against Bangladesh, beginning with the ODI format first and following it up with a debut in the T20 format on the same tour. He did not get off to the best of starts, but a half-century against a strong Indian lineup soon after showed that he had talent as well as potential. His Test debut came later that year against Pakistan, the country of his birth, and he played well to reach a half-century in his first outing. He was in and out of the team and the series against Bangladesh in 2014 cemented his place in the side as an opener. He got his maiden ODI century against Afghanistan in 2014 having played a remarkable inning of 141. He participated in the 2015 World Cup where he failed with the bat but his bowling ability became evident. That was the beginning of his journey as an all-rounder. In 2017, he orchestrated Zimbabwe’s first-ever five-match bilateral series win away from home against Sri Lanka as he claimed the Player of the Match award in the decider. He followed this performance with his maiden Test hundred on the same tour in a one-off Test match. Later that year, he picked up his maiden five-wicket haul in Test cricket against the West Indies. In the 2018 Cricket World Cup Qualifier tournament he was awarded the Player of the Tournament award for scoring 319 runs and taking 15 wickets but despite his best efforts, Zimbabwe failed to qualify for the 2019 World Cup. Sikandar Raza continues to go all guns blazing with the blade and settled well into the role of a middle-order batter who can bowl his full quota of overs when required. His first stint in the Indian Premier League came in the 2023 edition as he was bought by the Punjab franchise at his base price. Raza performed exceptionally well for every franchise that he played for in this period. Raza was also the most valuable player in the ILT20 2024 scoring 313 runs and picking up 13 wickets. His journey from aspiring to serve in the Pakistan Airforce to becoming a long-standing servant of Zimbabwe cricket is one to admire and marvel at.",
  "nationality": "Zimbabwe",
  "career_span": {
    "Test": "2013-2025",
    "ODI": "2013-2025",
    "IPL": "2023-2024"
  }
}