{
  "id": "pprofile_28035",
  "type": "player_bio",
  "player": "Quinton de Kock",
  "full_name": "Quinton de Kock",
  "dob": "December 17, 1992",
  "role": "Wicket-Keeper",
  "batting_style": "Left Handed",
  "bowling_style": "-",
  "teams": [
    "South Africa",
    "Border",
    "Gauteng",
    "South Africa A",
    "South African Invitation XI",
    "Titans",
    "Royal Challengers Bengaluru",
    "Kolkata Knight Riders",
    "Delhi Capitals",
    "Mumbai Indians",
    "South Africa Under-19",
    "DP World Lions",
    "Melbourne Renegades",
    "Sunrisers Hyderabad",
    "Barbados Royals",
    "Benoni Zalmi",
    "Cape Town Blitz",
    "Delhi Bulls",
    "Southern Brave",
    "Quinny’s Kites",
    "Lucknow Super Giants",
    "Durban's Super Giants",
    "MI New York",
    "Seattle Orcas"
  ],
  "bio": "As a 16-year old, Quinton de Kock appeared on South Africa's first-class arena when he made his debut for Gauteng in 2009. A left-handed batsman and wicketkeeper, de Kock also played for South Africa’s Under-19 side and was an important member in the 2012 ICC Under-19 World Cup in Townsville. A gritty fifty in the third place play-off against New Zealand helped his team finish third in the tournament. Representing the Lions in their domestic T20 competition, he was added to their T20 squad for the Champions League in late 2012. Impressed by his performance, the selectors drafted him in South Africa's T20I side for the series against New Zealand the following year. de Kock eventually made his international debut in the first T20I. Later that year, he was picked in the Indian T20 League by the Hyderabad franchise. The year 2013 brought out the best in him. He was picked in the ODI side as a replacement wicket-keeper for AB de Villers against New Zealand. Though his performance wasn't necessarily a stand out, there was a spark about this young kid and that made the selectors back him to the hilt. Late in the year, de Kock started to exhibit his true colours. Notching up his debut hundred in the ODIs against Pakistan, de Kock announced that he was finally ready to take the world by storm and that is what he did when the Indians came calling later in the year. In the three-match ODI series that followed, de Kock finished with a hundred in each of the three games amassing 342 runs, the most by any batter in a three-match bilateral series. In 2014, de Kock was bought by the Delhi franchise to play for them in the seventh edition of the Indian T20 League. He also made his Test debut in the same year against Australia. He could not really keep his place but came back in 2016, and scored his maiden Test ton against England. After 2014, Quinton de Kock cemented himself as a cornerstone of South Africa’s batting lineup, particularly in white-ball formats. His rise as a consistent and explosive opener was marked by a series of impactful performances against top-tier teams. In ODIs, de Kock amassed runs at an impressive rate, reaching several milestones, including surpassing 6,000 runs and scoring numerous centuries, notably excelling against India, England, and Australia. His peak came during the 2023 ICC Cricket World Cup, where he smashed four centuries and finished among the tournament’s leading run-scorers, showcasing his big-match temperament. In Tests, he was known for his counter-attacking style, producing crucial innings in tough conditions, especially in Asia and Australia. Although he briefly captained South Africa across formats, he stepped down from leadership roles to focus on his game and balance personal commitments. De Kock retired from Test cricket in 2021 and ODIs in 2023, yet continued to feature in T20 Internationals, remaining a vital presence with both bat and gloves. His wicketkeeping throughout this period was top-tier — agile, sharp, and reliable — earning him a place among the best keepers of his generation. Concurrently, de Kock became a force in franchise cricket, gaining global recognition for his dynamic performances in T20 leagues. His most notable stint came with the Mumbai in the IPL, where he played a key role in their 2019 and 2020 title wins, forming a lethal opening partnership with Rohit Sharma. Later, playing for Lucknow, he delivered one of IPL’s greatest knocks — an unbeaten 140 off 70 balls in 2022. Beyond the IPL, he starred in tournaments like The Hundred, SA20, the BBL, and CPL, showcasing his adaptability and value as a top-order batter and wicketkeeper. QDK continues to be a sought-after player in the T20 circuit, combining his trademark aggressive flair with the experience of over a decade at the highest level. His laid-back demeanor and match-winning ability have made him a mainstay in franchise cricket and a fan favorite across the globe.",
  "nationality": "South Africa",
  "career_span": {
    "Test": "2014-2021",
    "ODI": "2013-2023",
    "IPL": "2013-2025"
  }
}