{
  "id": "pprofile_63959",
  "type": "player_bio",
  "player": "Ricky Bhui",
  "full_name": "Ricky Kannakumar Bhui",
  "dob": "September 29, 1996",
  "role": "Batsman",
  "batting_style": "Right Handed",
  "bowling_style": "Leg break googly",
  "teams": [
    "India A",
    "India B",
    "India Blue",
    "Indian Board Presidents XI",
    "Rest of India",
    "South Zone",
    "Delhi Capitals",
    "India Under-19",
    "Andhra",
    "Sunrisers Hyderabad",
    "Champions XI",
    "Bezawada Tigers",
    "Indian Oil",
    "India D",
    "Simhadri Vizag Lions"
  ],
  "bio": "Ricky Bhui, born on 29th September 1996, is an Indian cricketer known for his adeptness as a right-handed batter and occasional leg spinner. He spent his formative years studying at Visakha Valley School in Visakhapatnam, where he honed his cricketing skills alongside his academic pursuits. Following his graduation in 2020, Bhui emerged as a promising talent from the cricketing landscape of Andhra Pradesh. Ricky Bhui's cricketing journey began with remarkable milestones early in his career, setting a tone for his future endeavors. Notably, he displayed his prowess by scoring unbeaten centuries on both his List A and Twenty20 debut matches, signifying his arrival as a formidable talent on the cricketing horizon. His exceptional performances earned him a spot in the prestigious Hyderabad franchise in the Indian Premier League, providing him with a platform to showcase his skills at the highest level of domestic T20 cricket. Bhui will be in the Delhi squad for the 2024 Indian Premier League. In December 2015, Ricky Bhui earned recognition on the international stage by securing a place in India's squad for the 2016 Under-19 Cricket World Cup. His inclusion in the squad marked a significant achievement as he became the youngest player to feature in the tournament at that time, reflecting his prodigious talent and potential. Apart from his international endeavors, Bhui has also made significant contributions to domestic cricket, particularly representing Andhra Pradesh in various tournaments. He showcased his batting prowess during the 2018-19 Ranji Trophy season, emerging as the leading run-scorer for Andhra with an impressive tally of 775 runs in eight matches. This remarkable feat underscored his ability to perform consistently at the first-class level, establishing him as a key player for his state team. In August 2019, Ricky Bhui's talent earned him a place in the India Blue team's squad for the 2019-20 Duleep Trophy, further cementing his credentials as a promising cricketer in the Indian domestic circuit. His selection in the prestigious tournament reflected the recognition he garnered for his exemplary performances and his potential to excel on the national stage. Bhui's association with the Hyderabad franchise in the Indian Premier League marked a significant chapter in his cricketing journey. Following his impressive performances in domestic cricket, he was bought by Hyderabad in the 2018 auction, showcasing the faith the franchise had in his abilities as a cricketer. Despite facing stiff competition in the highly competitive league, Bhui proved his mettle with his batting prowess and contributed effectively to the team's campaign. While Bhui's journey in the League witnessed moments of brilliance, he faced challenges along the way, including being released by Hyderabad ahead of the 2020 IPL auction. However, his setback served as a learning experience, motivating him to strive for excellence and make a strong comeback in future editions of the tournament. He will be representing the Delhi franchise in the 2024 edition of the tournament.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "",
    "IPL": "2018-2024"
  }
}