{
  "id": "pprofile_4599",
  "type": "player_bio",
  "player": "Dhawal Kulkarni",
  "full_name": "Dhawal Sunil Kulkarni",
  "dob": "December 10, 1988",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm medium",
  "teams": [
    "India",
    "India A",
    "India B",
    "India Blue",
    "Indian Board Presidents XI",
    "India Green",
    "India Red",
    "Wellington Firebirds",
    "West Zone",
    "Rajasthan Royals",
    "Mumbai Indians",
    "India Under-19",
    "Mumbai",
    "Gujarat Lions",
    "Triumph Knights Mumbai North East",
    "India C",
    "Aakash Tigers Mumbai Western Suburbs",
    "India Capitals",
    "BPCL",
    "India Champions",
    "India Masters"
  ],
  "bio": "Dhawal Kulkarni is a right-arm medium pace bowler who can veritably swing the ball proficiently and is a well-known cricketer in the Mumbai cricketing circles. Although Dhawal made his international debut in 2014, he has not played as many matches as one would imagine. He was mostly on the sidelines in the squad and in the very limited opportunities that he got with the white ball, he fared decently. Notwithstanding this, Dhawal has been very prolific in the domestic circles. He impressed in his maiden Ranji season, picking up 42 wickets for Mumbai, and was the tournament’s most successful bowler. He has been a vital cog in the bowling unit of Mumbai and his excellent performance in the 2012-13 season aided in Mumbai winning their 40 th Ranji title. All these bolstered his credentials further in the side and in the general domestic circuit. With age still very much on his side, all Dhawal needs to do is rack up wickets consistently and continue to keep knocking on the selectors’ doors. An increased emphasis on the pace department under the leadership of Virat Kohli is a blessing in sight for him, if he can cash in on the same. In the Indian T20 League, Dhawal’s fortunes have been a mixed bag of sorts. He was with Mumbai from 2008-13. He then played for Rajasthan and later for Gujarat, when the former was suspended for 2 seasons in the League. During the 2018 season, Dhawal was the fourth highest wicket-taker, with 18 snaps to his credit. Once Rajasthan was back from the 2018 season onwards, they bought Dhawal back to represent them from the said season. After 2 seasons with them, he rejoined his home side, Mumbai.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "2014-2016",
    "IPL": "2008-2021"
  }
}