{
  "id": "pprofile_65525",
  "type": "player_bio",
  "player": "Wiaan Mulder",
  "full_name": "Pieter Willem Adriaan Mulder",
  "dob": "February 19, 1998",
  "role": "All-Rounder",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm medium",
  "teams": [
    "South Africa",
    "Gauteng",
    "Kent",
    "Leicestershire",
    "South Africa A",
    "South Africa Under-19",
    "DP World Lions",
    "Sunrisers Hyderabad",
    "Stellenbosch Kings",
    "Tshwane Spartans",
    "Durban's Super Giants",
    "San Francisco Unicorns"
  ],
  "bio": "Wiaan Mulder is a promising fast bowling all-rounder for South Africa. Born in Gauteng, Mulder pursued cricket from a very young age. With the ability to bowl fast and also handle the bat, Wiaan soon found himself in South Africa's squad for the 2016 Under-19 World Cup and was the highest wicket-taker for his country in the tournament. Soon after that, he made his First-Class debut for Highveld Lions and impressed everyone in his first outing itself by picking seven wickets in the match. Mulder got a breakthrough in the national side when he was named to replace the injured Wayne Parnell for the remainder of the ODI series against Bangladesh in 2017. At a young age of 18, Wiaan earned his ODI cap and since then he has been in the scheme of things. However, he has rarely got opportunities to get into the playing XI regularly. In May 2019, Wiaan Mulder signed with Kent County Cricket Club to play in the County Championship in England. He featured in three matches for Kent before being recalled to the South African team, ahead of their international schedule. His batting ability is one very promising area and he has been part of South Africa's strategic thinking in developing a batting all-rounder for the Test squad for some time. However, he was given the chance to represent South Africa in Test cricket, where he was viewed as a promising prospect. His debut in Test came against Sri Lanka in 2019 while continuing to impress in the domestic circuit. In September 2019, Wiaan Mulder was selected for the Tshwane Spartans squad for the 2019 Mzansi Super League tournament. Continuing his career, Mulder signed with Leicestershire County Cricket Club in January 2021 to play domestic cricket in England. After struggling to find his footing in the ODI format despite making his debut at just 19, Wiaan Mulder was given a fresh opportunity to shine in the T20I arena. In April 2021, he was named in South Africa's T20I squad for their series against Pakistan, signaling a new chapter in his international career. His impressive performances in domestic cricket, coupled with his potential as a promising all-rounder, caught the selectors' attention. In July 2022, he achieved his maiden double century in first-class cricket, scoring an unbeaten 235 for Leicestershire. During that season, he was Leicestershire's second-highest run-scorer, maintaining an average of just under 50, while ended up as the second-highest wicket-taker in 2023. It was in the year 2024 when Wiaan Mulder marked his capabilities in a true fashion with his maiden Test century that came against Bangladesh. Since then, South Africa has consistently shown faith in Wiaan Mulder, keeping him in contention across various formats, as they aim to integrate an all-rounder into the national team, who also keeps his might in the SA20 League since his acquisition by the Durban's Super Giants.",
  "nationality": "South Africa",
  "career_span": {
    "Test": "2019-2025",
    "ODI": "2017-2025",
    "IPL": "2025-2025"
  }
}