{
  "id": "pprofile_3556",
  "type": "player_bio",
  "player": "Dwayne Bravo",
  "full_name": "Dwayne John Bravo",
  "dob": "October 7, 1983",
  "role": "All Rounder",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm medium",
  "teams": [
    "West Indies",
    "Dolphins",
    "Essex",
    "Kent",
    "Surrey",
    "West Indies A",
    "West Indies Academy",
    "West Indies Inv XI",
    "Worcestershire",
    "University of West Indies Vice Chancellors XI",
    "Chennai Super Kings",
    "Mumbai Indians",
    "Middlesex",
    "Victoria",
    "Trinidad & Tobago Red Force",
    "West Indies Under-19",
    "Melbourne Renegades",
    "Melbourne Stars",
    "Sydney Sixers",
    "Chattogram Challengers",
    "Rangpur Riders",
    "Trinbago Knight Riders",
    "Trinbago Knight Riders",
    "St Kitts and Nevis Patriots",
    "Dhaka Capitals",
    "Comilla Victorians",
    "Gujarat Lions",
    "Quetta Gladiators",
    "Lahore Qalandars",
    "Peshawar Zalmi",
    "Pretoria Mavericks",
    "Maratha Arabians",
    "Winnipeg Hawks",
    "Paarl Rocks",
    "Bravo XI",
    "Delhi Bulls",
    "Northern Superchargers",
    "Fortune Barishal",
    "MI Emirates",
    "Texas Super Kings",
    "Rajasthan Kings",
    "West Indies Champions",
    "Miami Lions"
  ],
  "bio": "Dwayne Bravo came across as a richly talented West Indian all-rounder who played a handy role in fast-tracking West Indies back into international prominence. He made his first-class debut for Trinidad and Tobago in 2001-02 and two years later, on the back of some strong all-round performances, made his debut at home against England. In his maiden Test, he showed promise with the bat and also picked up 3 wickets though his side lost heavily. In only his third Test, Bravo showed glimpses of prodigious talent scoring 77 and scalping 6 wickets in the first innings. Early signs showed that Bravo was a better bowler than batsman but he improved on his batting, opening the innings for Trinidad and Tobago and is now a much more accomplished batsman than what he started off as. After being dropped for the 1st Test against Australia in 2005, Bravo bounced back hard in the 2nd Test slamming a brilliant 113, coming in at a precarious situation. It was followed by a superb spell in the 3rd Test where he picked up 6 wickets in the first innings. The next two years were not as fruitful as injury, followed by a poor 2007 World Cup, marred his progress. In 2010, Bravo turned down a WICB central contract, preferring to play several T20 Leagues around the globe. He lost his place in the Test side but remained a regular fixture in the T20Is. He was signed up by Mumbai in the inaugural edition of the Indian T20 League and performed exceedingly well. Later, Chennai bought him in 2011 and he has been with them ever since. Before the Champions Trophy in 2013, Bravo replaced Darren Sammy as the ODI captain. A middle-order batsman, Bravo with his stylish cover drives and quick feet movement, exhibits the true Caribbean flavour. He is also a brilliant fielder and brings energy to the West Indian outfit with his acrobatic fielding. A more than useful death-overs bowler, Bravo has clever variations up his sleeve and also has one of the best slower balls in the business. He was the player's spokesperson when West Indies refused to play their games during a tour of India in 2014 due to issues with the board. Post that, he faced injuries and was eventually left out of the squad as Jason Holder was made the skipper of the ODI team. Bravo then announced his retirement in Tests in 2015. He went on to participate for his country in ODIs and T20Is, even winning the World T20 title in 2016. His injuries and form caused his representation for the national team reducing and eventually, he started playing more in the T20 Leagues around the world. Bravo bid the final goodbye to international cricket when he announced his retirement on 25th October 2018. He remained an exciting and internal part of the Chennai unit as well as the other T20 franchises in the world. Bravo has been one of the best advertisements of the sport, be it due to his joyful nature, his funny antics or for showing superb sportsman spirit. In 2019, Bravo made a U-turn on his retirement and made himself available for the shortest version of the game.",
  "nationality": "West Indies",
  "career_span": {
    "Test": "2004-2010",
    "ODI": "2004-2014",
    "IPL": "2008-2022"
  }
}