{
  "id": "pprofile_65152",
  "type": "player_bio",
  "player": "Himmat Singh",
  "full_name": "Himmat Singh",
  "dob": "November 8, 1996",
  "role": "Batsman",
  "batting_style": "Right Handed",
  "bowling_style": "Off break",
  "teams": [
    "India A",
    "Royal Challengers Bengaluru",
    "Delhi",
    "India Under-23",
    "Trichy Grand Cholas",
    "Lucknow Super Giants",
    "East Delhi Riders",
    "New Delhi Tigers"
  ],
  "bio": "Himmat Singh is a promising right-handed batter who has been making waves in the Indian domestic circuit with his consistent performances. Born on 8 November 1996, Singh has shown immense potential and skill, particularly in the longer formats of the game. His journey in cricket began with Delhi, where he made his first-class debut against Railways in 2017. Since then, he has been a vital part of the Delhi team, showcasing his ability to anchor innings and play crucial knocks under pressure. In the Ranji Trophy, Singh has accumulated more than 1700 runs at an average of above 35. His highest score of 194 against Uttarakhand in January 2024 is a testament to his ability to play long innings. In the shorter formats, Singh has also made a mark in List A cricket, scoring more than 1900 runs with an impressive average of above 48. His highest score of 132 not out against Chandigarh in December 2023 highlights his capability to play match-winning innings. Singh's prowess is not limited to the domestic circuit. In the Syed Mushtaq Ali Trophy, he scored more than 900 runs at a strike rate of above 130, with a top score of 77 against Uttar Pradesh in November 2024. His ability to clear the boundary with ease, as evidenced by his 40-plus sixes in T20 cricket, makes him a valuable asset in the shortest format of the game. While Singh's international career is yet to take off, his performances in domestic cricket have not gone unnoticed. His ability to perform consistently across formats has earned him a spot in the India A team, where he continues to hone his skills and await his opportunity on the international stage.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "",
    "IPL": "2025-2025"
  }
}