{
  "id": "pprofile_71260",
  "type": "player_bio",
  "player": "Abdul Samad",
  "full_name": "Abdul Samad Farooq",
  "dob": "October 28, 2001",
  "role": "Batsman",
  "batting_style": "Right Handed",
  "bowling_style": "Leg break",
  "teams": [
    "Jammu and Kashmir",
    "Sunrisers Hyderabad",
    "Lucknow Super Giants",
    "DY Patil Group A"
  ],
  "bio": "Abdul Samad, a promising young cricketer from Jammu & Kashmir, has been making waves in the Indian cricket scene with his explosive batting and potential to become a future star. Known for his hard-hitting abilities, Samad has quickly become a fan favourite, especially in the Indian Premier League, where he has showcased his talent on numerous occasions. His journey began in the 2018-19 Syed Mushtaq Ali Trophy, where he made his T20 debut for Jammu & Kashmir, followed by his List A and First-Class debuts in the same year. His ability to clear the boundary with ease has made him a valuable asset in the shorter formats of the game. Samad's IPL journey started in 2020 when he was picked up by the Hyderabad-based franchise for a modest sum of Rs. 20 lakh. Since then, he has become a regular feature in the team, contributing crucial runs in the middle order. In the 2024 IPL season, Samad played several impactful innings, including a quickfire 37 off 10 balls against Bengaluru, demonstrating his ability to change the course of a match in a matter of overs. His strike rate of above 145 in the IPL is a testament to his aggressive style of play, and with more than 35 sixes to his name, he has proven to be a game-changer in the T20 format. While Samad's international career is yet to take off, his performances in domestic cricket have been noteworthy. In the Ranji Trophy 2024/25 season, he scored a magnificent 235 runs against Odisha, including a century and a half-century in the same match, showcasing his ability to play long innings. His first-class batting average of above 40 highlights his consistency and flair with the bat. Despite his prowess with the bat, Samad's leg-break bowling has been underutilized, with only a handful of wickets to his name across formats. As he continues to hone his skills and gain experience, Abdul Samad is undoubtedly a name to watch out for in the coming years. His ability to perform under pressure and his knack for hitting big shots make him a potential match-winner for India in the future.",
  "nationality": "India",
  "career_span": {
    "IPL": "2020-2025"
  }
}