{
  "id": "pprofile_71370",
  "type": "player_bio",
  "player": "Dhruv Jurel",
  "full_name": "Dhruv Chand Jurel",
  "dob": "January 21, 2001",
  "role": "Wicket-Keeper",
  "batting_style": "Right Handed",
  "bowling_style": "-",
  "teams": [
    "India",
    "Central Zone",
    "India A",
    "Rest of India",
    "Rajasthan Royals",
    "India Under-19",
    "Uttar Pradesh",
    "India Blue Under-19",
    "India A Under-19",
    "Gaur Gorakhpur Lions",
    "Team A"
  ],
  "bio": "When we hear stories about the sacrifices parents make to help their children succeed, it evokes a deep admiration and joy, especially when their efforts bear fruit. Dhruv Jurel’s story is one in which his mother pawned her gold necklace to buy him his first cricket kit to nurture his dreams. Dhruv Jurel, a dynamic young Indian cricketer, has quickly become a name to watch in international cricket. Hailing from a humble background in Agra, Jurel's journey to the cricketing spotlight is inspiring and remarkable. As a right-handed batter and a skilled wicketkeeper, he represents Uttar Pradesh in domestic cricket. Born to a Kargil war veteran, Jurel's cricketing aspirations were initially met with resistance from his father, who favoured a stable career in the armed forces. His passion for the sport, however, was undeniable. Starting with a summer camp at his school, he soon left his hometown to train at a cricket academy in Noida. Jurel's rise began in youth cricket, where he represented Uttar Pradesh at the U-14, U-16, and U-19 levels. His leadership skills shone when he captained India to victory in the 2019 Under-19 Asia Cup and later served as vice-captain in the 2020 Under-19 World Cup in South Africa. These early successes laid the foundation for his professional career. He made his T20 debut for Uttar Pradesh in the Syed Mushtaq Ali Trophy in January 2021, followed by his first-class debut in the Ranji Trophy in February 2022. In one of his standout performances, Jurel scored an incredible 249 runs against Nagaland during the 2022-23 Ranji Trophy season, showcasing his ability to dominate bowling attacks. The Indian Premier League became a major platform for Jurel to showcase his talent. Bought by Rajasthan for the 2022 season, he didn’t get a chance to play that year. However, in IPL 2023, he made his debut against Punjab, coming in as an Impact Player and smashing an unbeaten 32 off just 15 balls. Although the team lost the match, his explosive knock cemented his position in the side. That season, Jurel scored 152 runs across 11 innings at an impressive strike rate of 172.72. His ability to score rapidly in the death overs made him a valuable asset for Rajasthan. Jurel’s international career took off in early 2024 when he received his maiden call-up for India’s Test squad against England. He made his debut in the third Test in Rajkot and impressed with a gritty 46 off 104 balls in his first innings. His composure and technique against a challenging English attack earned him praise. In the fourth Test at Ranchi, he delivered a stellar performance, scoring 90 runs in the first innings, the highest for India, in a challenging situation. In the second innings, he played a crucial unbeaten knock of 39, forming a vital partnership with Shubman Gill to guide India to victory. His resilience under pressure earned him the Player of the Match award in only his second Test, a feat that underlines his potential as a future star. The 2024 IPL season marked significant progress for Jurel, as he showcased improved performances with the bat compared to his debut season. His immense talent, both as a batter and a wicketkeeper, impressed the Rajasthan franchise, prompting them to retain him for the 2025 edition. Jurel's journey from a young boy with a borrowed bat to representing India on the grandest stage of cricket shows his hard work, determination, and immense talent. His story is a reminder of the sacrifices and support often required to achieve greatness, as well as the rewards that perseverance can bring.",
  "nationality": "India",
  "career_span": {
    "Test": "2024-2025",
    "ODI": "",
    "IPL": "2023-2025"
  }
}