{
  "id": "pprofile_66451",
  "type": "player_bio",
  "player": "Narayan Jagadeesan",
  "full_name": "Narayan Jagadeesan",
  "dob": "December 24, 1995",
  "role": "Wicket Keeper",
  "batting_style": "Right Handed",
  "bowling_style": "-",
  "teams": [
    "India",
    "India B",
    "South Zone",
    "Kolkata Knight Riders",
    "Chennai Super Kings",
    "Tamil Nadu",
    "Chepauk Super Gillies",
    "Dindigul Dragons",
    "Vijay CC",
    "Team B"
  ],
  "bio": "Tamil Nadu has been one of the most dominant sides in the List A and T20 formats of the Indian domestic circuit. Their success has mainly been due to the consistency of batters like Hari Nishaanth, Narayan Jagadeesan, and Sai Sudharsan. Born in Coimbatore, Narayan Jagadeesan is a right-handed wicketkeeper batter from India. Jagadeesan began his professional career when he made his first-class debut for Tamil Nadu against Madhya Pradesh during the 2016–17 Ranji Trophy season. In his debut game, he scored an unbeaten 123 and was awarded the man of the match for his heroics. In January 2017, he made his T20 debut for Tamil Nadu against Hyderabad in the 2016–17 Inter-State Twenty-20 Tournament. In the following month, he made his List A debut for Tamil Nadu against Uttar Pradesh during the 2016–17 Vijay Hazare Trophy. In 2018, the Chennai franchise acquired his services for the 2018 Indian T20 League season. However, he did not get a chance to make his debut until the 2020 season. In 2021, Jagadeesan broke the record for the highest individual score in List A cricket. He achieved this feat by scoring 277 against Arunachal Pradesh in the 2022–23 Vijay Hazare Trophy. In the 2022 mini-auction, the Kolkata franchise selected him for the 2023 Indian T20 League season. Narayan Jagadeesan opens the innings for Tamil Nadu in the List A and first-class formats whereas, in the T20 format, he is used in the middle order. He has a solid technique with the bat and is also safe with his glovework.",
  "nationality": "India",
  "career_span": {
    "ODI": "2022",
    "IPL": "2020-2023"
  }
}