{
  "id": "pprofile_71376",
  "type": "player_bio",
  "player": "Sameer Rizvi",
  "full_name": "Sameer Rizvi",
  "dob": "December 6, 2003",
  "role": "Batsman",
  "batting_style": "Right Handed",
  "bowling_style": "Off break",
  "teams": [
    "Chennai Super Kings",
    "Delhi Capitals",
    "India Under-19",
    "Uttar Pradesh",
    "India A Under-19",
    "India B Under-19",
    "Uttar Pradesh U-19",
    "Kanpur Superstars"
  ],
  "bio": "Born on December 06, 2003, in Meerut, Uttar Pradesh, Sameer Rizvi is a right-handed batter with a right-arm off-break bowling style. Widely recognized as the \"right-handed Suresh Raina\" on social media, this nickname reflects his playing style, reminiscent of the renowned cricketer. Initiating his cricket journey at just eleven years old, Rizvi began training at Gandhibagh Academy in Meerut under the guidance of his maternal uncle, Tankeeb Akhtar, fostering his skills and passion for the sport. In a notable Ranji Trophy match between Uttar Pradesh and Saurashtra in 2011, Rizvi's extraordinary fielding, even at the tender age of five, captured the attention of Uttar Pradesh captain Suresh Raina, who was impressed by the young talent's skills. Although he initially opened the batting until the Under-16 level, Rizvi transitioned to the middle order based on his coach's observation of his innate ability to handle spin bowling. Over the years, he gained a reputation for his aggressive batting style. At the age of 16, Rizvi made his debut in first-class cricket for Uttar Pradesh in the Ranji Trophy in 2020. The following year, he entered List A cricket, representing Uttar Pradesh in the Vijay Hazare Trophy. In the 2023 UP T20 League, Rizvi made headlines by amassing an impressive total of 455 runs in just nine innings for the Kanpur Superstars. This outstanding performance included two centuries, one of which was the fastest century of the tournament, achieved off mere 47 deliveries. Due to his stellar performances in domestic cricket, it was only a matter of time before Rizvi secured a coveted spot in the Chennai franchise, sealing a substantial deal worth INR 8.40 crores in the Indian Premier League. However, after a couple of seasons filled with few opportunities, Chennai released him before the mega auction in 2024 and he was roped in by Delhi for the 2025 IPL season where he will be looking to kick start his IPL journey.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "",
    "IPL": "2024-2025"
  }
}