{
  "id": "pprofile_4602",
  "type": "player_bio",
  "player": "Swapnil Singh",
  "full_name": "Swapnil K Singh",
  "dob": "January 22, 1991",
  "role": "All Rounder",
  "batting_style": "Right Handed",
  "bowling_style": "Slow left-arm orthodox",
  "teams": [
    "Central Zone",
    "India Blue",
    "Royal Challengers Bengaluru",
    "Punjab Kings",
    "India Under-19",
    "Baroda",
    "Chepauk Super Gillies",
    "Siechem Madurai Panthers",
    "VB Kanchi Veerans",
    "Uttarakhand",
    "Lucknow Super Giants",
    "Nelson Sports Club"
  ],
  "bio": "Swapnil Singh is a left-arm orthodox spin bowling all-rounder from Rae Bareilly in Uttar Pradesh. His professional career began for Baroda when he made his first-class debut in 2006, just a few days before his 15th birthday. His T20 debut came in 2007 in the Inter-State Twenty-20 Tournament, and in 2008, he was named in the 25-member probable India U19 squad travelling to Malaysia for the ICC U19 Cricket World Cup but could not make it to the final team. He was also part of the Mumbai squad for the inaugural Indian Premier League season and played his first List A game for Baroda later that year. He started to get more games during the 2014-15 Ranji Trophy season and was a crucial player for the side in the following year. His outstanding performance in the 2015 Syed Mushtaq Ali Trophy, where he registered six wickets for just 19 runs, got him into the spotlight and piqued the interest of the scouts. He was soon awarded a contract by the Punjab franchise for the 2016 Indian Premier League. He remained with them till 2017 and played just five games over the season without making much of an impact. He returned to the grind of domestic cricket and began to work hard while performing consistently for Baroda. He was the leading run-scorer for them in the 2017–18 Ranji Trophy with 565 runs in six matches, and soon his batting began to take prominence. In 2018, he was named in the India Blue squad for the Duleep Trophy. He switched to Uttarakhand for the 2021–22 domestic season, and his improvement in the shortest format of the game prompted the Lucknow franchise to recruit him for the 2023 Indian Premier League. Spending much of the season on the bench, he only had the opportunity to make a couple of appearances. Subsequently, Lucknow decided to release him ahead of the 2024 Indian Premier League auction. However, Bengaluru showed faith in him during the auction process for the 2024 season. Swapnil became one of Bengaluru's most reliable Impact Player options, excelling particularly with the ball in the Powerplay during the team's journey to the playoffs. Recognising his experience and the crucial role he played, Bengaluru retained him for the 2025 edition.",
  "nationality": "India",
  "career_span": {
    "Test": "2023",
    "IPL": "2016-2024"
  }
}