{
  "id": "pprofile_63882",
  "type": "player_bio",
  "player": "Kusal Mendis",
  "full_name": "Balapuwaduge Kusal Gimhan Mendis",
  "dob": "February 2, 1995",
  "role": "Wicket-Keeper",
  "batting_style": "Right Handed",
  "bowling_style": "Leg break",
  "teams": [
    "Sri Lanka",
    "Bloomfield Cricket and Athletic Club",
    "Sri Lankan Board XI",
    "Colombo Cricket Club",
    "Moors Sports Club",
    "Sinhalese Sports Club",
    "Sri Lanka Under-19",
    "Chattogram Challengers",
    "Rest of Sri Lanka",
    "Sri Lanka Cricket Board President XI",
    "Sri Lanka Under-23",
    "Mohammedan Sporting Club",
    "Comilla Victorians",
    "Colombo",
    "Galle",
    "Quetta Gladiators",
    "Lahore Qalandars",
    "Kurunegala Warriors",
    "Sri Lankans",
    "Colombo District",
    "Dambulla",
    "Bangla Tigers",
    "Dambulla Sixers",
    "Galle Marvels",
    "Jaffna Kings",
    "Kandy Falcons",
    "SLC Blues",
    "SLC Greens",
    "SLC Reds",
    "Gujarat Titans",
    "Pretoria Capitals",
    "Sharjah Warriorz",
    "SLC Yellow",
    "Jaffna Titans"
  ],
  "bio": "Kusal Mendis, is a prominent figure in Sri Lankan cricket, known for his right-handed batting prowess and wicketkeeping skills. He made his Test debut against the West Indies on October 22, 2015, and quickly established himself as a reliable top-order batter. His ODI debut came on June 16, 2016, against Ireland, followed by his T20I debut on July 8, 2016, against England. Over the years, Mendis has been instrumental in several of Sri Lanka's significant victories, showcasing his ability to anchor innings and accelerate when needed. Throughout his career, Mendis has achieved notable milestones, including scoring his maiden Test century against Australia in 2016, which was pivotal in Sri Lanka's victory. He has since accumulated multiple centuries across formats, with a top Test score of 245. His leadership qualities were recognized when he captained Sri Lanka during the 2023 ODI World Cup, leading the team to notable victories, including a significant win against England. In franchise cricket, Mendis has represented various teams, such as the Kandy Tuskers, Galle Gladiators, Dambulla Aura, and Pretoria Capitals, delivering standout performances like his 80-run innings against the Paarl Royals in the SA20 tournament.​ Off the field, Mendis's life has seen significant events. In July 2020, he was involved in a road accident resulting in the death of a cyclist, leading to his arrest and subsequent release on bail. Despite facing challenges, including a one-year suspension from international cricket in 2021 for breaching bio-secure protocols, Mendis demonstrated resilience by returning to form and leadership roles within the national team. His journey reflects a blend of talent, perseverance, and leadership, underscoring his significance in Sri Lankan cricket's contemporary narrative.​",
  "nationality": "Sri Lanka",
  "career_span": {
    "Test": "2015-2025",
    "ODI": "2016-2025",
    "IPL": "2025-2025"
  }
}