{
  "id": "pprofile_10183",
  "type": "player_bio",
  "player": "Bhanuka Rajapaksa",
  "full_name": "Pramod Bhanuka Bandara Rajapaksa",
  "dob": "October 24, 1991",
  "role": "Batsman",
  "batting_style": "Left Handed",
  "bowling_style": "Right-arm medium",
  "teams": [
    "Sri Lanka",
    "Burgher Recreation Club",
    "Chilaw Marians Cricket Club",
    "Colts Cricket Club",
    "Galle Cricket Club",
    "Sri Lanka Emerging",
    "Nondescripts Cricket Club",
    "Police Sports Club",
    "Ruhuna",
    "Sri Lanka A",
    "Sinhalese Sports Club",
    "Tamil Union Cricket and Athletic Club",
    "Punjab Kings",
    "Sri Lanka Under-19",
    "Hobart Hurricanes",
    "Uva Next",
    "Kandurata Uva Combined",
    "Saint Lucia Kings",
    "Sri Lanka Cricket Board President XI",
    "Prime Bank Cricket Club",
    "Abahani Limited",
    "Western Troopers",
    "Comilla Victorians",
    "Kandy",
    "Galle",
    "Lahore Qalandars",
    "Peshawar Zalmi",
    "Khulna Tigers",
    "Sri Lankans",
    "Batticaloa District",
    "Dambulla",
    "Team Sri Lanka",
    "Deccan Gladiators",
    "Dambulla Sixers",
    "Galle Marvels",
    "Fortune Barishal",
    "SLC Greens",
    "SLC Reds",
    "SLC Greys",
    "Chennai Brave Jaguars",
    "Durban's Super Giants",
    "Dubai Capitals",
    "MI Emirates",
    "Sharjah Warriorz",
    "Cape Town Samp Army",
    "Premium Paks",
    "Chicago CC"
  ],
  "bio": "Bhanuka Rajapaksa has over the years demonstrated immense patience and persistence to now find himself as an integral part of his national side. Born on 24th October 1991 in Colombo, the capital of Sri Lanka, Bhanuka is a dynamic left-handed batter who idolizes Adam Gilchrist and has based his style of play on the Australian. He made his T20 debut for Schools Invitational XI in the Sri Lanka Cricket Inter-Provincial Twenty20 Tournament at the start of 2009 and later that year, made his List A debut for Sinhalese Sports Club in the Premier Limited Over Tournament Tier A. The Colombo-born wicketkeeper made a name for himself during a successful tour of Australia with the Sri Lanka U19 squad in 2009 by scoring 154 off 111 balls in a Youth ODI and accumulating the most runs overall, which sparked comparisons to Gilchrist. He was selected to play in the 2010 U19 World Cup and emerged as the leading run-getter for his side with 253 runs. In 2011, he made his first-class debut for Sinhalese Sports Club in Premier League Tournament Tier A and the year brought him several accolades as he received the Schoolboy Cricketer of the Year honor and the Young Emerging U19 Player award. The left-hander had to work hard in domestic cricket before making his international debut in a T20I match against Pakistan in Lahore in 2019, almost 10 years after making his domestic debut. He made an instant impact playing a handy knock in the first game and scoring his maiden international half-century in the second fixture. He was drafted by the Galle franchise for the 2020 edition of the Sri Lanka T20 League and played for them in the following season as well. Rajapaksa violated his contract in 2021, and after receiving a one-year suspension, he was fined and given a two-year ban. The national selectors reversed their decision soon after and picked him for a home series against India. He made his ODI debut against India and had a good series but the start of 2022 saw him announce his retirement from international cricket at the age of 30. However, a week later he withdrew his resignation at the behest of the Sports Minister of Sri Lanka. He was bought by the Punjab franchise to play in the Indian Premier League the following month and retained by them to play in the 2023 edition as well. He was part of Sri Lanka’s squad for the 2022 ICC Men’s T20 World Cup and later that year represented the Dambulla franchise in the Sri Lanka T20 League. He has shown his importance to the side after his return during a challenging and transitional period for Sri Lankan Cricket.",
  "nationality": "Sri Lanka",
  "career_span": {
    "Test": "",
    "ODI": "2021-2021",
    "IPL": "2022-2023"
  }
}