{
  "id": "pprofile_74091",
  "type": "player_bio",
  "player": "Yash Dhull",
  "full_name": "Yash Vijay Dhull",
  "dob": "November 11, 2002",
  "role": "Batsman",
  "batting_style": "Right Handed",
  "bowling_style": "Off break",
  "teams": [
    "India A",
    "North Zone",
    "Rest of India",
    "Delhi Capitals",
    "India Under-19",
    "Delhi",
    "India Red Under-19",
    "India A Under-19",
    "India B Under-19",
    "DY Patil Group B",
    "Central Delhi Kings",
    "Sapience"
  ],
  "bio": "Yash Vijay Dhull, a rising star in Indian cricket, has swiftly made a name for himself with his exceptional batting prowess and leadership skills. Born on November 11, 2002, in New Delhi, Dhull has emerged as a promising talent representing Delhi in domestic cricket and making significant contributions to Indian cricket at the junior level. As a dynamic opening batter, Dhull has garnered attention for his impressive performances, both in domestic competitions and on the international stage. Yash Dhull's journey in cricket began at the age of 11, fueled by his passion for the sport and driven by his ambition to excel on the cricket field. Raised in the bustling city of New Delhi, Dhull honed his skills in the local cricketing circuits, where his talent quickly caught the attention of coaches and selectors alike. Under the guidance of mentors and coaches, Dhull rose through the ranks, showcasing his natural talent and determination to succeed. Yash Dhull's foray into junior cricket saw him represent Delhi at various age-group levels, where he quickly established himself as a standout performer. His leadership qualities were evident as he captained the Delhi Under-14 and Under-16 cricket teams, guiding his side to notable successes in domestic competitions. Dhull's exceptional talent and leadership skills were further recognized when he was entrusted with the captaincy of the India national under-19 cricket team for prestigious tournaments such as the ICC Under-19 Cricket World Cup and the ACC Under-19 Asia Cup. Dhull's international journey reached new heights when he played a pivotal role in India's triumph at the 2022 ICC Under-19 Cricket World Cup held in the West Indies. As the captain of the Indian under-19 team, Dhull led from the front, showcasing his batting prowess and leadership acumen on the grand stage. His memorable century against Australia in the Super League semi-final underlined his ability to perform under pressure, propelling India into the final of the tournament. Dhull's stellar performances did not go unnoticed, as he was named the captain of the ICC's team of the tournament, a testament to his outstanding contributions to India's success. Yash Dhull's entry into senior domestic cricket was nothing short of spectacular. Making his first-class debut for Delhi in the 2021–22 Ranji Trophy, Dhull announced his arrival with authority, scoring twin centuries in his debut match against Tamil Nadu. His remarkable feat of scoring two centuries in his maiden first-class appearance underscored his potential and announced his arrival on the domestic cricketing scene. Dhull's stellar performances continued throughout the season, finishing as Delhi's highest run-scorer in the Ranji Trophy with an impressive average of 119.75, including three centuries, one of which was a magnificent unbeaten double hundred against Chhattisgarh. In addition to his exploits in first-class cricket, Dhull showcased his adaptability in the shorter formats of the game. Making his List A debut for Delhi in the Vijay Hazare Trophy and his Twenty20 debut in the Syed Mushtaq Ali Trophy, Dhull displayed his versatility as a top-order batsman capable of making significant contributions across all formats of the game. Dhull's talent and potential were duly recognized in the Indian Premier League, where he was acquired by the Delhi franchise. His inclusion in the squad ahead of the 2022 Indian Premier League season was a testament to his burgeoning reputation as a promising young talent in Indian cricket. While his journey in the Indian Premier League is still in its early stages, Dhull's presence in the Delhi squad bodes well for his prospects in franchise cricket. As Yash Vijay Dhull continues to make strides in his cricketing career, the future holds immense promise for this talented young batsman. With his solid technique, unwavering determination, and leadership qualities, Dhull is well-equipped to make significant contributions to Indian cricket at both the domestic and international levels. As he continues to hone his skills and gain valuable experience in senior cricket, Dhull remains poised to become a stalwart of Indian cricket, inspiring future generations with his performances on the field.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "",
    "IPL": "2023-2023"
  }
}