{
  "id": "pprofile_5435",
  "type": "player_bio",
  "player": "Aditya Tare",
  "full_name": "Aditya Prakash Tare",
  "dob": "November 7, 1987",
  "role": "Wicket Keeper",
  "batting_style": "Right Handed",
  "bowling_style": "-",
  "teams": [
    "India A",
    "West Zone",
    "Delhi Capitals",
    "Mumbai Indians",
    "Mumbai",
    "Sunrisers Hyderabad",
    "Uttarakhand",
    "Eagle Thane Strikers",
    "Indian Oil",
    "Dehradun Warriors",
    "Tehri Titans"
  ],
  "bio": "One moment is all it takes many a times to change fortunes in sports. A moment that is largely inerasable. In Aditya Tare’s case (and in Mumbai’s 2014 season in the Indian T20 League), it is the flick of a Faulkner low full toss towards deep square leg for a maximum that just about saw Mumbai make it to the play-offs. But did you know that his Indian T20 League recruitment was a result of his first-class showing? Yes, Tare had a good FC career, making his Ranji debut in 2009. In a particular Corporate Trophy match against Reliance, Tare, who was playing for IOC, whacked the Reliance bowling all round the park. This display was enough for Reliance who signed him on for Mumbai for the 2010 Indian T20 League season. A wicket-keeper batsman, Tare has represented Mumbai at multiple levels, including leading the under-19 side. In 2015, he took over the captaincy of Mumbai in the Ranji division and immediately led them to their 41 st Ranji Trophy win. But to his tough luck, despite the talent he possessed, Tare could not make himself a strong permanent fixture in any side in the Indian T20 League. He was with Mumbai till 2015 and later appeared for Hyderabad and Delhi in the 2016 and 2017 seasons, with little impact. He came back to Mumbai in 2018 but has hardly featured in a game ever since. A much-needed 71 from Tare in the 2018-19 season final helped Mumbai win their first Vijay Hazare crown since 2007. Rightfully, he was also judged as the ‘Player of the Match’ in that game.",
  "nationality": "India",
  "career_span": {
    "IPL": "2010-2017"
  }
}