{
  "id": "pprofile_69409",
  "type": "player_bio",
  "player": "Marco Jansen",
  "full_name": "Marco Jansen",
  "dob": "May 1, 2000",
  "role": "All-Rounder",
  "batting_style": "Right Handed",
  "bowling_style": "Left-arm fast",
  "teams": [
    "South Africa",
    "Free State",
    "North West Dragons",
    "South Africa A",
    "Punjab Kings",
    "Mumbai Indians",
    "South Africa Under-19",
    "Warriors",
    "Knights",
    "Sunrisers Hyderabad",
    "South Africa Emerging",
    "Durban Heat",
    "Sunrisers Eastern Cape",
    "Washington Freedom"
  ],
  "bio": "With his imposing height of 2.06 meters (6.8 feet), slender frame, and large hands, Marco Jansen embodies the quintessential fast bowler's physique. Interestingly, despite his natural fit as a fast bowler, Jansen's cricketing roots lie in batting. As a young prodigy, he started his career as an opening batter and demonstrated his batting prowess early on, scoring an impressive 164 at just nine years of age. His cricketing development was nurtured by his father, who also coached Marco's younger brother Duan – a striking doppelganger who shares his brother's exceptional talents. Marco Jansen's professional cricket journey began to take shape in April 2018, when he made his List A debut for North West in the CSA Provincial One-Day Challenge. Just months later, in October, he marked his first-class cricket debut in the CSA 3-Day Provincial Cup, where he would soon make his presence felt. The young paceman's talent didn't go unnoticed, and in early 2019, he earned his place in South Africa's under-19 squad for their tour to India – a significant milestone in any young cricketer's career. His performances in domestic cricket were particularly impressive, as he emerged as North West's leading wicket-taker in the 2018-19 CSA 3-Day Provincial Cup, claiming 27 wickets in just six matches. Continuing his rapid rise through South African cricket's ranks, Jansen expanded his repertoire to the shortest format of the game, making his Twenty20 debut for the Knights in April 2019. His growing reputation in domestic cricket led to another exciting opportunity when he was selected for the Durban Heat squad in the prestigious Mzansi Super League later that year. 2021 proved to be a transformative year in Marco Jansen's career. His talent caught the eye of the Mumbai franchise in the Indian T20 League. He made an immediate impact, claiming the prized wicket of the explosive Glenn Maxwell as his first dismissal in the tournament. The same year marked Jansen's entry into international cricket. While he initially received a call-up to South Africa's Test squad for their series against Pakistan, his Test debut would have to wait. The defining moment finally arrived in December 2021, when he earned his first Test cap to don the Proteas whites during South Africa's tour of India. It didn’t take long for Marco to be South Africa’s perennial player across three formats due to his consistent performances. His journey in international cricket expanded in 2022 when he made his ODI debut against India, and shortly after, the Hyderabad franchise in the Indian T20 League recognized his potential and secured his services. Since then, Jansen has established himself as an indispensable member of the Proteas setup, featuring prominently in major ICC tournaments in the subsequent years. What sets him apart is not just his primary skill as a fast bowler, but his valuable contributions with the bat in the lower middle order, making him a genuine all-round asset for the team. In a remarkable display of fast bowling at Kingsmead, Durban, he claimed exceptional figures of 7/13, which helped dismiss Sri Lanka for their lowest-ever Test score of 42. This performance made him the first South African to take a ten-wicket haul at the venue, and notably, the first left-arm seamer from his country to achieve this milestone. Beyond international cricket, Jansen has made significant waves in franchise cricket worldwide. His association with the Sunrisers Eastern Cape in SA20 has been particularly successful, contributing meaningfully to their back-to-back title victories. In the third season, he had another stellar campaign winning the MVP but finished as runners-up. Jansen also plays for Hyderabad in the IPL and he helped them to reach the final in 2024 and was retained for the next season. His global appeal is further evidenced by his presence in America's Major League Cricket, where he represents the Washington Freedom, showcasing his adaptability across different cricket cultures and conditions. All these performances compelled the selectors to include him in the Champions Trophy squad in 2025.",
  "nationality": "South Africa",
  "career_span": {
    "Test": "2021-2025",
    "ODI": "2022-2025",
    "IPL": "2021-2025"
  }
}