{
  "id": "pprofile_59067",
  "type": "player_bio",
  "player": "Dasun Shanaka",
  "full_name": "Madagamagamage Dasun Shanaka",
  "dob": "September 9, 1991",
  "role": "All-Rounder",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm medium",
  "teams": [
    "Sri Lanka",
    "Sri Lanka A",
    "Sinhalese Sports Club",
    "Chattogram Challengers",
    "Sylhet Strikers",
    "Wayamba United",
    "Rangpur Riders",
    "Saint Lucia Kings",
    "Sri Lanka Cricket Board President XI",
    "Comilla Victorians",
    "Colombo",
    "Kandy",
    "Galle",
    "Peshawar Zalmi",
    "Colombo Commandos",
    "Sri Lankan XI",
    "Khulna Tigers",
    "Sri Lankans",
    "Kandy District",
    "Dambulla",
    "Bangla Tigers",
    "Maratha Arabians",
    "Montreal Tigers",
    "Delhi Bulls",
    "Badulla Sea Eagles",
    "Roma CC",
    "Dambulla Sixers",
    "Galle Marvels",
    "Kandy Falcons",
    "SLC Blues",
    "SLC Greens",
    "SLC Reds",
    "SLC Greys",
    "Chennai Brave Jaguars",
    "Gujarat Titans",
    "Dubai Capitals",
    "Seattle Orcas",
    "Harare Bolts",
    "Hambantota Bangla Tigers"
  ],
  "bio": "Dasun Shanaka is a right-arm all-rounder known for his steady pace bowling and hard-hitting batting technique. The Negombo born all-rounder had to work really hard at the domestic level to find his way in the national team. Even though his domestic figures were not up to the mark, showcasing his potential along with some three-dimensional performances was enough to convince the selectors. After playing a few seasons with the Sinhalese Sports Club, Shanaka was handed his maiden T20I call-up against Pakistan in August 2015. One of the highlights of his career came during a T20I match in Pune against India where he picked 3 crucial scalps including MS Dhoni, Hardik Pandya and Suresh Raina and ended with figures of 3 for 16. He played some handy cameos for Sri Lanka in the 2016 World T20 tournament and in the same year was handed his Test cap. Further, Dasun got the opportunity to represent Sri Lanka in all the formats of the game but failed to make the most out of it. His inconsistency along with the presence of senior all-rounders in the squad kept him in and out of the squad. In September 2019 when most of Sri Lanka's prime players opted out of the tour of Pakistan over security reasons, Shanaka was named the skipper of Sri Lanka's T20I squad. He didn't disappoint and led a young bunch in inflicting a clean sweep on the then number 1 T20I team.",
  "nationality": "Sri Lanka",
  "career_span": {
    "Test": "2016-2021",
    "ODI": "2016-2024",
    "IPL": "2023-2023"
  }
}