{
  "id": "pprofile_70222",
  "type": "player_bio",
  "player": "Prabhsimran Singh",
  "full_name": "Prabhsimran Singh",
  "dob": "August 10, 2000",
  "role": "Wicket-Keeper",
  "batting_style": "Right Handed",
  "bowling_style": "-",
  "teams": [
    "India",
    "India A",
    "North Zone",
    "Players",
    "Punjab Kings",
    "India Under-19",
    "Punjab",
    "India Under-23",
    "CAG",
    "Royal Phantoms",
    "Trident Stallions"
  ],
  "bio": "The advent of the shortest format of the game has seen a sudden rise in explosive cricketers and Prabhsimran Singh is one such player who has taken the domestic scene by storm with his aggressive batting and hard-hitting strokeplay. Born on 10th August 2000 in Patiala situated in the state of Punjab in northwestern India, Prabhsimran started playing professional cricket at the age of 8. He scored heavily for Punjab at different age groups and stayed in contention for selection into the India junior squads but was ignored till late 2018. His performance in the Punjab U-23 district tournament while representing Patiala caught the eye of the junior selectors as he scored a magnificent 298 in one of the games. This paved the way for his List A debut representing India Emerging Team in the ACC Emerging Teams Cup against Afghanistan Emerging Team at the end of 2018. He had made his T20 debut as a wicket-keeper batter at the start of 2019 against Madhya Pradesh in the Syed Mushtaq Ali Trophy and was dismissed on a duck in his very first outing. Things got better for the young batter who can also be a handy wicket-keeper, as he was picked by the Punjab franchise for the 2019 Indian Premier League for a whooping sum of INR 4.80 crore but ended up playing just one game that season. He was released at the end of the season but the franchise bought him once again for the 2020 edition at a much-reduced price. He was once again used as a squad player with his chances limited but the franchise seemed to have immense faith in his abilities as they retained him for another year. He made his first-class debut at the start of 2022 against Himachal Pradesh in the Ranji Trophy and scored an attacking century in his very first outing. This prompted the Punjab franchise to go for him once again in the 2022 auction and they managed to recruit him into their squad but he played a solitary game in that edition. They do have plans for him going into the future though as he has been retained ahead of the 2023 Indian Premier League and it is only a matter of time before he gets his opportunity to shine on a world stage. He did get his opportunity to shine in the 2023 season and grabbed it with both hands. While opening the batting alongside Shikhar Dhawan, he smashed 358 runs in 14 games including a brilliant maiden ton against Delhi. He also scored 255 runs in 10 games in the Syed Mushtaq Ali Trophy 2023 playing a key role for Punjab lifting the trophy. However, even though his numbers are decent, India has plenty of quality options for the opening spot, and Singh will need to do something extraordinary to challenge the others. Singh enjoyed a good 2024 IPL season with Punjab scoring over 300 runs, including a smashing fifty in their record run chase against Kolkata. His performances made Punjab retain him ahaed of the 2025 season.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "",
    "IPL": "2019-2025"
  }
}