{
  "id": "pprofile_10062",
  "type": "player_bio",
  "player": "Chris Lynn",
  "full_name": "Christopher Austin Lynn",
  "dob": "April 10, 1990",
  "role": "Batsman",
  "batting_style": "Right Handed",
  "bowling_style": "Slow left-arm orthodox",
  "teams": [
    "Australia",
    "Queensland",
    "Australia A",
    "Hampshire",
    "Northamptonshire",
    "Kolkata Knight Riders",
    "Mumbai Indians",
    "Deccan Chargers",
    "Adelaide Strikers",
    "Brisbane Heat",
    "Kandurata Warriors",
    "Sunrisers Hyderabad",
    "Guyana Amazon Warriors",
    "Trinbago Knight Riders",
    "Jamaica Tallawahs",
    "Western Australia Chairman XI",
    "St Kitts and Nevis Patriots",
    "Cricket Australia XI",
    "Lahore Qalandars",
    "Khulna Tigers",
    "Prime Ministers XI",
    "Bangla Tigers",
    "Maratha Arabians",
    "Multan Sultans",
    "Montreal Tigers",
    "Winnipeg Hawks",
    "Surrey Jaguars",
    "Edinburgh Rocks",
    "Team Abu Dhabi",
    "Northern Superchargers",
    "Jaffna Kings",
    "Chennai Brave Jaguars",
    "Gulf Giants",
    "Joburg Bangla Tigers",
    "Toombul",
    "Australia Champions",
    "Caribbean Tigers",
    "Chicago CC"
  ],
  "bio": "Chris Lynn is an Australian cricketer who plays for Queensland on the domestic front. He debuted for Queensland in 2010 against South Australia. Exactly a week later, he scored a mammoth 139 saving his team from defeat which came when he was just 19 years old. Only Andrew Symonds, Jimmy Maher and Martin Love have reached triple figures for Queensland at a younger age. In three matches, including the final, he scored 220 runs, and his season also involved debuts in the one-day and Twenty20 formats. He was signed by Hyderabad in 2011 but played just one game in the Indian Premier League. He was bought by Kolkata In 2014. Lynn represents Brisbane Heat In the Big Bash League. Known for his high-risk attacking batting, Lynn formed an alliance with Brendon MccCullum and they were dreadfully known as the Bash Brotthers. Lynn's career has been marred by injuries and inconsistencies and as a result, he has failed to be a regular member of the national team. During the auction for the 13th edition of the Indian T20 League, the Aussie was picked at his base price by Mumbai which many considered to be an absolute bargain.",
  "nationality": "Australia",
  "career_span": {
    "Test": "",
    "ODI": "2017-2018",
    "IPL": "2012-2021"
  }
}