{
  "id": "pprofile_67476",
  "type": "player_bio",
  "player": "M Siddharth",
  "full_name": "Manimaran Siddharth",
  "dob": "July 3, 1998",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Slow left-arm orthodox",
  "teams": [
    "Kolkata Knight Riders",
    "Delhi Capitals",
    "Tamil Nadu",
    "Chepauk Super Gillies",
    "Lyca Kovai Kings",
    "Lucknow Super Giants",
    "Vijay CC"
  ],
  "bio": "Manimaran Siddharth, a promising slow left-arm orthodox bowler from India, has been making waves in the domestic circuit with his impressive performances. Known for his ability to extract turn and bounce, Siddharth has been a key player for Tamil Nadu in the Ranji Trophy and the Syed Mushtaq Ali Trophy. His bowling prowess was on full display during the 2022 Vijay Hazare Trophy, where he claimed a five-wicket haul against Arunachal Pradesh, showcasing his potential to become a mainstay in the Indian bowling lineup. Siddharth's career has been marked by several standout performances, including his best bowling figures of 4-16 against Mumbai in the Syed Mushtaq Ali Trophy 2019. His ability to maintain a tight line and length, coupled with his knack for picking crucial wickets, has made him a valuable asset for his team. Despite limited opportunities in the IPL, Siddharth has shown glimpses of his talent, taking a wicket against Bengaluru in the 2024 season. In the domestic arena, Siddharth has been a consistent performer, with over 30 wickets in first-class cricket. His List A record is equally impressive, with over 26 wickets. His T20 performances have been noteworthy, with over 20 wickets in 12 matches, highlighting his effectiveness in the shortest format of the game. Siddharth's journey has not gone unnoticed, with cricketing legends and analysts praising his potential. His performances have drawn comparisons to some of the great left-arm spinners in Indian cricket, indicating a bright future ahead. As Siddharth continues to hone his skills, his focus will be on breaking into the national team and making a mark on the international stage.",
  "nationality": "India",
  "career_span": {
    "Test": "2023",
    "ODI": "2022",
    "IPL": "2024-2025"
  }
}