{
  "id": "pprofile_70324",
  "type": "player_bio",
  "player": "Nathan Ellis",
  "full_name": "Nathan Trevor Ellis",
  "dob": "September 22, 1994",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm fast medium",
  "teams": [
    "Australia",
    "Tasmania",
    "Hampshire",
    "Punjab Kings",
    "Chennai Super Kings",
    "Hobart Hurricanes",
    "London Spirit",
    "Seattle Orcas"
  ],
  "bio": "Considered a late bloomer in cricket, Nathan Ellis has shot through the ranks rapidly and is considered one of the most exciting fast bowlers to grace the field in recent times. Born on 22nd September 1994 in Greenacre situated in the state of New South Wales in Australia, Nathan made his domestic debut at the age of 23 when he was named in the Hobart franchise squad for the 2018 Abu Dhabi T20 Trophy. He made his debut against the Lahore franchise which represented the Pakistan T20 League and bowled an economical spell along with claiming his first domestic wicket. He became a regular in the T20 domestic set and almost a year later towards the end of 2019, he made his List A debut for Tasmania in The Marsh Cup where he once again proved his credentials by claiming three crucial wickets. The start of 2020 saw him make his first-class debut in the Marsh Sheffield Shield and he showed his mettle once again by claiming three wickets in the first inning followed up by a six-wicket haul in the second outing. Nathan Ellis had arrived and the selectors had to stand up and take notice of his consistency. He was ignored in the auction for the 2021 Indian Premier League but an injury to Riley Meredith halfway through the competition resulted in him being brought into the Punjab franchise for the second half of the season. Australia’s vast arsenal of pace bowlers as well as the pandemic delayed his international bow and finally midway through 2021, he found his way into the national squad before making his T20I debut against Bangladesh. Despite Australia dominating the tie, Nathan was having an ordinary game having conceded 34 runs in 3.3 overs but his determination and passion bore fruit when he claimed a hat-trick in the last 3 balls and became the first cricketer to do so on his debut. He was named as an injury cover in Australia’s squad for the 2021 ICC Men’s T20 World Cup but did not play a part in the competition. He was purchased by the Punjab franchise for the 2022 Indian Premier League for his base price despite playing only 3 games for them the previous year. Early in 2022, he made his ODI debut against Pakistan where he claimed a wicket and kept himself firmly in contention for future national selections. The Punjab franchise retained Nathan ahead of the 2023 Indian Premier League and he also captained the Hobart franchise in the absence of Matthew Wade in the 2022-23 Australian T20 League. Ellis also became just the 9th bowler to take a hat-trick in that league while he also performed well for Punjab picking up 13 wickets in 10 games. Even with all the star-quality pacers, he continues to be an integral part of the T20I side for Australia while also playing quite a few ODIs as well. In May 2024, he was named in Australia’s squad for the 2024 ICC Men's T20 World Cup tournament and in November 2024, he was signed by Chennai in the auction for the 2025 Indian Premier League season in India. He is one of the most sought-after players in recent times as he has repeatedly exhibited his talents at the highest level. He is not a conventional tall and well-built fast bowler but even though he lacks the framework, he can bowl at a fair clip. He has a high-arm action that allows him to get an extra bounce off the surface and his passion allows him to give everything he has at the crease. He also can bowl slower deliveries and yorkers which makes him a real threat in the shortest format of the game.",
  "nationality": "Australia",
  "career_span": {
    "Test": "",
    "ODI": "2022-2025",
    "IPL": "2021-2025"
  }
}