{
  "id": "pprofile_64727",
  "type": "player_bio",
  "player": "Rinku Singh",
  "full_name": "Rinku Khanchand Singh",
  "dob": "October 12, 1997",
  "role": "Batsman",
  "batting_style": "Left Handed",
  "bowling_style": "Off break",
  "teams": [
    "India",
    "Central Zone",
    "India A",
    "India B",
    "Rest of India",
    "Kolkata Knight Riders",
    "Punjab Kings",
    "Uttar Pradesh",
    "DY Patil Group B",
    "Meerut Mavericks"
  ],
  "bio": "Rinku Singh, a left-handed batter from Aligarh, has emerged as a promising talent in Indian cricket, captivating fans with his aggressive batting style and consistent performances. His journey from the domestic circuits to the Indian Premier League (IPL) is a testament to his dedication and skill. Singh's breakthrough came during the 2018-19 Ranji Trophy, where he amassed an impressive 953 runs, showcasing his potential as a formidable batter. His IPL journey began with Punjab Kings, but it was with Kolkata Knight Riders that he truly made his mark, becoming a key player in their middle order. Singh's career statistics reflect his prowess on the field. In ODIs, he has played 2 matches, scoring 55 runs with an average of 27.50. His T20I career includes 30 matches with 507 runs at an impressive average of 46.09. In the IPL, Singh has been a vital part of Kolkata Knight Riders, contributing significantly. His domestic performances have been equally impressive, with a first-class batting average of 54.68. Singh's leadership qualities and match-winning performances have been evident in his domestic career. His ability to anchor innings and finish games has been crucial for his teams. Notably, his 69* against Afghanistan in a T20I match highlighted his ability to perform under pressure. Rinku Singh's IPL journey has been nothing short of remarkable. In the 2023 season, he amassed 474 runs at a strike rate close to 150, marking a turning point in his career. His performances caught the attention of national selectors, leading to his debut for India in August 2023. Singh's ability to play crucial innings under pressure has earned him respect and admiration from fans and experts alike. His standout performances in the IPL have solidified his reputation as a reliable middle-order batter. Rinku's upward rise continued when he won the title with Kolkata in 2024. Rinku Singh will continue to play a pivotal role for Kolkata in the IPL as he was retained ahaed of the 2025 season. His performances in domestic tournaments like the Vijay Hazare Trophy will also be closely watched as he aims to secure a spot in the national team. Singh's journey is a testament to his hard work and determination, making him one of the most exciting prospects in Indian cricket.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "2023-2023",
    "IPL": "2018-2025"
  }
}