{
  "id": "pprofile_1201",
  "type": "player_bio",
  "player": "Chris Gayle",
  "full_name": "Christopher Henry Gayle",
  "dob": "September 21, 1979",
  "role": "Batsman",
  "batting_style": "Left Handed",
  "bowling_style": "Off break",
  "teams": [
    "West Indies",
    "ICC World XI",
    "Jamaica Scorpions",
    "Matabeleland Tuskers",
    "PCA Masters XI",
    "Stanford Super Stars",
    "West Indies A",
    "West Indies Inv XI",
    "Worcestershire",
    "University of West Indies Vice Chancellors XI",
    "Royal Challengers Bengaluru",
    "Kolkata Knight Riders",
    "Punjab Kings",
    "Western Australia",
    "West Indies Under-19",
    "Somerset",
    "DP World Lions",
    "Melbourne Renegades",
    "Sydney Thunder",
    "Chattogram Challengers",
    "Dhaka Gladiators",
    "Uva Next",
    "Rangpur Riders",
    "Jamaica Tallawahs",
    "St Kitts and Nevis Patriots",
    "Barisal Bulls",
    "Quetta Gladiators",
    "Karachi Kings",
    "Lahore Qalandars",
    "Cape Town Knight Riders",
    "World XI",
    "Kerala Knights",
    "Vancouver Knights",
    "Balkh Legends",
    "Jozi Stars",
    "Pokhara Rhinos",
    "Team Abu Dhabi",
    "Colombo Strikers",
    "Kandy Falcons",
    "Fortune Barishal",
    "World Giants",
    "Gujarat Greats",
    "Bangla Tigers Mississauga",
    "Morrisville Unity",
    "Premium Windees",
    "Telangana Tigers",
    "Colombo Lions",
    "West Indies Champions",
    "Big Boys",
    "West Indies Masters"
  ],
  "bio": "His 'devil may care' style of play has come under harsh criticism on several occasions but with his unparalleled histrionics, Chris Gayle has, time and again proved his critics wrong, and has been the batsman West Indies gamble on for those rollicking starts, at least in the shorter formats of the game. A regular member in the West Indies youth side, Gayle caught everyone's eye when he cracked a wonderful 141 on their Under-19 tour to Bangladesh and thereafter was hand-picked to represent his hometown , Jamaica, aged just 19. At Jamaica, he grew in stature and just 11 months later, he played his first ODI for the West Indies and consequently made his Test debut six months later. But he succumbed to pressure and after being offered several chances, was dropped. Gayle, however, redeemed himself in 2002 with a double century against New Zealand which was followed by a fantastic away series in India thereby sealing his place in the side. His 317 against South Africa in 2005 was breath-taking and his 2006 Champions Trophy performance provided an icing on the cake. He was offered captaincy in 2007 and the Jamaican did reasonably well with a relatively weak West Indian team at his disposal. In 2009, Gayle displayed two extremely contrasting sides of his personality, scoring an unbeaten 165 in a Test against Australia that took more than seven hours, while smashing the fifth fastest Test century off just 70 balls, in the next match. He followed it up with a triple hundred against Sri Lanka next year, becoming only the fourth batsman to score two triple tons in Tests. Gayle was drafted in for Dirk Nannes as a mid-season replacement for Bengaluru in the Indian T20 League under controversial circumstances but since then, he has been the undisputed king of Twenty20. The mighty Jamaican became an element of surprise as he single-handedly guided his team all the way to finals. He carried his form in the next edition, once again proving to be an unstoppable force. In the sixth season, 'Gaylestorm' as he is fondly known, smashed the fastest T20 century in the world against Pune off just 30 balls, a record, which only his firepower could pull off. There was no surprise when Bengaluru named him as one of the retained players for 2014, the 7th season. Later on, he moved to Punjab but continued to boss the Indian T20 League in the same way. One of the hardest hitters of the cricket ball in the modern game, Gayle is known to put opposition bowlers under pressure with his no-holds-barred style of batting. Most dangerous on the off side, Gayle's style is not exactly textbook but he still has a technique which is quite effective to demolish any bowling attack.",
  "nationality": "West Indies",
  "career_span": {
    "Test": "2000-2014",
    "ODI": "1999-2019",
    "IPL": "2009-2021"
  }
}