{
  "id": "pprofile_63788",
  "type": "player_bio",
  "player": "Krunal Pandya",
  "full_name": "Krunal Himashu Pandya",
  "dob": "March 24, 1991",
  "role": "All-Rounder",
  "batting_style": "Left Handed",
  "bowling_style": "Slow left-arm orthodox",
  "teams": [
    "India",
    "India A",
    "Warwickshire",
    "Royal Challengers Bengaluru",
    "Mumbai Indians",
    "Baroda",
    "Lucknow Super Giants"
  ],
  "bio": "Trained at the Kiran More Academy, Krunal, the elder brother of Hardik Pandya, made it to the big stage after a stellar show for Baroda in the shortest format of the game. He was picked by Mumbai for the ninth edition of the Indian Premier League, and he did not let them down, scoring 237 runs in nine innings at a strike rate of 191.12 and picking six wickets as well. Krunal spent most of the 2016-17 season recovering from a shoulder injury, which also hampered his progress. On his return, he scored 366 runs in eight matches at an average of 45.75 in the Vijay Hazare Trophy. He also took 11 wickets, going at an economy of less than 5 to further bolster his resume. After missing a few games for Mumbai in the 2017 IPL season, Krunal recovered in time to deliver a match-winning performance in the final against Pune, earning the Man of the Match award. His consistent displays in the tournament paved the way for his T20I debut for India in 2018 against the West Indies, where he impressed with his all-round abilities. Three years later, in 2021, he made his ODI debut against England, making an immediate impact with a quickfire 58 off 31 balls. However, stiff competition among India's all-rounders made it difficult for him to secure a permanent spot in the national side. Having been part of Mumbai's title-winning campaigns in 2017, 2019, and 2020, Krunal was released by the franchise after the 2021 season. Though injuries and inconsistent form kept him on the fringes of international cricket, he remained a valuable asset in domestic and franchise cricket. In 2022, he joined Lucknow, where he briefly captained the side in IPL 2023 in KL Rahul's absence. After a three-year stint with Lucknow, he re-entered the auction ahead of the 2025 season, where Bengaluru secured his services for INR 5.75 crore.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "2021-2021",
    "IPL": "2016-2025"
  }
}