{
  "id": "pprofile_59611",
  "type": "player_bio",
  "player": "Jayant Yadav",
  "full_name": "Jayant Yadav",
  "dob": "January 22, 1990",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Off break",
  "teams": [
    "India",
    "India A",
    "India B",
    "India Blue",
    "India Green",
    "North Zone",
    "Rest of India",
    "Warwickshire",
    "Delhi Capitals",
    "Mumbai Indians",
    "Middlesex",
    "Haryana",
    "India Under-23",
    "Gujarat Titans"
  ],
  "bio": "Handy with both bat and ball, Jayant made his Ranji debut in 2011 at the ripe age of 21. Playing for Haryana against Gujarat on his debut, he scalped 6 wickets in the game to hand the former a comfortable victory. Some dry patches followed afterwards but Jayant kept going and was soon reckoned to be an upcoming talent who had the appetite to play at the highest levels. Jayant continued to work on his craft over the years and it paid off well in the 2014-15 Ranji season, where, with 33 scalps, he was Haryana’s leading wicket-taker that season. As his name began to spread, he was bought by Delhi in the 2015 auctions to play for them in the Indian Premier League. His appearances and performances remained modest though. Notwithstanding the above, it is imperative to note that while he is more known for his off-spin, he is more than a useful resource with the bat lower down the order. It was not just against England in 2016, but also when he teamed up with Amit Mishra for a record 392-run stand for Haryana’s eighth wicket against Karnataka in December 2012. Yadav himself scored 211 in the first innings alone. Jayant received able coaching from Rahul Dravid during his India A days and this helped him to work on his game well and persevere as he made his way to staking a spot in the whites for his nation. But with the growth of Kuldeep Yadav, Jayant’s stocks started to dip, due to the lack of options that finger spinners usually present themselves with. However, with consistent performances in the platform that elevated him, Ranji Cricket, he holds a good chance to make a strong comeback again. After being with Delhi since 2015, Jayant was traded to Mumbai ahead of the 2019 Indian Premier League. Although he played just 2 games in that season. In February 2022, he was bought by Gujarat in the 2022 auction Indian Premier League for INR 1.7 Cr. That year Gujarat won the League and Jayant was a part of that team. Yadav's international appearances have remained limited, primarily due to the presence of established all-rounders in the national team.However, his remarkable 241-run partnership with Virat Kohli in a Test match in 2016 against South Africa still stands as the second-best eight-wicket partnership in Test history, and the highest for India. During this partnership, he contributed with a brilliant century, making him the only Indian batter to achieve such a feat while batting at number 9. However, he continues to be a vital cog in domestic cricket, performing consistently for Haryana and Middlesex County Cricket Club in England, where he joined pretty recently in September 2023. He was also retained by Gujarat and will represent the team for the 2024 season of the Indian Premier League, showcasing his all-round abilities on the biggest stage. He was once again picked up by Gujarat at a base price of INR 75 lakhs.",
  "nationality": "India",
  "career_span": {
    "Test": "2016-2022",
    "ODI": "2016-2022",
    "IPL": "2015-2023"
  }
}