{
  "id": "pprofile_114353",
  "type": "player_bio",
  "player": "Andre Siddarth",
  "full_name": "C Andre Siddarth",
  "dob": "August 28, 2006",
  "role": "Batsman",
  "batting_style": "Right Handed",
  "bowling_style": "Off Spin",
  "teams": [
    "Chennai Super Kings",
    "India Under-19",
    "Tamil Nadu",
    "Chepauk Super Gillies",
    "Lyca Kovai Kings",
    "India B Under-19"
  ],
  "bio": "Andre Siddarth, a promising young batter from India, is making waves in the cricketing world with his right-handed batting prowess. Born in 2006, Siddarth has already shown glimpses of his potential in domestic cricket, particularly in the Ranji Trophy and the Vijay Hazare Trophy. His journey began with Tamil Nadu, where he made his first-class debut against Saurashtra in October 2024. Since then, he has been a consistent performer, amassing 612 runs in just eight matches at an impressive average of 68.00, including a century and five fifties. His highest score of 106 came against Chandigarh, showcasing his ability to anchor the innings and play long knocks. Siddarth's batting style is characterized by his solid technique and ability to play both pace and spin with equal ease. His strike rate of 63.48 in first-class cricket indicates his ability to rotate the strike and keep the scoreboard ticking. In the limited-overs format, he has shown promise in the Vijay Hazare Trophy, scoring 40 runs against Vidarbha, although his overall List A average of 20.00 suggests room for improvement. His performances in the ACC Men's U19 Asia Cup 2024 were noteworthy, with a top score of 22 against Sri Lanka Under-19, contributing to his overall tally of 57 runs in the tournament. In terms of career statistics, Siddarth's first-class record stands out with an average of 68.00, supported by a strike rate of 63.48. His List A career, though in its nascent stages, shows potential for growth. In the T20 format, he has played seven matches, scoring 62 runs at an average of 12.40, with a strike rate of 100.00. His highest score in T20s is 23 against IDream Tiruppur Tamizhans, indicating his ability to contribute in the shortest format as well.",
  "nationality": "India",
  "career_span": {}
}