{
  "id": "pprofile_93526",
  "type": "player_bio",
  "player": "Harshit Rana",
  "full_name": "Harshit Pradeep Rana",
  "dob": "December 22, 2001",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm fast",
  "teams": [
    "India",
    "India A",
    "North Zone",
    "Kolkata Knight Riders",
    "Delhi",
    "North Delhi Strikers",
    "India D"
  ],
  "bio": "India have had a rich history of producing an abundance of spinners, mainly due to the pitches in their backyard. However, there has been an increase in the number of pitches that have supported fast bowling in the country. Due to this, there have been pacers emerging from every nook and corner, and one of them is Harshit Rana. Hailing from New Delhi, Harshit Rana began his cricketing career by playing age-group cricket. Before even making his senior debut in the Indian domestic circuit, Kolkata selected him as a replacement for the injured Rasikh Salam during the 2022 IPL season. Rana made his debut for the franchise and finished with figures of 1 for 24 in his first appearance against Delhi. Later in the year, the speedster went on to make his List A and first-class debuts in the domestic arena for Delhi. Although he played only two matches in his maiden IPL season, Kolkata recognised his potential and retained him for the 2023 season, underlining their belief in his talent and promise as a fast-bowling prospect. With 21 wickets in 8 innings during the Ranji Trophy preceding the 2023 IPL season, Rana carried momentum and confidence into the tournament but couldn't translate it into success, managing just 5 wickets in 6 games. Despite this, he was retained, and come the 2024 season, he repaid the faith shown in him. Playing a pivotal role in Kolkata's title-winning campaign, he picked up 19 wickets, catching the eye of then-Kolkata mentor Gautam Gambhir, who would later go on to become the head coach of the Indian team. He was selected for the 2024-25 Border-Gavaskar Trophy in Australia and made his debut in the first Test in Perth. Rana impressed with a three-wicket haul in his maiden outing, playing a crucial role in India's victory. Upon returning home from the series, his focus shifted to the white-ball contests against England. In an interesting turn of events, Rana was not initially part of the playing XI for the fourth T20I in Pune but ended up making his debut as a concussion substitute for Shivam Dube. Seizing the opportunity, he made an immediate impact in India's win. His ODI debut followed in the same series against England. Initially not picked in India's provisional squad for the 2025 Champions Trophy, Rana was later drafted in as a replacement for the injured Jasprit Bumrah.",
  "nationality": "India",
  "career_span": {
    "Test": "2024-2024",
    "ODI": "2025-2025",
    "IPL": "2022-2025"
  }
}