{
  "id": "pprofile_65702",
  "type": "player_bio",
  "player": "Prasidh Krishna",
  "full_name": "Muralikrishna Prasidh Krishna",
  "dob": "February 19, 1996",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm fast medium",
  "teams": [
    "India",
    "India A",
    "India B",
    "India Red",
    "Leicestershire",
    "Rest of India",
    "Kolkata Knight Riders",
    "Rajasthan Royals",
    "Karnataka",
    "India Under-23",
    "Mysore Warriors",
    "Ballari Tuskers",
    "Bengaluru Blasters",
    "Gujarat Titans",
    "Team A"
  ],
  "bio": "Prasidh Krishna, known affectionately as 'Skiddy,' has quickly made a name for himself as one of India's most exciting fast bowlers. His ability to generate extra bounce and skid, particularly on deliveries pitched just short of a good length, sets him apart from other pacers in the country. Born on February 19, 1996, in Bangalore, Krishna's rise through the ranks of Indian cricket began with a standout debut for Karnataka in first-class cricket. He impressed immediately, claiming five wickets for 49 runs in his debut match against Bangladesh A. His List-A debut came in the 2016-17 Vijay Hazare Trophy, and by the following season, he had firmly established himself as one of Karnataka’s key bowlers. In the 2017-18 season, he was the joint second-highest wicket-taker in the Vijay Hazare Trophy, finishing with 17 wickets from just eight matches. His consistent performances in 50-over cricket helped Karnataka clinch the Vijay Hazare Trophy that season. Krishna’s rise continued with a major first-class milestone in the 2021-22 Ranji Trophy. Playing against Jammu and Kashmir, he achieved his maiden ten-wicket haul in a match, taking 6/35 in the first innings and 4/59 in the second, further cementing his reputation as a rising star in Indian cricket. Krishna's international stage debut came when he was called up as a replacement for the injured Kamlesh Nagarkoti during the 2018 IPL season. Making his debut against Mumbai, Krishna wasted no time in showcasing his skills, quickly becoming a crucial part of Kolkata Knight Riders' bowling attack. However, his career was not without setbacks. A stress fracture in his left leg in 2019 was followed by another stress fracture in his back in 2022, and a quadriceps injury in 2024, all of which interrupted his progress. Despite these challenges, Krishna made his ODI debut for India in 2021 against England, where he made an immediate impact with figures of 4 for 54, announcing himself on the international stage. He followed this up with his T20I and Test debuts in 2023, although his returns to the international scene were short-lived due to injury setbacks. In a significant turn, on November 5, 2023, Krishna was added to India's squad for the 2023 Cricket World Cup after Hardik Pandya was ruled out due to injury. This call-up highlighted his value as a backup bowler for India on the big stage. Krishna's IPL journey also saw significant milestones. After his time with Kolkata Knight Riders, he moved to Rajasthan Royals, where he continued to impress. His best IPL performance came when he claimed figures of 4 for 30 against Sunrisers Hyderabad, showcasing his ability to perform under pressure in big games. In the 2024/25 Border-Gavaskar Trophy, Krishna showed his growing maturity as a bowler, taking a six-wicket haul against Australia in Sydney, a performance that solidified his reputation as a rising star in Indian cricket. With his ability to adapt to varying pitch conditions and swing the ball both ways, Krishna has become a formidable force on the international circuit, and his future in Indian cricket looks incredibly promising. Ahead of the 2025 IPL season, Rajasthan Royals released Prasidh Krishna in the mega auction. RR however, raised the paddle for him, but in a heated bidding war, Gujarat Titans emerged as the team picking him up with a hefty paycheck of INR 9.5 crores.",
  "nationality": "India",
  "career_span": {
    "Test": "2023-2025",
    "ODI": "2021-2023",
    "IPL": "2018-2025"
  }
}