{
  "id": "pprofile_10114",
  "type": "player_bio",
  "player": "Mandeep Singh",
  "full_name": "Mandeep Singh",
  "dob": "December 18, 1991",
  "role": "Batsman",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm medium",
  "teams": [
    "India",
    "India A",
    "India Blue",
    "North Zone",
    "Rest of India",
    "Royal Challengers Bengaluru",
    "Kolkata Knight Riders",
    "Punjab Kings",
    "Delhi Capitals",
    "India Under-19",
    "Punjab",
    "Tripura",
    "Royal Phantoms",
    "Agri King's Knights",
    "JP Sports"
  ],
  "bio": "India has been the most successful team in the Men’s Under-19 World Cups, winning the title on five occasions. This success has helped India unearth plenty of promising batters such as Mandeep Singh, Virat Kohli, and Shubman Gill, who have gone on to represent the senior team. Mandeep Singh is a right-handed batter hailing from Jalandhar in Punjab. He started his professional career by representing his state at the age-group level. He was one of the stars of the 2009 Under-19 tour to Australia where he scored a crackling 151 and caught public attention. Indian selectors took notice of his performances at the junior level and named him the vice-captain of the Indian team for the 2010 Under-19 World Cup. After returning from the Under-19 World Cup, Mandeep went on to make his debut for Punjab at the senior level. Within two months, he made his List A and T20 debuts for Punjab. In the same year, he was selected by the Kolkata franchise for the 2010 Indian T20 League season. His first-class debut came towards the end of 2010 in the Vijay Hazare Trophy where he played an impressive knock and got a half-century. He was also part of the North Zone team that won the Deodhar Trophy in the same year. After grinding for years in the domestic circuit and the Indian T20 League, Mandeep received his maiden India call-up in 2016 when he was named in the T20I squad for the series in Zimbabwe. He made his T20I debut in that series and was impressive as well. Other than the Kolkata franchise, he has also plied his trade for the Delhi, Punjab, and Bengaluru franchises in the Indian T20 League. He will appear for the Kolkata franchise in the 2023 Indian T20 League season after he was bought at the base price in the auction. Mandeep Singh bats in the middle order for Punjab in all three formats. He can play pace and spin well and is a very reliable batter. He can also roll his arm over with his medium pace. However, he has been off the radar when it comes to international reckoning in recent times.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "",
    "IPL": "2010-2023"
  }
}