{
  "id": "pprofile_67627",
  "type": "player_bio",
  "player": "Shrijith Krishnan",
  "full_name": "Krishnan Lakshmanan Shrijith",
  "dob": "August 12, 1996",
  "role": "Wicket-Keeper",
  "batting_style": "Left Handed",
  "bowling_style": "Off break",
  "teams": [
    "Mumbai Indians",
    "Karnataka",
    "Mysore Warriors",
    "Bijapur Bulls",
    "Hubli Tigers",
    "Gulbarga Mystics"
  ],
  "bio": "Shrijith Krishnan is carving a niche for himself in the cricketing world with his adept skills behind the stumps and his left-handed batting prowess. Born in Bengaluru, Krishnan has been a vital part of Karnataka's domestic setup, showcasing his potential as a wicketkeeper-batter. His journey in domestic cricket has been marked by consistent performances, particularly in the Ranji Trophy and Vijay Hazare Trophy, where he has demonstrated his ability to anchor innings and contribute crucial runs. Krishnan's batting style is characterized by his ability to play both aggressive and defensive strokes, adapting to the demands of the game. In the Ranji Trophy 2024/25 season, he scored a commendable 117 against Uttar Pradesh, highlighting his capability to perform under pressure. His List A career has also seen him notch up a century, with a high score of 150 against Mumbai, reflecting his potential to play match-winning innings. His growing reputation in domestic circuits speaks volumes about his potential and the promise he holds for the future of Indian cricket. Krishnan's leadership qualities and match-winning performances have been evident in domestic tournaments. His ability to perform in high-stakes matches, such as his century in the Maharaja T20 Trophy against Gulbarga Mystics, underscores his potential to rise to the occasion and deliver when it matters most. Looking ahead, Shrijith Krishnan is poised to take on new challenges in the upcoming domestic season. With his consistent performances, he is on the radar for higher honors. As Shrijith Krishnan continues to hone his skills and make strides in domestic cricket, the future looks promising for this young wicket-keeping dynamo.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "",
    "IPL": ""
  }
}