{
  "id": "pprofile_3991",
  "type": "player_bio",
  "player": "Ajinkya Rahane",
  "full_name": "Ajinkya Madhukar Rahane",
  "dob": "June 6, 1988",
  "role": "Batsman",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm medium",
  "teams": [
    "India",
    "Hampshire",
    "India A",
    "India B",
    "India Blue",
    "Indian Board Presidents XI",
    "India Green",
    "Leicestershire",
    "Rest of India",
    "West Zone",
    "Kolkata Knight Riders",
    "Chennai Super Kings",
    "Delhi Capitals",
    "Rajasthan Royals",
    "Mumbai Indians",
    "India Under-19",
    "Mumbai",
    "Rising Pune Supergiant",
    "North Mumbai Panthers",
    "Bandra Blasters",
    "India C",
    "Indians",
    "Indian Oil"
  ],
  "bio": "Ajinkya Rahane, a right-handed top-order batter from Mumbai is a perfect combination of talent, consistency and aggression. He made his first-class debut for Mumbai in 2007. In only his second Ranji season, he piled up a mountain of 1089 runs, which was instrumental in Mumbai's 38th Ranji title triumph. Rahane scored runs for fun and his twin tons in the Emerging Players Trophy in Australia forced his way into the Indian ODI team in 2011. He showed both talent and elegance to stamp his authority early in his career. He traveled a lot with the Indian Test squad before finally getting a chance in the 2013 Test series against Australia. Ajinkya didn’t have the best of debuts but he put it past him and only in his third Test, Rahane scored fifties in both innings in Durban. He was often the man for India away from home in a crisis, he showed that in his maiden Test ton in New Zealand. It was his brilliant century on a green deck at Lord’s in 2014 that really made the world take notice. It set up India’s first win at the venue in 28 years. On the tour Down Under, Rahane scored 399 runs in the four-match Test series. He didn’t quite shine in a similar fashion in ODIs but scored his maiden ton in Birmingham in 2014. He had a dwindling time in the 50-over format though with the odd brilliant knock. His 79 against South Africa in the 2015 World Cup was particularly eye-catching. After scoring 188 during the home series in 2016 against the Kiwis, Rahane fell away but chipped in with vital contributions against Australia. In the Indian Premier League, he started with Mumbai but his real success came with Rajasthan. A prolific scorer for them at the top of the order, he was the perfect foil for many aggressive opening partners. He was bought by Pune in the 2016 edition of the tournament and had a fairly decent run. Once Rajasthan returned to the league after a 2-year hiatus, Rahane was once again roped in and also made the captain after Steven Smith’s involvement in the infamous sandpaper gate. He transitioned into the Delhi franchise for the 2020 and 2021 seasons and also played a vital role in helping his team to qualify for the finals in 2020. Despite a lackluster stint with Kolkata in 2022, Rahane was acquired by Chennai for his base price of INR 50 lacs, where he transitioned to aggressive batting, proving to be a valuable addition to the team. Since 2022, Ajinkya Rahane has made significant contributions in domestic cricket. He led Mumbai to their 42nd Ranji Trophy title in the 2023-24 season, playing a crucial role in the final with a 73-run knock despite a personal slump in form. In the 2024 Syed Mushtaq Ali Trophy, he was the tournament’s leading run-scorer with 469 runs at an impressive strike rate of 164.56, earning the Player of the Series award. His T20 resurgence continued in IPL 2023 with Chennai Super Kings, where he scored 209 runs at a stunning strike rate of 199.05, including a blistering 71 off 29 balls. Rahane also made a strong return to international cricket. He was recalled for the 2023 World Test Championship (WTC) final against Australia, where he completed 5,000 Test runs, becoming the 13th Indian to achieve the milestone. His selection was largely influenced by his IPL performances, proving his adaptability across formats. While he hasn’t been a regular in the Indian squad since, his domestic form continues to keep him in contention. That form led him to be picked up by Kolkata in the 2025 IPL auction where he was later named as captain of the franchise.",
  "nationality": "India",
  "career_span": {
    "Test": "2013-2023",
    "ODI": "2011-2018",
    "IPL": "2008-2025"
  }
}