{
  "id": "pprofile_7836",
  "type": "player_bio",
  "player": "Isuru Udana",
  "full_name": "Isuru Udana Tillakaratna",
  "dob": "February 17, 1988",
  "role": "All Rounder",
  "batting_style": "Right Handed",
  "bowling_style": "Left-arm medium fast",
  "teams": [
    "Sri Lanka",
    "Sri Lankan Board XI",
    "Colombo Cricket Club",
    "Chilaw Marians Cricket Club",
    "Sri Lanka Cricket Combined XI",
    "Nondescripts Cricket Club",
    "Ruhuna",
    "Sri Lanka A",
    "Sri Lankan Invitation XI",
    "Tamil Union Cricket and Athletic Club",
    "Royal Challengers Bengaluru",
    "Wayamba",
    "Sri Lanka Under-19",
    "Combined Provinces",
    "Duronto Rajshahi",
    "Ace Capital Cricket Club",
    "Sylhet Strikers",
    "Wayamba United",
    "Rangpur Riders",
    "Trinbago Knight Riders",
    "Sri Lanka Cricket Board President XI",
    "Basnahira Greens",
    "Western Troopers",
    "St Kitts and Nevis Patriots",
    "Dhaka Capitals",
    "Kandy",
    "Galle Guardians",
    "Durbar Rajshahi",
    "Sri Lankans",
    "Puttalam District",
    "Dambulla",
    "Bangla Tigers",
    "Montreal Tigers",
    "Paktia Panthers",
    "Paarl Rocks",
    "Sindhis",
    "Northern Warriors",
    "Sri Lanka Legends",
    "Colombo Strikers",
    "Galle Marvels",
    "Kandy Falcons",
    "Asia Lions",
    "India Capitals",
    "New York Strikers",
    "Morrisville Samp Army",
    "Dubai Capitals",
    "Vizag Titans",
    "Texas Chargers",
    "Toyam Hyderabad",
    "Clarion County Eagles",
    "NY Superstar Strikers",
    "Dubai Giants",
    "Sri Lankan Lions",
    "New York Lions CC",
    "Hambantota Bangla Tigers",
    "Sri Lanka Masters"
  ],
  "bio": "A talented left-arm fast-medium bowler, Isuru Udana was fast-tracked in the Sri Lankan A team for the tour to South Africa in 2008, without a single First-Class game to his credit. Udana was the leading wicket-taker in the 2008-09 Inter-Provincial T20 tournament, thereby helping Wayamba clinch the title and a place in the Champions League Twenty20. His variations in pace made him an effective T20 bowler. Subsequently, he was drafted into the Sri Lankan squad for the 2009 ICC T20 World Cup. Udana debuted against Australia in the tournament. In 2011, he was included in the Lankan T20 squad for their series against the Aussies but did not feature in a single match. The following year, he was named in Sri Lanka’s ODI squad for their home series against India and made his ODI debut against the Men In Blue. However, following 2012, he did not play a single international match until the next 4 years. He made his comeback onto the international scene in a T20I game against New Zealand in January 2016. He did not feature in another international match over the next 12 months but since 2017, Udana has been a regular fixture for Sri Lanka in their T20 squad. In 2019, Udana also cemented his place in the ODI squad for the Lankans, making it to the 2019 ICC World Cup squad as well. Isuru Udana has been playing regular T20I cricket and he is widely expected to make the cut for the 2020 ICC T20 World Cup squad as well. He can prove to be a valuable asset to a team which has been short of experience. Also, in the 2020 Indian T20 League auction, Udana was bought by the Bangalore-based franchise for Rs. 50 lakh. It will be interesting to see what the future holds for the talented left-arm bowler from the Island nation who is very handy with the bat as well.",
  "nationality": "Sri Lanka",
  "career_span": {
    "ODI": "2012-2021",
    "IPL": "2020"
  }
}