{
  "id": "pprofile_88543",
  "type": "player_bio",
  "player": "Vicky Ostwal",
  "full_name": "Vicky Kanhaiya Ostwal",
  "dob": "September 1, 2002",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Slow left-arm orthodox",
  "teams": [
    "Delhi Capitals",
    "India Under-19",
    "Maharashtra",
    "India B Under-19",
    "Maharashtra U-19",
    "India E Under-19",
    "BPCL",
    "Raigad Royals",
    "Raigad Royals-Dup"
  ],
  "bio": "Vicky Ostwal, a towering left-arm spinner from Lonavala, Maharashtra, has swiftly risen through the ranks of Indian cricket, establishing himself as a promising talent to watch out for. Idolizing the esteemed Ravindra Jadeja, Ostwal possesses a natural flair for spin bowling, coupled with a burgeoning batting prowess that adds depth to his all-round capabilities on the cricket field. Ostwal's journey to cricketing prominence commenced with his stellar performance in India's U19 World Cup triumph in 2022. His standout moment came against South Africa U19, where he wreaked havoc with the ball, dismantling the opposition's batting line-up with figures of 5-28 in 10 overs. Ostwal's instrumental role in India's journey to the final and eventual victory saw him emerge as the team's leading wicket-taker, scalping 12 wickets from just 6 games, showcasing his talent and potential on the global stage. Following his impressive display at the U19 World Cup, Ostwal transitioned seamlessly into Maharashtra's domestic cricket setup. Making his debut across all three formats in 2022, Ostwal quickly made his presence felt with his skillful spin bowling and valuable contributions with the bat. His inclusion in the Maharashtra squad marked the beginning of a promising domestic career, where he aimed to further hone his craft and make significant contributions to his team's success. Ostwal's foray into First-Class cricket commenced on 24th February 2022, during the match between Vidarbha and Maharashtra at Sultanpur. Despite limited opportunities, Ostwal made a notable impact, showcasing his ability to pick wickets with his orthodox left-arm spin. In the five First-Class matches he has played so far, Ostwal has demonstrated his effectiveness by claiming 8 wickets at an economy rate of 3.14, underscoring his potential to thrive at the highest level of domestic cricket. In T20 cricket, Ostwal made his debut on 16th October 2022, representing Maharashtra against Meghalaya at Mohali. Despite his limited appearances in the shortest format, Ostwal has showcased glimpses of his talent, picking up 4 wickets in four T20 matches while maintaining an economy rate of 4.35. Known for his ability to bowl economical spells and strike crucial breakthroughs, Ostwal's contributions in T20 cricket highlight his versatility and adaptability across different formats of the game. Ostwal's List A debut came on 21st November 2022, during the match between Maharashtra and Mizoram at Ranchi. In his brief stint in List A cricket, Ostwal has impressed with his consistent performances, claiming 7 wickets in three matches at an impressive economy rate of 3.66. His ability to thrive in the limited-overs format underscores his potential as a valuable asset for Maharashtra's cricketing ambitions in domestic competitions. In recognition of his talent and potential, Ostwal was acquired by Delhi in the 2022 Indian Premier League auction for a base price of INR 20 lakh. His inclusion in the Delhi squad provides him with a platform to showcase his skills on the grand stage of franchise cricket and further enhance his reputation as a promising all-rounder in Indian cricket.",
  "nationality": "India",
  "career_span": {}
}