{
  "id": "pprofile_4688",
  "type": "player_bio",
  "player": "Moeen Ali",
  "full_name": "Moeen Munir Ali",
  "dob": "June 18, 1987",
  "role": "All-Rounder",
  "batting_style": "Left Handed",
  "bowling_style": "Off break",
  "teams": [
    "England",
    "England XI",
    "Matabeleland Tuskers",
    "Warwickshire",
    "Worcestershire",
    "Royal Challengers Bengaluru",
    "Kolkata Knight Riders",
    "Chennai Super Kings",
    "England Under-19",
    "Duronto Rajshahi",
    "England Lions",
    "Guyana Amazon Warriors",
    "Comilla Victorians",
    "Islamabad United",
    "Multan Sultans",
    "Cape Town Blitz",
    "Northern Warriors",
    "Team Abu Dhabi",
    "Birmingham Phoenix",
    "Team Morgan",
    "Morrisville Samp Army",
    "Joburg Super Kings",
    "Gulf Giants",
    "Sharjah Warriorz",
    "Chittagong Kings",
    "England Champions",
    "Gujarat Samp Army"
  ],
  "bio": "Born in 1987 in the city of Birmingham, Moeen Ali is fondly known as 'the beard that's feared' in his hometown. He was a teenage prodigy and destined for success due to his extraordinary skill set. Moeen was signed by Warwickshire as a 15-year-old and he didn't waste time impressing one and all. Ali also captained England in the 2006 Under-19 World Cup and took his team to the semi-final. Due to limited opportunities at Warwickshire, Moeen switched to the rival county team, Worcestershire. He played a vital role in his side winning the Pro-40 title in 2007 and one of his knocks, a blazing 46-ball century, was much talked about. After working hard in the domestic circuit and showing his all-around abilities, the national selectors finally picked him for the ODI series against West Indies and the World T20 that followed. It didn't take long for Moeen to break into the English Test team and that was also helped by the untimely retirement of Graeme Swann. His elegance with the bat and ability to bowl useful off-breaks played a big role in his selection. Ali made his Test debut against Sri Lanka at Lord's and in his very second Test, he almost saved the match for his team with a valiant century. Considered a part-time spinner, Moeen's career graph in Tests jumped to another level when he picked 19 wickets against the touring Indian team and surprised many. Always open to learning, it was later known that Ali benefited from the technical advice of Kumar Dharmasena, who was an umpire in the series. Post that, his Test career went from strength to strength and he established himself as a key member of the England unit. His career in limited-overs cricket also went well side by side where he usually batted in the top order. However, things changed after the 2015 World Cup debacle and the selectors left him out of the ODI team so he could work on his red-ball bowling. The emergence of Alex Hales and Jason Roy at the top of the order increasingly made it tough for Moeen to get his place back but he never lost hope. Soon, he was picked by the selectors with a new role to bat in the lower order, and his useful bowling worked as a plus point. In the year 2017, against the visiting South African team, Moeen Ali created a record by becoming the first player in Test history to take 25 wickets and score 250-plus runs in a 4-match Test series. Ali was named in the England squad for the 2019 World Cup, and they went on to lift the trophy. In 2020, he captained England for the first time in a T20I against Australia. He became an integral part of England in all three formats. He was part of the England squad for the 2021 World T20, and the following year, England lifted the 2022 World T20 trophy. Coming to his domestic exploits, particularly in the Indian Premier League, he was picked up by Bengaluru for the 2018 season but was not given a chance straightaway as Bengaluru had some good all-rounders in their ranks but he was given a chance in the 4th game of the season, and he accepted this chance gleefully as he went on to score a match-winning knock of 64. His consistent show, whenever given a chance, prompted Bengaluru to retain him for the 2019 season, where he was once again good and struck 2 fifties for his side. He was not used much in the 2020 season and Bengaluru let go of him for the 2021 auction, where Chennai picked him up for a whopping INR 7 crore. Other than this, he was picked up by Multan for the 2020 Pakistan T20 League. Birmingham Phoenix signed him for the Men's Hundred and made him captain. He was then retained by Chennai for the 2022 and 2023 editions of the Indian Premier League as well, winning the trophy in the latter edition. Ali was retained for the 2024 season as well, but Kolkata picked him up in the auction for the 2025 edition. In 2023, he also came out of Test retirement to play in the Ashes after an injury to Jack Leach. He picked up his 200th Test wicket in the series by dismissing Steven Smith. He was then named in the 2024 T20 squad for England but announced his retirement from international cricket in the same year.",
  "nationality": "England",
  "career_span": {
    "Test": "2014-2023",
    "ODI": "2014-2023",
    "IPL": "2018-2025"
  }
}