{
  "id": "pprofile_61837",
  "type": "player_bio",
  "player": "Sanju Samson",
  "full_name": "Sanju Viswanath Samson",
  "dob": "November 11, 1994",
  "role": "Wicket-Keeper",
  "batting_style": "Right Handed",
  "bowling_style": "-",
  "teams": [
    "India",
    "India A",
    "South Zone",
    "Delhi Capitals",
    "Rajasthan Royals",
    "India Under-19",
    "Kerala",
    "KCA Tuskers",
    "KCA Tigers",
    "Kochi Blue Tigers",
    "India D"
  ],
  "bio": "Sanju Samson is a right-handed wicket-keeper batter and is considered to be one of the most gifted batters in Indian cricket. Samson sees himself as a top-order batter and has an incredible ability to score briskly in an elegant manner. Samson made his first-class debut for Kerala at the age of 17, in the year 2012. After an impressive debut season, he earned himself a spot in the U-19 Asia Cup squad. He caught the attention of the selectors on the back of successful outings in the domestic circuit. Samson made his T20I debut against Zimbabwe in 2015 but later found himself away from the national side and decided to focus on his growth. Samson was picked by Rajasthan in 2013 to play in the Indian Premier League. Rahul Dravid always saw him as a batter with huge potential. When Rajasthan was banned for two seasons, Samson followed Dravid and joined Delhi for a couple of years. Ever since returning to Rajasthan, Samson has shown tremendous growth with Rajasthan, and hence the franchise decided to make him the captain of the side in 2021. He had a wonderful 2022 Indian Premier League season where he took his team to the final but failed to lift the trophy. His journey in the T20 format for India remained a mix of highs and lows, with opportunities coming sporadically. However, he continued to be a reliable run scorer while leading Rajasthan in the IPL. A member of India’s victorious 2024 T20 World Cup squad, Samson didn’t get a game but still cherished being part of a historic triumph. After the World Cup, his form remained inconsistent, but he finished the year on a high, smashing three centuries in his last five T20 innings, two of them on challenging South African pitches, reminding everyone of his class and ability to dominate attacks. Due to stiff competition for the wicketkeeper's spot, Samson missed out on the 2025 Champions Trophy, where India went on to win the title.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "2021-2023",
    "IPL": "2013-2025"
  }
}