{
  "id": "pprofile_4285",
  "type": "player_bio",
  "player": "Saurabh Tiwary",
  "full_name": "Saurabh Sunil Tiwary",
  "dob": "December 30, 1989",
  "role": "Batsman",
  "batting_style": "Left Handed",
  "bowling_style": "Off break",
  "teams": [
    "India",
    "East Zone",
    "India Blue",
    "Indian Board Presidents XI",
    "India Green",
    "India Red",
    "Royal Challengers Bengaluru",
    "Delhi Capitals",
    "Mumbai Indians",
    "India Under-19",
    "Jharkhand",
    "Rising Pune Supergiant",
    "Manipal Tigers",
    "Chhattisgarh Warriors",
    "Dubai Giants",
    "Indian Royals",
    "India Champions",
    "Nuwara Eliya Kings",
    "Haryana Gladiators",
    "Big Boys",
    "India Masters",
    "Rest of Asian Stars",
    "African Lions"
  ],
  "bio": "The long mane, the flashy hitting and Jharkhand. If you were wondering throwback Dhoni, we understand and in fact you can probably only get that close to guessing Dhoni’s left-handed doppelganger, Saurabh Tiwary. Born in Bihar, Saurabh was brought up in Jamshedpur and he made his Ranji Trophy debut for Jharkhand in the 2006-07 season. He was also a part of the victorious Under-19 squad that lifted the World Cup under the leadership of Virat Kohli in 2008. Saurabh was always well known for his useful knocks in the middle-order. His moment of reckoning came two years later. Playing for Mumbai in the 2010 edition of the Indian T20 League, Saurabh was his side’s second highest run-getter, with 419 runs from 16 games. Only, the Master Blaster, Sachin Tendulkar, was ahead of him. His tally of 18 sixes in that season was the highest from any Mumbai batsman and 5th highest overall. And this was not just it. He also scored three centuries for Jharkhand in the Ranji Trophy. But after that one prosperous season in the Indian T20 League, Saurabh’s performances started to dip and he played for 4 different teams over the next 6 years, before coming back to Blue and Gold in 2017. Having played just 1 game in the 2017 edition and none after, Saurabh will look to make the most of the opportunities that come by him whenever he gets on the field in the 2020 edition.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "2010-2010",
    "IPL": "2008-2021"
  }
}