{
  "id": "pprofile_64149",
  "type": "player_bio",
  "player": "Tom Curran",
  "full_name": "Thomas Kevin Curran",
  "dob": "March 12, 1995",
  "role": "All-Rounder",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm fast medium",
  "teams": [
    "England",
    "England XI",
    "Surrey",
    "Royal Challengers Bengaluru",
    "Kolkata Knight Riders",
    "Delhi Capitals",
    "Rajasthan Royals",
    "Hobart Hurricanes",
    "Melbourne Stars",
    "Sydney Sixers",
    "England Lions",
    "Trinbago Knight Riders",
    "Islamabad United",
    "Lahore Qalandars",
    "South",
    "Cape Town Knight Riders",
    "Kerala Knights",
    "Tshwane Spartans",
    "Oval Invincibles",
    "Team Morgan",
    "Desert Vipers",
    "Gulf Giants",
    "Cape Town Samp Army"
  ],
  "bio": "Tom Curran is a South African-born English cricketer who represents Surrey in County cricket. His father was a former Zimbabwe International cricketer, and his younger brother, Sam Curran, is also a regular member of the English team. With impressive performance at the school level, in 2012, Tom got a chance to represent the Surrey second XI. With his skill set and the talent that he had, Tom had the ability to consistently clock 140-plus kph away swinging deliveries. With pace to his fore, Tom Curran finally got selected in the England performance squad in September 2015, and in the next month, he completed his residential qualification for England. Tom Curran has grown a lot and has a handy experience of more than 50 first-class games. He has matured with time and turned out to be a high-class performer. With the amount of domestic exposure that he had, in June 2017, Curran was finally drafted into the England national side for a T20I series against South Africa. His debut match was decent enough, and everyone was impressed with his pace and guile. Due to injuries to the preferred fast bowlers in the Test format, Tom Curran was selected for the 2017-18 Ashes, and he also made his debut in Melbourne. Being a bowling all-rounder, although Tom did not find much success in the red-ball format, his ability to swing the ball and also contribute with the bat kept him in contention for the white-ball format. Believing in Curran's ability, England named him in their 2019 Cricket World Cup squad. Tom Curran was earlier a part of the Kolkata franchise, where he replaced the injured Mitchell Johnson in 2018, but ahead of the 13th edition of the Indian Premier League, Rajasthan bought the quality English all-rounder for INR 1 crore. After a dismal season with them, Tom was released from the squad, and Delhi bagged him for 2021. In the maiden season of The Hundred, Curran was a member of the Oval Invincibles setup, and despite an ordinary campaign, he was retained by the franchise. The end of 2021 was one that Curran did not envisage, as a stress fracture of the back ruled him out of the 2021–22 Big Bash League, and rehabilitation continued till midway through the next year. After returning to cricket in February 2023, the all-rounder decided to take an indefinite break from red-ball cricket in order to focus on his white-ball career and avoid injuries in the future. The 2023–24 edition of the Big Bash League for Curran was affected by a controversy where the English all-rounder was handed a four-game ban for a pre-match altercation with a match official. Having been picked up by Bengaluru in the Indian Premier League auction for the 2024 season, Curran was supposed to be one of the leading pacers for the team, but an untimely injury ruled him out of the tournament.",
  "nationality": "England",
  "career_span": {
    "Test": "2017-2018",
    "ODI": "2017-2021",
    "IPL": "2018-2021"
  }
}