{
  "id": "pprofile_73830",
  "type": "player_bio",
  "player": "Matheesha Pathirana",
  "full_name": "Matheesha Pathirana",
  "dob": "December 18, 2002",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm fast",
  "teams": [
    "Sri Lanka",
    "Nondescripts Cricket Club",
    "Sri Lanka A",
    "Chennai Super Kings",
    "Sri Lanka Under-19",
    "Rangpur Riders",
    "Trinbago Knight Riders",
    "Kandy",
    "Bangla Tigers",
    "Colombo Strikers",
    "Kandy Falcons",
    "SLC Blues",
    "SLC Reds",
    "SLC Greys",
    "Jaffna",
    "New York Strikers",
    "Joburg Super Kings",
    "Desert Vipers",
    "Colombo Jaguars"
  ],
  "bio": "Dubbed the Next Lasith Malinga, Matheesha Pathirana was born on December 18, 2002, in Kandy, Sri Lanka. He too, possesses a distinctive slinging bowling action coupled with impressive raw pace clocking regularly at above 145 KPH. His prowess came to the forefront during a college match in 2019. In that game, Pathirana left spectators awestruck as he claimed an exceptional 6 wickets and conceded just 7 runs. What truly stood out was his ability to consistently deliver yorkers, a skill set that troubled the opposition batters throughout the match. Pathirana's remarkable performance not only showcased his talent but also underscored his potential as a formidable fast bowler. In the subsequent year, the young slinger earned a spot in the Sri Lanka U19 team for the ICC Under-19 Cricket World Cup 2020, held in South Africa. Though he was part of the playing XI for just a couple of games, he did display his initial prowess as a bowler. Following the tournament, the young Sri Lankan attracted numerous eyeballs, including those of Indian Premier League scouts. And eventually, Matheesha Pathirana was selected by the then three-time champions, Chennai, for the 2020 edition even before he had played a single T20I game. And since then, he has been part of the squad of CHENNAI, and has consistently played well for them. Cut to May 2022, he was added to the Sri Lankan squad in the T20I series against Australia but unfortunately didn’t get an opportunity to make it to the playing XI. But eventually, in August of the same year, he got a chance to don the Lankan blues against Afghanistan in Dubai in the T20I series, and this inclusion was followed in their New Zealand tour in 2023 as well. In the same tour, he bagged an opportunity to debut in the ODI as well. Though Pathirana hasn’t got any opportunity in the longest format as yet, as also hinted by MS Dhoni in a post-match presentation of an Indian Premier League game, that he shouldn’t think to play in the Test format, as it could break his body. But he continues to impress in franchise cricket across the globe. In the inaugural season of the International League T20, he was part of the Desert Vipers. He made his IPL debut in the 2022 edition against Gujarat Titans. On his very first ball, he dismissed Shubman Gill, becoming the first Sri Lankan and the ninth player overall to achieve this feat in IPL history. In July 2022, he was signed by the Kandy Falcons for the third edition of the Lanka Premier League. Pathirana made history in 2023 by becoming the youngest overseas player to win an IPL title, as he was part of CSK's victorious campaign. He finished the 2023 IPL season on a high, picking up 19 wickets. Later that year, in June, Sri Lanka Cricket announced their 15-member squad for the ICC ODI World Cup qualifiers, with Pathirana being included. In the first T20I against Afghanistan, Pathirana delivered a match-winning performance, taking 4 wickets for 24 runs, including 2 crucial wickets in the penultimate over. In May 2024, Matheesha Pathirana was named to Sri Lanka’s squad for the 2024 ICC Men’s T20 World Cup, though he could only pick up three wickets in three matches. In the 2024 edition of the IPL, he played only six matches but impressed with 13 wickets, including his best IPL figures of 4/28. Despite playing fewer games, CSK trusted his death-over skills and retained the right-arm quick for the 2025 IPL season.",
  "nationality": "Sri Lanka",
  "career_span": {
    "Test": "",
    "ODI": "2023-2023",
    "IPL": "2022-2025"
  }
}