{
  "id": "pprofile_71288",
  "type": "player_bio",
  "player": "Ravi Bishnoi",
  "full_name": "Ravi Bishnoi",
  "dob": "September 5, 2000",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Leg break googly",
  "teams": [
    "India",
    "India A",
    "Punjab Kings",
    "India Under-19",
    "Gujarat",
    "Rajasthan",
    "India A Under-19",
    "India B Under-19",
    "Lucknow Super Giants",
    "DY Patil Group B"
  ],
  "bio": "Ravi Bishnoi, a skilled leg-spinner, hails from Jodhpur in Rajasthan. With no formal cricket academy available in his early years, Bishnoi, along with his friends and coaches, took the initiative to establish their own academy, demonstrating his determination and passion for cricket. Despite facing setbacks and rejections, Bishnoi's perseverance paid off when he secured a spot in Rajasthan's U-19 squad. In 2019, he further progressed by making his T20 and List-A debuts for Rajasthan. However, his standout moment came at the ICC Under-19 World Cup in 2020, where he became the tournament's highest wicket-taker, claiming 17 wickets. Bishnoi's remarkable performances earned him a place in the Indian Premier League, where Punjab signed him for the 2020 season. After two successful years with Punjab, Bishnoi moved to Lucknow for the 2022 season. His rise continued when he was selected for India’s T20I squad for the series against the West Indies in 2022. Bishnoi impressed on his T20I debut, taking two wickets and earning the Player of the Match award. Later that year, he made his ODI debut against South Africa. Ahead of the 2023-24 domestic season, Bishnoi transferred from Rajasthan to Gujarat in pursuit of new opportunities. While many considered him a strong contender for India's squad in the 2024 T20 World Cup, where India eventually triumphed, Bishnoi narrowly missed out, with Yuzvendra Chahal being selected ahead of him. His consistent performances for Lucknow in the IPL helped cement his place in the franchise, leading to his retention for the 2025 edition of the tournament.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "2022-2022",
    "IPL": "2020-2025"
  }
}