{
  "id": "pprofile_4357",
  "type": "player_bio",
  "player": "Rilee Rossouw",
  "full_name": "Rilee Roscoe Rossouw",
  "dob": "October 9, 1989",
  "role": "Batsman",
  "batting_style": "Left Handed",
  "bowling_style": "Off break",
  "teams": [
    "South Africa",
    "Free State",
    "Hampshire",
    "Leicestershire",
    "South Africa A",
    "South African Invitation XI",
    "Royal Challengers Bengaluru",
    "Punjab Kings",
    "Delhi Capitals",
    "Diamond Eagles",
    "South Africa Under-19",
    "Somerset",
    "Melbourne Renegades",
    "Sydney Thunder",
    "Basnahira Cricket Dundee",
    "Knights",
    "Rangpur Riders",
    "Saint Lucia Kings",
    "Trinbago Knight Riders",
    "St Kitts and Nevis Patriots",
    "Quetta Gladiators",
    "Khulna Tigers",
    "Bangla Tigers",
    "Maratha Arabians",
    "Multan Sultans",
    "Tshwane Spartans",
    "Rajputs",
    "Delhi Bulls",
    "Deccan Gladiators",
    "Oval Invincibles",
    "Dambulla Sixers",
    "Jaffna Kings",
    "Pretoria Capitals",
    "Los Angeles Knight Riders"
  ],
  "bio": "A top-rated left-handed batter, Rilee Rossouw made his first-class debut for Free State in 2007 against the Easterns. He was selected in South Africa’s Under-19 squad for the 2008 World Cup and has also been part of South Africa's A squad. His Twenty20 debut for the Eagles came in 2008, following which he finished as the highest run-getter for the Eagles in the 2008-09 domestic season. His century against the Cape Cobras next season saw him becoming one of the youngest South Africans to make 1000 first-class runs. He was a consistent performer in domestic cricket, but couldn't break into the national side due to the strong competition and quality players already in the squad. Finally, in 2014, he got his opportunity and made his ODI debut against Zimbabwe. However, he had a horror start to his career as he made four ducks in his first six innings, but the selectors kept faith in him and included him in the T20I squad against Australia where he scored a brilliant 78 in his first game. Rossouw picked up form and scored his first hundred against West Indies in 2014 and represented South Africa in the ODI World Cup the following year scoring 210 runs in 6 matches. In 2016, he scored an exceptional 122 against Australia where the Proteas beat them 5-0 and he was the Player of the Series. However, in 2017, he announced that he had signed a Kolpak deal with Hampshire making him ineligible to play for his country. He made an instant impact smacking 156 runs against Somerset in the Royal One Day Cup which was his career best back then. Due to Brexit, he could only play County as an overseas player and ultimately returned to South Africa in 2022. Rossouw came back with a bang scoring an unbeaten 96 against England and two T20I hundreds against India and Bangladesh. He played in the 2022 T20 World Cup and will hope that he continues to serve his nation. Signing the Kolpak deal made Rossouw a hot property in T20 Leagues around the world. Even though he was part of the Bangalore side in the 2011 Indian Premier League, he made his debut in 2014. He was the leading run-scorer in the 2018-19 Bangladesh T20 League. In 2019, he won the Pakistan T20 League with Quetta, and then with Multan in 2021. In 2022, he made it to the final with Multan again scoring 275 runs but couldn't lift the trophy. He has also played for Sydney and Melbourne in the Australian T20 League and for Oval in the Hundred. In the SA20, he represents Pretoria. Looking at his form and abilities, Punjab bought him in the 2024 Indian Premier League auction for 8 crores INR, and he will be a key player for them, and would also want to do well individually as well with the T20 World Cup just around the corner.",
  "nationality": "South Africa",
  "career_span": {
    "Test": "",
    "ODI": "2014-2016",
    "IPL": "2014-2024"
  }
}