{
  "id": "pprofile_3782",
  "type": "player_bio",
  "player": "Shakib Al Hasan",
  "full_name": "Shakib Al Hasan",
  "dob": "March 24, 1987",
  "role": "All-Rounder",
  "batting_style": "Left Handed",
  "bowling_style": "Slow left-arm orthodox",
  "teams": [
    "Bangladesh",
    "ICC World XI",
    "Bangladesh A",
    "Bangladesh Invitation XI",
    "Khulna Division",
    "Leicestershire",
    "Surrey",
    "Worcestershire",
    "Kolkata Knight Riders",
    "Bangladesh Under-19",
    "Adelaide Strikers",
    "Melbourne Renegades",
    "Dhaka Gladiators",
    "Khulna Royal Bengals",
    "Uthura Rudras",
    "Bangladesh Cricket Board XI",
    "Sunrisers Hyderabad",
    "Rangpur Riders",
    "Bangladesh Central Zone",
    "Bangladesh South Zone",
    "Barbados Royals",
    "Guyana Amazon Warriors",
    "Jamaica Tallawahs",
    "Prime Bank Cricket Club",
    "Abahani Limited",
    "Kalabagan Krira Chakra",
    "Sheikh Jamal Dhanmondi Club",
    "Mohammedan Sporting Club",
    "Legends of Rupganj",
    "Dhaka Capitals",
    "Karachi Kings",
    "Lahore Qalandars",
    "Peshawar Zalmi",
    "Bangla Tigers",
    "Kerala Knights",
    "Montreal Tigers",
    "Brampton Wolves",
    "Galle Marvels",
    "Fortune Barishal",
    "Gemcon Khulna",
    "Dubai Capitals",
    "Chittagong Kings",
    "Los Angeles Knight Riders",
    "Bangla Tigers Mississauga",
    "Dubai Giants",
    "Antigua & Barbuda Falcons",
    "Los Angeles Waves CC",
    "Rest of Asian Stars",
    "Miami Blaze"
  ],
  "bio": "Considered by many the most outstanding player to wear the Bangladesh national colors, Shakib Al Hasan has proved that he is one of the best all-rounders of his generation. Born on 24th March 1987 in the Khulna District of Bangladesh, he started playing cricket at an early age and represented several local teams and villages. His talent was identified from these local grounds and he had a 6-month stint in the prestigious Bangladesh Krira Shikkha Protishtan (BKSP) institute before playing for Bangladesh U-17. He made his first-class debut for Bangladesh Cricket Board XI against Zimbabwe at the start of 2005 and played his first U19 game in the Afro-Asia U19 Cup towards the end of the year. He made his List A debut for Bangladesh A the following year against Sri Lanka A and it was pretty evident that his skill levels exceeded that of his peers. He made his ODI debut in the second alf of 2006 when Bangladesh toured Zimbabwe and later that year made his T20 debut straight at the international level when they played a one-off game against the same opponent at home. He was included in the Bangladesh squad for the 2007 ICC Cricket World Cup and played a crucial role in helping his team reach the knockout stages. Shakib also played in the T20 World Cup that year, and in the match against West Indies, he picked up four wickets, which was the first time a Bangladesh player achieved that feat in T20Is. He made his Test debut against India at home in the series post-World Cup and soon became a useful operator in all three formats of the game. Up until 2008, Shakib was considered a batter with part-time spin as an added skill set but when they faced New Zealand towards the end of the year, he was deployed as a front-line bowler. The move paid rich dividends as he claimed his maiden five-wicket haul, ending with 7 wickets. At the start of 2009, Shakib was rated the number one ODI all-rounder in the world but his team's fortunes were on a decline. This prompted the Bangladesh Cricket Board to replace their captain and Shakib was in contention to take the role. However, they decided not to burden their star player and made him deputy to Mashrafe Mortaza. During the tour of the West Indies, Mashrafe suffered an injury and Shakib became the then youngest Bangladesh captain at the age of 22 for the second Test. Under his leadership, Bangladesh secured their first overseas series win and he led from the front claiming both the Player of the Match and the Player of the Series Award. With his explosive batting style and a vast array of strokes, he became a master of T20 cricket. He became an integral part of several T20 leagues worldwide for several years and performed at the highest level. He has even tasted success with the Kolkata franchise, winning titles with them in 2012 and 2014. Shakib Al Hasan bats in the middle order for Bangladesh as well as the franchise teams. He is a free-scoring batter with the ability to up the ante at will. He is crafty with his spin bowling variations, and his all-around abilities make him a valuable asset for any side. He got his maiden ODI five-wicket haul against Zimbabwe towards the end of 2015 and showed his proficiency in the T20 format of the game three years later when he claimed his maiden T20I five-fer against West Indies. In 2017, after the retirement of Mashrafe, Shakib was appointed as T20I captain and later that year was handed the Test captaincy as well. Later that year, Shakib became the fourth bowler in the history of the game back then to take 5-wicket hauls against all Test-playing nations barring Afghanistan and Ireland. The 2019 World Cup was full of records for Shakib as he continued to perform at the highest level. In the first game, he became the then fastest cricketer to reach 250 wickets and 5000 runs in ODI as he got there in 199 games. In the same tournament, he became the first Bangladesh player to score 1000 runs in World Cup games also becoming the first player to score 600 runs and take 10 wickets in a single edition of the mega event. He became the second cricketer after Yuvraj Singh to claim a 5-wicket haul and score a half-century in a World Cup match. He was picked for the Team of the Tournament by the ICC for his exploits in the competition. He returned to play for the national side towards the end of 2020 after a one-year ban and was picked in the squad for the 2021 ICC Men’s T20 World Cup. At the start of 2022, he was named in the ICC Men’s ODI Team of the Year and was later appointed as the captain for the Asia Cup and the 2022 ICC Men’s World Cup. Having missed out on the 2022 edition of the Indian T20 League, Shakib was re-signed by the Kolkata franchise for the competition in 2023. In the same year, he completed 300 wickets in ODIs in a match against England and was also named as the ODI captain for the Asia Cup and the World Cup after Tamim Iqbal stepped down. He was also part of the national team for the 2024 T20 World Cup but announced his retirement from the T20Is after the mega event. Shakib then played two away Tests against India and retired from that format as well. He wanted to finish his Test career at home in the series against South Africa but could not travel due to security reasons. Shakib also confirmed that he will completely retire from international cricket after the 2025 Champions Trophy.",
  "nationality": "Bangladesh",
  "career_span": {
    "Test": "2007-2024",
    "ODI": "2006-2023",
    "IPL": "2011-2021"
  }
}