{
  "id": "pprofile_58635",
  "type": "player_bio",
  "player": "Ashton Turner",
  "full_name": "Ashton James Turner",
  "dob": "January 25, 1993",
  "role": "Batsman",
  "batting_style": "Right Handed",
  "bowling_style": "Off break",
  "teams": [
    "Australia",
    "Australia A",
    "Durham",
    "Lancashire",
    "Worcestershire",
    "Rajasthan Royals",
    "Western Australia",
    "Australia Under-19",
    "Perth Scorchers",
    "Western Australia Chairman XI",
    "Cricket Australia Invitational XI",
    "National Performance Squad",
    "Cricket Australia XI",
    "Australians",
    "Multan Sultans",
    "London Spirit",
    "Manchester Originals",
    "Lucknow Super Giants",
    "Pretoria Capitals",
    "Western Australia XI",
    "Bulawayo Brave Jaguars"
  ],
  "bio": "An off-spinner and a useful batsman, Turner represented Western Australia at U15, U17 and U19 levels. He led the U17 team to National Championships victory. The youngster shone with eight wickets from six matches for the Australian U19 team in a quadrangular tournament involving Indian, Sri Lankan and West Indian U19 teams when he toured India in 2011. His impressive performances in the ICC U19 Cricket World Cup, scalping 11 wickets from six matches including his best figures of 4/28 against Nepal, helped him achieve a rookie contract with the Western Australian Cricket Association (WACA) for the 2012–13 season. A string of good performances helped him attain a place in the Western Australia List-A squad. He shone on debut with figures of 1/32 from 6 overs and 51 off 43 balls against Tasmania. Turner was one of six players selected to spend the 2013 Australian winter for English club teams as a part of a development program organized by Cricket Australia and Hampshire County Cricket Club. He played for Chichester Priory Park in the Sussex Cricket League during that period. Turner also got to spend valuable time with the Australian Ashes squad in 2013. He made his first-class debut for the Australians against Sussex in July 2013. Turner's international career took off when he was named in Australia's Twenty20 International (T20I) squad for the series against Sri Lanka in February 2017. He made his T20I debut at the Melbourne Cricket Ground on February 17, 2017. In February 2019, he earned a spot in Australia's One Day International (ODI) squad for the series against India, making a memorable debut with an unbeaten 84 off 43 balls, securing the Player of the Match award. The Indian T20 League witnessed Turner's presence when he was bought by Rajasthan in the player auction for the 2019 season. Despite facing a challenging moment with five consecutive ducks in Twenty20 cricket, he continued to be a sought-after player. Released by Rajasthan before the 2020 auction, three years later, Turner is set to make a comeback in the league after being bought by Lucknow in the 2024 auction. As Ashton Turner continues to evolve as a dynamic all-rounder, his presence promises to add firepower to any team, blending explosive batting with valuable contributions in bowling and fielding.",
  "nationality": "Australia",
  "career_span": {
    "Test": "",
    "ODI": "2019-2021",
    "IPL": "2019-2024"
  }
}