{
  "id": "pprofile_82442",
  "type": "player_bio",
  "player": "Abishek Porel",
  "full_name": "Abishek Porel",
  "dob": "October 17, 2002",
  "role": "Wicket Keeper",
  "batting_style": "Left Handed",
  "bowling_style": "-",
  "teams": [
    "East Zone",
    "India A",
    "Delhi Capitals",
    "India Under-19",
    "Bengal",
    "India C",
    "India A Under-19",
    "Tapan Memorial Club",
    "Durgapur Dazzlers",
    "Bengal U-19",
    "Lux Shyam Kolkata Tigers"
  ],
  "bio": "Abishek Porel is a left-handed wicketkeeper batter from India. He began his professional career by representing Bengal at the junior level. Despite a prolific showing in the 2022 Cooch Behar Trophy, low performances in the Challenger Trophy meant he was not selected for the 2022 Men’s Under-19 World Cup held in the West Indies. However, he was called up mid-tournament as a backup for the players infected with COVID. After returning from the World Cup, he was fast-tracked to the senior Bengal team, and he made his first-class debut against Baroda in the 2021–22 Ranji Trophy season. Later in the year, he made his List A debut for Bengal against Puducherry in the 2022 Vijay Hazare Trophy. In October 2022, Porel made his T20 debut against Odisha in the 2022 Syded Mushtaq Ali Trophy. Before the 2023 Indian Premier League season, the Delhi franchise was in search of a replacement for the injured Rishabh Pant. Abishek Porel was called up to the trials, where he showed glimpses of his talent and put on an impressive showing. As a result, the Delhi franchise signed him up for the 2023 Indian Premier League. Abishek Porel bats in the middle order for Bengal in the first-class and List-A formats, while in the T20 format, he opens the innings for them. He is a free-scoring batter and has the ability to find boundaries at regular intervals. His glovework is equally good and can turn out to be the perfect replacement for Rishabh Pant. Abishek Porel's talents have not gone unnoticed in the Indian Premier League, where he had the opportunity to represent Delhi. His stint with the franchise provided him with exposure to top-tier cricket and the opportunity to test his skills against some of the best players in the world. Porel's experience in the Indian Premier League has undoubtedly contributed to his growth as a cricketer, allowing him to refine his game and adapt to the demands of the shortest format of the game. Abishek Porel's journey from grassroots cricket to the professional arena is a testament to his talent, dedication, and unwavering commitment to the sport. As he continues to make strides in domestic cricket and beyond, Porel remains a shining example of the rich cricketing talent that India possesses. With his left-handed batting flair and adept wicket-keeping skills, Porel is poised to leave a lasting impact on the game and carve out a legacy worthy of admiration and respect.",
  "nationality": "India",
  "career_span": {
    "IPL": "2023-2025"
  }
}