{
  "id": "pprofile_63748",
  "type": "player_bio",
  "player": "Deepak Hooda",
  "full_name": "Deepak Jagbir Hooda",
  "dob": "April 19, 1995",
  "role": "All Rounder",
  "batting_style": "Right Handed",
  "bowling_style": "Off break",
  "teams": [
    "India",
    "India A",
    "India B",
    "India Blue",
    "West Zone",
    "Punjab Kings",
    "Chennai Super Kings",
    "Rajasthan Royals",
    "India Under-19",
    "Rajasthan",
    "Baroda",
    "Sunrisers Hyderabad",
    "India Under-23",
    "Lucknow Super Giants",
    "Jaanbaaz Kota Challengers"
  ],
  "bio": "Deepak Hooda, born in Rohtak, is a very experienced domestic Indian cricketer who played for Baroda before moving to Rajasthan ahead of the 2022 domestic season. Deepak is a tall, right-handed middle-order batter, who is more than a handy off-spinner. He made his first-class debut in the 2012-13 season and smashed a hundred in his debut game, becoming only the second player to do so for Baroda. Hooda was also a part of India's U-19 squad for the 2014 World Cup but it was his domestic performance that earned him a call-up in the Indian T20 League for the 2015 edition. It was Rajasthan who bought him ahead of the season. He scored his maiden fifty in the second game itself against Delhi. Although, his best years in this League, came with Hyderabad as he was bought by them ahead of the 2016 season which they won. Hooda played a few handy knocks and went on to represent them until the 2019 season. In the next two seasons, Deepak Hooda went unnoticed, but in the mega auction of 2022, Lucknow showed faith in his talent and signed him. Going through a rough patch in his career after his issues with the Baroda Cricket Association, Hooda needed a breakthrough season to re-establish himself. With the Lucknow franchise, Hooda received support and guidance and went on the path of resurrection. Deepak Hooda scored 451 runs in the 2022 season of the Indian T20 League - by far his best, and soon he was selected for the national team. With many senior Indian players rested, Hooda made full use of the opportunities. During a T20I match against Ireland in Dublin, he hammered a 57-ball 104 to prove his mettle and put his name alongside Suresh Raina, Rohit Sharma, and KL Rahul as only the fourth centurion in this format for India. His outstanding contributions led to his selection in India's squad for the 2022 ICC T20 World Cup, cementing Deepak Hooda's position as a valuable asset in the Indian cricket team. However, Hooda had a forgetful 2023 as his form in the Indian T20 League dipped and he hardly got any chances to play for the national team and fell behind in the pecking order. Facing a challenging 2024 IPL season, where he scored only 145 runs, including just one fifty. However, determined to get back into the groove, Hooda worked tirelessly in the domestic circuit to rediscover his rhythm. In October 2024, during a crucial Ranji Trophy match against Pondicherry, Hooda showed his resilience and leadership. As the captain of the Rajasthan team, he stepped up when the team needed him most. Hooda played a vital innings, scoring 105 runs off 171 balls, a composed and gritty knock that helped Rajasthan take the lead in the match. Hooda was released by Lucknow Super Giants ahead of the IPL 2025 season and did not have his services retained through the Right to Match (RTM) card. However, his fortunes changed when Chennai Super Kings (CSK) recognized his potential and acquired him at the IPL Mega Auction for INR 1.70 crores. This move marked a fresh start for Hooda with a new team.",
  "nationality": "India",
  "career_span": {
    "ODI": "2022",
    "IPL": "2015-2025"
  }
}