{
  "id": "pprofile_12518",
  "type": "player_bio",
  "player": "Rassie van der Dussen",
  "full_name": "Hendrik Erasmus van der Dussen",
  "dob": "February 7, 1989",
  "role": "Batsman",
  "batting_style": "Right Handed",
  "bowling_style": "Leg break",
  "teams": [
    "South Africa",
    "Northerns",
    "North West Dragons",
    "South Africa A",
    "Rajasthan Royals",
    "DP World Lions",
    "Rangpur Riders",
    "Barbados Royals",
    "St Kitts and Nevis Patriots",
    "Islamabad United",
    "Lahore Qalandars",
    "Cape Town Knight Riders",
    "Bangla Tigers",
    "Toronto Nationals",
    "Vancouver Knights",
    "Jozi Stars",
    "AB’s Eagles",
    "Chennai Brave Jaguars",
    "MI Cape Town",
    "NYS Lagos"
  ],
  "bio": "Hendrik Erasmus van der Dussen, also known as Rassie van der Dussen's journey to the international stage is a story of relentless pursuit and diverse experience. Having played cricket across South Africa, England, Ireland, the Netherlands, Canada, and the Caribbean, he was ready when the national selectors took notice, earning his T20I debut against Zimbabwe in October 2018. With an innate flair for aggressive batting, Rassie van der Dussen has seamlessly adapted his skills to the longer formats of the game. Alongside his on-field success, he also held the role of vice-captain for the Lions, further highlighting his leadership qualities. Rassie van der Dussen made his mark in the cricketing world during the 2017-18 Sunfoil Series, where he finished as the leading run-scorer with an impressive 959 runs from just ten matches. His standout performances continued in the 2018-19 CSA T20 Challenge, where he shared the top run-scorer spot. These achievements earned him a place in Gauteng's squad ahead of the 2021-22 home season for South Africa. Playing across continents and countries and featuring for several franchises throughout, including the Caribbean Premier League, the Global T20 Canada, Pakistan Super League, Rassie’s longing wait ended when he was named in the South African squad for a T20I series against Zimbabwe in 2018, and just a few months later, he became South Africa’s ODI cap number 131 in a series against Pakistan. Test series against England in 2019. In a remarkable ODI debut, he notched up 93, falling agonizingly close to a century, while finished the series with an impressive tally of 241 runs. Seeing his rapid progress in the limited overs, he became an obvious choice for the 2019 World Cup squad while eventually making his Test debut the same year against England and also receiving his maiden contract with South Africa Cricket in the year 2020. Rassie van der Dussen's breakthrough moment came in 2021 when he scored his maiden ODI century, becoming the oldest South African cricketer to do so at 32 years and 54 days. This achievement marked the beginning of his rise as a key figure in the national squad, where he became a regular in major ICC events and quickly made a name for himself in the franchise circuit. In South Africa's SA20, van der Dussen represents MI Cape Town, where he has established himself as a dynamic opener, lighting up the field from the very first ball. He played a crucial role in the team's title victory, finishing as the second-highest run-scorer with 393 runs from eleven innings.",
  "nationality": "South Africa",
  "career_span": {
    "Test": "2019-2022",
    "ODI": "2019-2025",
    "IPL": "2022-2022"
  }
}