{
  "id": "pprofile_66374",
  "type": "player_bio",
  "player": "Harry Brook",
  "full_name": "Harry Cherrington Brook",
  "dob": "February 22, 1999",
  "role": "Batsman",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm medium",
  "teams": [
    "England",
    "Yorkshire",
    "Delhi Capitals",
    "England Under-19",
    "Hobart Hurricanes",
    "Melbourne Stars",
    "England Lions",
    "Sunrisers Hyderabad",
    "Lahore Qalandars",
    "Northern Superchargers",
    "Joburg Super Kings"
  ],
  "bio": "Harry Brook, a dynamic right-handed batter from Keighley, West Yorkshire, made waves in the cricketing world since his early days. His journey began in local clubs and school teams, where his raw talent and flair with the bat set him apart. Brook made his first-class debut for Yorkshire against Pakistan A in 2016, at Headingley - an impressive feat while still attending school. He stepped into the County Championship in 2017, facing Middlesex at Lord’s, following standout performances for Yorkshire’s second XI. His T20 debut came in the 2018 T20 Blast. He also captained England in the 2018 U-19 World Cup. Brook ended up as the leading scorer for his side with 239 runs including a fine century against Bangladesh. He became the second English captain after Alastair Cook to hit a hundred in the U19 World Cup. Brook's consistent brilliance in domestic cricket, including a breathtaking unbeaten 102 off 49 balls for Lahore Qalandars in the Pakistan Super League, propelled him into the spotlight. Brook made his international debut for England in a T20I against the West Indies in 2022. He earned his Test cap in the same year against South Africa, and debuted in One Day Internationals (ODIs) in 2023, facing South Africa once again. In his early Test career, Brook achieved remarkable milestones, including becoming the fastest player to reach 800 Test runs in just nine innings breaking Vinod Kambli's record. He smashed his highest Test score of 186 against New Zealand, showcasing his ability to perform under pressure. Brook was also part of the England squad that won the 2022 T20 World Cup, contributing to the team's success on the global stage. Brook scored a remarkable 317 runs against Pakistan in 2024, marking the first triple-century by an English batsman in 34 years. In the same year, he also notched up his maiden ODI century in a series against Australia and helped them clinch it. In 2025, due to his excellent performances across all formats, he was named as the vice-captain of England for the white-ball teams. In franchise cricket, Brook has been a sought-after player. He was signed by the Northern Superchargers for The Hundred and played a pivotal role in their campaigns. In the Indian Premier League, he was acquired by Hyderabad in 2022 and scored his maiden IPL century against Kolkata in 2023, becoming the first player to score a century in both the PSL and IPL. After being released by Hyderabad, he was picked up by Delhi in the 2024 IPL Mini Auction. He pulled out due to personal reasons but was once again bought by them ahead of the 2025 season. Brook's dynamic batting and adaptability have made him a valuable asset in T20 leagues worldwide.",
  "nationality": "England",
  "career_span": {
    "Test": "2022-2025",
    "ODI": "2023-2025",
    "IPL": "2023-2023"
  }
}