{
  "id": "pprofile_4532",
  "type": "player_bio",
  "player": "Kedar Jadhav",
  "full_name": "Kedar Mahadav Jadhav",
  "dob": "March 26, 1985",
  "role": "Batsman",
  "batting_style": "Right Handed",
  "bowling_style": "Off break",
  "teams": [
    "India",
    "India A",
    "India B",
    "India Blue",
    "India Green",
    "India Red",
    "Rest of India",
    "West Zone",
    "Royal Challengers Bengaluru",
    "Chennai Super Kings",
    "Delhi Capitals",
    "Maharashtra",
    "Kochi Tuskers Kerala",
    "Sunrisers Hyderabad",
    "Kolhapur Tuskers",
    "Southern Super Stars",
    "Rajasthan Regals",
    "Rest of Asian Stars"
  ],
  "bio": "With 1223 runs in the 2013/14 Ranji Trophy season, Kedar Jadhav was the highest run-scorer, but he has not been able to secure a spot in the Indian Test team primarily due to rigorous challenges from other qualified players as well. Not letting this dishearten him, he decided to alter himself and be more presentable for the Limited Overs Internationals. Jadhav had a good technique and was belligerent when the situation demanded, but was limited in his variety of strokes at the beginning. Sensing this Achilles’ heel, he got into working on enlarging the scope of his hitting and to try and improvise more when on the field. Making his international debut in 2014, it took a while before he produced a scintillating knock and it came against England in early 2017 in the 1st ODI. Coming in to bat at No.6, Jadhav’s 120 (76) was a key fulcrum in India chasing down a target of 351 and he was awarded as the player of the match for the same. Besides this, on multiple occasions, Jadhav has helped India home and has displayed poise under trying circumstances. He is also a handy part-time offbreak bowler whose skills were extensively used by Dhoni to fill in the overs when needed or deliver breakthroughs for the team when regular bowlers were unable to do so. His slow, low bowling also made him a difficult prospect for the batsmen to go after. However, despite these nuances, Jadhav had shortcomings of his own such as being a leisurely fielder and contracting recurring hamstring injuries which only played spoilsport for a permanent spot for him in the team. Talking about his performances in the Indian T20 League, he was picked up by Bengaluru in 2016, after his stint with Delhi. However, he jumped ship and joined Chennai in 2018, but he missed most of the 2018 IPL, owing to an injury. He played well for the Yellow brigade in 2019, but again the next season, he disappointed and did not do well and was also dropped mid-way of the season, out of the starting XI. Before the 2021 IPL, Hyderabad picked him up for INR 2 crores in the auction. The chances of him coming back into the Indian team seem bleak with the talent that is cropping up and with him already in his mid-30s. He can still try to make a come back into the T20I squad, with a very strong 2021 IPL on his back, and that too before the 2021 World Cup T20I, could see him don the Indian blue again.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "2014-2020",
    "IPL": "2010-2023"
  }
}