{
  "id": "pprofile_65687",
  "type": "player_bio",
  "player": "Rajat Patidar",
  "full_name": "Rajat Manohar Patidar",
  "dob": "June 1, 1993",
  "role": "Batsman",
  "batting_style": "Right Handed",
  "bowling_style": "Off break",
  "teams": [
    "India",
    "Central Zone",
    "India A",
    "India B",
    "India Blue",
    "Royal Challengers Bengaluru",
    "Madhya Pradesh",
    "India C",
    "Gwalior Cheetahs",
    "Malwa Panthers"
  ],
  "bio": "Rajat Manohar Patidar is an Indian cricketer renowned for his skills as a right-handed batter. Steadily coming up the ranks, Patidar made his mark in the Indian domestic arena with consistent performances. In the 2018–19 Ranji Trophy, he emerged as Madhya Pradesh's leading run-scorer, amassing 713 runs. However, his defining moment came during the 2022 Indian Premier League season, when he scored a match-winning century in the playoffs for Bengaluru. His stellar performance earned him recognition, finishing the season with 333 runs in 8 matches. Retained by Bengaluru for the 2023 season, Patidar continued to impress, leading to his inclusion in India's ODI squad for the series against South Africa and New Zealand. Despite an Achilles heel injury in 2023, he bounced back strongly, emerging as the top run-scorer for Madhya Pradesh in the 2023/24 Vijay Hazare Trophy. Patidar's consistent displays earned him a spot in India's ODI squad for the tour of South Africa, making his debut in the 3rd ODI. Subsequently, he featured for India A against England Lions in a red-ball series, where his back-to-back centuries paved the way for his Test call-up for the series against England, replacing Virat Kohli. However, his maiden Test series didn't go as expected, ending with just 63 runs from 6 innings, with 32 being his highest score. Patidar returned to domestic cricket to refine his game and made a strong statement in 2024 with a blistering 159 off 102 balls against Haryana, reaching his century in just 68 deliveries. He led Madhya Pradesh to the Syed Mushtaq Ali Trophy final, where he fought a lone battle with an 81-run knock against Mumbai. Despite his side falling short, he finished the tournament as one of the top performers, amassing 428 runs in nine games. His biggest milestone, however, came in early 2025 when he was appointed captain of Bengaluru for the Indian Premier League.",
  "nationality": "India",
  "career_span": {
    "Test": "2024-2024",
    "ODI": "2023-2023",
    "IPL": "2021-2025"
  }
}