{
  "id": "pprofile_65478",
  "type": "player_bio",
  "player": "Tushar Deshpande",
  "full_name": "Tushar Uday Deshpande",
  "dob": "May 15, 1995",
  "role": "Bowler",
  "batting_style": "Left Handed",
  "bowling_style": "Right-arm medium",
  "teams": [
    "India",
    "India A",
    "India Blue",
    "West Zone",
    "Chennai Super Kings",
    "Delhi Capitals",
    "Rajasthan Royals",
    "Mumbai",
    "ARCS Andheri",
    "BPCL",
    "India D",
    "Mumbai South Central Maratha Royals"
  ],
  "bio": "Tushar Deshpande, a specialist right-arm medium-fast bowler, was born on May 15, 1995, in Mumbai. Emerging onto the Mumbai cricketing circuit, Deshpande made a significant impact during the 2015-16 season of the Cooch Behar Trophy, claiming 21 wickets in just four matches. His standout performances led to his selection in the Mumbai Ranji Trophy team the same year, making his debut against Tamil Nadu on September 19. In the Vijay Hazare Trophy held on September 19, 2018, he made his List A debut for Mumbai against Baroda at Alur, where he showcased his talent by securing a five-wicket haul during the competition's quarter-final. Deshpande's consistency in white-ball cricket earned him a spot in the India 'B' side for the Duleep Trophy in August 2019. This further highlighted his potential as a promising fast bowler in the domestic circuit, drawing attention from the teams of the Indian Premier League. In the IPL auction for the 2020 season, Deshpande was picked up by Delhi at his base price. Despite playing six games for the franchise and securing three wickets, it wasn't a standout season for the young cricketer. In the 2022 IPL mega auction, Deshpande’s talent didn’t go unnoticed, as Chennai acquired him at his base price of INR 20 lakhs. He featured in just a couple of games that season but was retained, and he repaid the franchise’s faith in 2023. With 21 wickets, the right-arm pacer played a pivotal role in Chennai’s title-winning campaign. Deshpande carried his strong form into 2024, delivering another stellar season, which eventually led to his T20I debut for India in Zimbabwe later that year. However, his progress hit a roadblock when he underwent ankle surgery in October 2024, ruling him out of the Syed Mushtaq Ali Trophy, which Mumbai went on to win. Ahead of the 2025 IPL auction, Chennai released Deshpande, and he was subsequently picked up by Rajasthan.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "",
    "IPL": "2020-2025"
  }
}