{
  "id": "pprofile_57444",
  "type": "player_bio",
  "player": "Daryl Mitchell",
  "full_name": "Daryl Josef Mitchell",
  "dob": "May 20, 1991",
  "role": "All-Rounder",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm medium",
  "teams": [
    "New Zealand",
    "Canterbury",
    "Lancashire",
    "Northern Districts",
    "New Zealand A",
    "Chennai Super Kings",
    "Rajasthan Royals",
    "Middlesex",
    "New Zealand XI",
    "Lahore Qalandars",
    "New Zealanders",
    "London Spirit",
    "Texas Super Kings"
  ],
  "bio": "Daryl Mitchell is a professional cricketer who hails from New Zealand. Born on May 20, 1991, in Hamilton, New Zealand, Mitchell is the son of the former New Zealand Rugby coach John Mitchell. He is a right-handed batter who complements his batting prowess with his right-arm medium-pace bowling as well. He made his first-class debut for the Northern Districts during the 2011-12 season, and it didn’t take him long to get noticed for his fabulous and consistent performances across the circuit. The Super Smash season of 2018 earned him the due reward as he performed exceptionally well in it and got his maiden T20I cap against India in 2019. Later that year, Mitchell served as an injury replacement in the New Zealand Test squad, stepping in for Colin de Grandhomme. In his debut Test match against England, Mitchell showcased his talent by scoring his maiden half-century, making a notable contribution to the team. In 2020, Daryl Mitchell made a transition from Northern Districts to Canterbury, which marked a significant shift in his domestic cricket career. He played a pivotal role in New Zealand’s journey to reach the final of the ICC T20 World Cup 2021, as he amassed 208 runs in just 7 games and also got an opportunity to get promoted to open the batting alongside Martin Guptill. Due to his exceptional all-round abilities, Mitchell secured a spot with the Rajasthan franchise for the 2022 edition of the Indian Premier League after being picked up during the mega-auction in 2021. But he played in only a couple of games in the season and warmed the bench for the majority of the tournament. In the 2022 mini-auction, he went shockingly unsold. Cut to 2023, his fortunes took a dramatic turn during the ICC Cricket World Cup 2023 held in India. He showcased exceptional form throughout the tournament, amassing a total of 552 runs, making him one of the standout performers. His standout performances included a brilliant century against India in a league match, where he played a pivotal role in setting a formidable total for New Zealand. Additionally, Mitchell's century against India in the semi-finals kept their hopes alive for a challenging chase, highlighting his ability to perform under pressure on the international stage. Seeing his exceptional batting ability, it was just a formality for his name to pop up in the Indian Premier League auction for the 2024 season, where, after an intense bidding war between Delhi and Punjab, eventually Chennai got the better of them and purchased him. Mitchell struggled with consistency during the 2024 IPL season but still finished as the second-highest run-scorer for Chennai that year. His T20 World Cup campaign was relatively quiet, and he had a subdued tour of India for the most part. However, in a low-scoring Test in Mumbai on a challenging pitch, Mitchell rose to the occasion with a crucial 82-run knock in the first innings, playing a key role in New Zealand's historic whitewash victory. Chennai released Mitchell following the 2024 season, and he went unsold at the auction for the 2025 edition. The end of 2024 and the start of 2025 saw a quiet period for him in the Kiwi domestic circuit, where he represented Canterbury in their run to the final of the Super Smash.",
  "nationality": "New Zealand",
  "career_span": {
    "Test": "2019-2025",
    "ODI": "2021-2025",
    "IPL": "2022-2024"
  }
}