{
  "id": "pprofile_4957",
  "type": "player_bio",
  "player": "Moises Henriques",
  "full_name": "Moises Constantino Henriques",
  "dob": "February 1, 1987",
  "role": "All-Rounder",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm fast medium",
  "teams": [
    "Australia",
    "Australia A",
    "Glamorgan",
    "Nottinghamshire",
    "Surrey",
    "Royal Challengers Bengaluru",
    "Kolkata Knight Riders",
    "Punjab Kings",
    "Delhi Capitals",
    "Mumbai Indians",
    "New South Wales",
    "Australia Under-19",
    "Australian XI",
    "Sydney Sixers",
    "Sunrisers Hyderabad",
    "Australians",
    "Toronto Nationals",
    "Montreal Tigers",
    "Glasgow Giants",
    "Washington Freedom",
    "Australia Champions"
  ],
  "bio": "Occasionally compared to the great Steve Waugh, this diminutive cricketer has been considered as one of the best young talents of Australian cricket. A genuine all-rounder, Moises Henriques could not choose between batting and bowling as his special skill. He usually opens the bowling attack with his right-arm medium pace and is a useful middle-order batsman. Born in Portugal, Henriques moved to Australia when he was just one. At the tender age of 16, he was picked to play for the 2004 Under-19 Cricket World Cup in Bangladesh, where he impressed with 11 wickets. He starred as the captain of the Australia Under-19 team in the 2006 Cricket World Cup in Sri Lanka where he finished as the leading wicket-taker with 16 wickets and scored 150 runs. He made his first-class debut for New South Wales against South Australia in 2006. Only a week after that, he took 5 for 17 against Queensland and displayed his potential. His domestic season saw regular ups and downs as he struggled to maintain his form. Henriques made his international debut in a T20I against New Zealand in 2009. In the same year, he was also called up in the national side for Australia's tour to India as replacement for injured James Hopes. He has been part of the Indian T20 League since 2009 when he was signed by the Kolkata. In 2010, he was traded to Delhi and in 2011; he was bought by the Mumbai for the fifth Indian T20 League season. The same year he was usurped by the Sydney Sixers ahead of the Big Bash League and Champions League T20. For the sixth Indian T20 League edition, Henriques was bought by Bengaluru. In 2013, Henriques was selected in Australia’s Test team for the tour of India. He really impressed on his debut. He scored 68 runs in the 1st innings and backed that up with an even more impressive 81 runs in the 2nd innings. He will be representing the Hyderabad franchise in the 2014 Indian T20 League. This will be his fifth different Indian T20 League franchise that he will be representing.",
  "nationality": "Australia",
  "career_span": {
    "Test": "2013-2016",
    "ODI": "2009-2021",
    "IPL": "2009-2021"
  }
}