{
  "id": "pprofile_10094",
  "type": "player_bio",
  "player": "Mitchell Marsh",
  "full_name": "Mitchell Ross Marsh",
  "dob": "October 20, 1991",
  "role": "All-Rounder",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm medium",
  "teams": [
    "Australia",
    "Australia A",
    "Suffolk",
    "Delhi Capitals",
    "Deccan Chargers",
    "Middlesex",
    "Western Australia",
    "Australia Under-19",
    "Australian XI",
    "Pune Warriors India",
    "Perth Scorchers",
    "Nagenahira Nagas",
    "Sunrisers Hyderabad",
    "Western Australia Chairman XI",
    "Rising Pune Supergiant",
    "Australians",
    "London Spirit",
    "Lucknow Super Giants",
    "Western Australia XI",
    "Texas Super Kings"
  ],
  "bio": "Mitchell Marsh is recognized as one of the hardest hitters of the cricket ball as well as being a handy medium pacer. Choosing cricket over a career in Australian Rules football, he showcased his natural ability, inherited from his Test-playing father, Geoff Marsh, and brother, Shaun Marsh. Marsh made his state debut at 17, captained Australia to victory in the 2010 U19 World Cup at 18, and earned an international call-up at 19. In February 2009, he became the youngest Australian to play in the domestic One-Day Cup. Following the U19 World Cup win, he secured an Indian Premier League contract with the Hyderabad franchise in 2010. After a strong IPL performance, he made his international debut in T20s against South Africa in 2011 and soon after in ODIs. Marsh was picked by the Perth franchise in the inaugural Big Bash League, playing there for several seasons while dealing with injuries. Opting out of the IPL in 2014, he made a strong comeback with a double century for Australia A, earning a Test debut against Pakistan. Recognizing his potential, selectors named Marsh in the 2015 World Cup squad, but with Shane Watson occupying the all-rounder role, his opportunities were limited. Following Watson’s retirement in 2016, Marsh became Australia’s preferred fast-bowling all-rounder, but injuries and competition from other all-rounders disrupted his place in the team. He was a late addition to Australia’s 2019 World Cup squad, replacing Marcus Stoinis. Marsh’s defining moment came in the 2021 T20 World Cup, where he was one of Australia’s top run-scorers and was named Player of the Match in the final. His career then saw setbacks, missing the 2021–22 Ashes and the Pakistan tour due to injury. Further setbacks followed, including a hip injury and later an ankle injury that required surgery. Despite these challenges, Marsh made a strong comeback in 2023, excelling as an opener in ODIs during the India tour, earning the Player of the Series award. In July 2023, he returned to Test cricket in the Ashes, replacing Cameron Green, and scored his third Test century, his first since 2019 and first outside Australia. In August 2023, he was named captain of Australia’s T20I and ODI teams for the South Africa tour, leading them to a T20I series win and earning the Player of the Series award. Although Australia lost the ODI series, Marsh’s leadership was evident. Ahead of the 2023 ODI World Cup, he was appointed vice-captain. Against Pakistan, he scored his first ODI century since 2016 and played a key role in Australia’s victorious campaign. In December 2023, Marsh made his long-awaited return to a home Test series against Pakistan. His resurgence continued in Australia’s 2024 New Zealand tour, where he was named Player of the Series. In May 2024, he was appointed Australia’s captain for the 2024 T20 World Cup, but the team failed to reach the finals for the second consecutive time. In September 2024, Marsh led Australia to a 3-0 T20I series win against Scotland. In November 2024, Mitchell Marsh made a solid start to the 2024-25 Border-Gavaskar Trophy, scoring 6 and 47 runs while picking up three wickets in the first Test at Perth. However, his form took a sharp dip in the following matches, failing to score more than nine runs in the next three Tests and going wicketless throughout. As a result, Marsh was dropped for the fifth Test, making way for debutant Beau Webster. His struggles continued into the new year, and in January 2025, Marsh was left out of Australia’s Test squad for the tour of Sri Lanka. Adding to his woes, an injury setback ruled him out of the 2025 ICC Champions Trophy, leaving him sidelined from international action.",
  "nationality": "Australia",
  "career_span": {
    "Test": "2014-2024",
    "ODI": "2011-2025",
    "IPL": "2010-2025"
  }
}