{
  "id": "pprofile_65867",
  "type": "player_bio",
  "player": "Khaleel Ahmed",
  "full_name": "Khaleel Khursheed Ahmed",
  "dob": "December 5, 1997",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Left-arm fast medium",
  "teams": [
    "India",
    "Central Zone",
    "Essex",
    "India A",
    "India B",
    "Rest of India",
    "Chennai Super Kings",
    "Delhi Capitals",
    "India Under-19",
    "Rajasthan",
    "Sunrisers Hyderabad",
    "Jodhpur Sunrisers",
    "Udaipur Lake City Warriors",
    "Team A"
  ],
  "bio": "India hasn't been able to produce a premier left-arm pace bowler since Zaheer Khan. There have been a few candidates to take that place, and one of them is Khaleel Ahmed. He hails from Rajasthan, where at first his parents wanted him to become a doctor and did not support his desire to play cricket. However, he persuaded them and began training with a tennis ball to learn the art of pace bowling. His hard work paid off, and he represented India at the 2016 U-19 World Cup. Although he could not take that many wickets in the tournament, he impressed Rahul Dravid, the then coach of India U-19 and Delhi, which was enough to get a contract from Delhi for the 2016 Indian Premier League.He did not get any games, but training with Zaheer Khan helped him sharpen his skills. Ahmed made his T20 debut for Rajasthan in the 2016–17 Syed Mushtaq Ali Trophy. In the same year, he made his first-class debut in the Ranji Trophy as well. The following season, he played his first List A game. Ahmed had a successful domestic season in 2017-18, which earned him 3 crores at the auction, and he joined Hyderabad for the Indian Premier League. Following his consistent domestic performances, he quickly found himself in the national setup. Ahmed made his ODI debut in the 2018 Asia Cup against Hong Kong, where he picked up three wickets. In the same year, he played his first T20I against the West Indies at Eden Gardens. His breakthrough season came in the 2019 Indian Premier League, where he picked up 19 wickets in nine matches. He suffered a dip in form in the next couple of seasons, was dropped from the Indian team, and could not get many games for Hyderabad as well. In 2022, he was bought back by Delhi and had a successful season, registering 16 wickets in ten games. Although he was absent from international cricket, he remained a key figure in the IPL. His performances in the 2023 season for Delhi Capitals were inconsistent, but in 2024, he made a strong comeback, taking 17 wickets, his second-highest IPL tally overall and his best performance with DC. This set the stage for a long-awaited achievement when he was finally named to the Indian squad for the ICC T20 World Cup 2024. He continued to work hard in domestic cricket, steadily improving. In the Duleep Trophy, his performances caught the eye, and he earned a spot with the India A team for a first-class Test tour of Australia, where he claimed two wickets. Additionally, he was selected as a reserve player for the Border-Gavaskar Trophy 2024/25, filling in for the injured Yash Dayal. In the 2024/25 Ranji Trophy, playing for Rajasthan, he impressed with a 4-wicket haul against Railways and followed it up with a 5-wicket performance against Vidarbha. Impressed by his consistent performances, and with DC releasing Khaleel before the IPL 2025 Mega Auction, CSK secured his services for INR 4.8 crores. Khaleel’s diverse skill set, including his handy variations, makes him a perfect fit for the challenging conditions at Chepauk.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "2018-2019",
    "IPL": "2018-2025"
  }
}