{
  "id": "pprofile_65876",
  "type": "player_bio",
  "player": "Naveen-ul-Haq",
  "full_name": "Naveen-ul-Haq Murid",
  "dob": "September 23, 1999",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm medium fast",
  "teams": [
    "Hampshire",
    "Leicestershire",
    "Afghanistan Under-19",
    "Afghanistan",
    "Sydney Sixers",
    "Sylhet Strikers",
    "Rangpur Riders",
    "Barbados Royals",
    "Guyana Amazon Warriors",
    "Jamaica Tallawahs",
    "Quetta Gladiators",
    "Peshawar Zalmi",
    "Khulna Tigers",
    "Afghanistan A",
    "Afghanistan Emerging",
    "Band-e-Amir Region",
    "Band-e-Amir Dragons",
    "Kabul Eagles",
    "Mis-e-Ainak Knights",
    "Kabul Region",
    "Vancouver Knights",
    "Montreal Tigers",
    "Nangarhar Leopards",
    "Delhi Bulls",
    "Team Abu Dhabi",
    "Colombo Strikers",
    "Kandy Falcons",
    "Fortune Barishal",
    "Lucknow Super Giants",
    "Durban's Super Giants",
    "Sharjah Warriorz",
    "MI New York",
    "Texas Super Kings",
    "Antigua & Barbuda Falcons"
  ],
  "bio": "Naveen-ul-Haq Murid was born on 23rd September 1999 and he shifted from living in a war zone in Afghanistan to launching a cricket career as a refugee in Pakistan. As a right-arm pacer, Naveen has an odd bowling motion and has been labeled a T20 specialist just like his other Afghan coworkers who have excelled in the shortest format of the game. Growing up, Naveen loved watching India play and admired the bowling combination of Shanthakumaran Sreesanth, Irfan Pathan, and Zaheer Khan. He represented Afghanistan at the U-16 level when he was just 11 years old and began playing the sport professionally. He was instrumental in Afghanistan U19 claiming the 2014-15 ACC U-19 Premier League trophy four years later. He was picked for the 2016 U19 Cricket World Cup and also represented his nation at the U19 Asia Cup. A few months later, he made his international debut even before he played his first domestic game in an ODI against Bangladesh and though he was expensive, he managed to dismiss Mashrafe Mortaza and get his maiden international wicket. He made his T20 debut against Namibia at the start of 2017 in the Desert T20 Cup and bowled a maiden in his two overs including one wicket. He led the Afghanistan U19 side in the 2018 U19 Cricket World Cup and helped them reach the semi-finals claiming 8 wickets with an excellent economy rate. After the tournament, he made his first-class debut for Kabul Region in the Alokozay Ahmad Shah Abdali 4-day Tournament and claimed four wickets in the game. The following year, he made his T20I debut against Bangladesh and picked up two wickets at an economy rate of 5 and it was a dream performance by the young pacer. With his performances on the world stage, Naveen sought to win over various T20 franchisees all around the world and got his move to the Caribbean T20 League in the West Indies before playing in Lanka T20 League in Sri Lanka where he played with the likes of Shahid Afridi and Mohammad Amir. After participating in the Abu Dhabi T10 League and playing for Leicestershire in the T20 Blast in 2021, Naveen continued to grow his stock as a shorter-format bowler. His journey finally led him to the Indian T20 League for the first time when the Lucknow franchise purchased him at his base price for the 2023 edition of the competition. The development and ability of Naveen-ul-Haq will help reassure Afghanistan Cricket that their pace battery is also strengthening along with their ever-yielding spin attack.",
  "nationality": "Afghanistan",
  "career_span": {
    "Test": "",
    "ODI": "2016-2023",
    "IPL": "2023-2024"
  }
}