{
  "id": "pprofile_9848",
  "type": "player_bio",
  "player": "Shahbaz Nadeem",
  "full_name": "Shahbaz Nadeem",
  "dob": "August 12, 1989",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Slow left-arm orthodox",
  "teams": [
    "India",
    "East Zone",
    "India A",
    "India B",
    "Indian Board Presidents XI",
    "India Green",
    "India Red",
    "Rest of India",
    "Delhi Capitals",
    "India Under-19",
    "Jharkhand",
    "Sunrisers Hyderabad",
    "Lucknow Super Giants",
    "Jharkhand CC",
    "RBI",
    "Rajasthan Kings",
    "Kandy Samp Army",
    "Konark Suryas Odisha",
    "Rajasthan Regals",
    "India Masters",
    "Rest of Asian Stars",
    "African Lions"
  ],
  "bio": "Shahbaz Nadeem is a slow left-arm orthodox bowler. He has played for the Indian Under-19 team, Bihar Under-14s and has also represented his state, Jharkhand in the domestic arena. He came into the limelight after taking a nine-wicket haul against Sikkim in an Under-15 game in 2002. Known for his athletic fielding too, he was a fixture at point for his state team as well as the East Zone side. After an impressive first-class debut in 2004-05, he made it to Under-19 One-dayers against Australia and played only one match in the Under-19 World Cup. He was signed by the Delhi franchise for the fourth edition of the Indian T20 League in 2011 and remained with them till 2018. He set a new record for the best bowling figures in a List A cricket match by taking eight wickets for 10 runs against Rajasthan whilst playing for Jharkhand. A hard-working bowler, known for his consistency, was finally rewarded when he was included in the Indian T20I squad for a series against West Indies in 2018. Although, he didn't get the chance to play. Next year, with Kuldeep Yadav injured, Shahbaz finally made his Test debut against South Africa. As far the Indian T20 League is concerned, Nadeem was traded to Hyderabad ahead of the 2019 edition.",
  "nationality": "India",
  "career_span": {
    "Test": "2019-2021",
    "ODI": "2017",
    "IPL": "2011-2021"
  }
}