{
  "id": "pprofile_4196",
  "type": "player_bio",
  "player": "Aaron Finch",
  "full_name": "Aaron James Finch",
  "dob": "November 17, 1986",
  "role": "Batsman",
  "batting_style": "Right Handed",
  "bowling_style": "Slow left-arm orthodox",
  "teams": [
    "Australia",
    "Australia A",
    "Auckland Aces",
    "Surrey",
    "Yorkshire",
    "Royal Challengers Bengaluru",
    "Kolkata Knight Riders",
    "Punjab Kings",
    "Delhi Capitals",
    "Rajasthan Royals",
    "Mumbai Indians",
    "Victoria",
    "Australia Under-19",
    "Australian XI",
    "Pune Warriors India",
    "Melbourne Renegades",
    "Ruhuna Royals",
    "Sunrisers Hyderabad",
    "Marylebone Cricket Club",
    "Trinbago Knight Riders",
    "Cricket Australia Invitational XI",
    "Cricket Australia XI",
    "Gujarat Lions",
    "Australians",
    "Northern Superchargers",
    "World Giants",
    "San Francisco Unicorns",
    "California Knights",
    "Southern Super Stars",
    "Kandy Samp Army",
    "Australia Champions"
  ],
  "bio": "A well-built aggressive right-handed batsman, Aaron Finch is an Australian cricketer who first represented Australia at the Under-19 World Cup in 2006. His first-class debut came against the touring Indians in December 2007. Fondly known as “Finchy”, he was chosen for Victoria in the 2009-10 season where he scored his maiden first-class century. His impressive performance in the Sheffield Shield and the Pura Cup established him as Victoria’s strength. Finch has been a regular in the Indian T20 League as well and has represented as many as 9 teams. Mostly known as a big-hitter, Finch has a great variety of shots to offer which are useful in the starting overs of the innings. His impressive strike rate has always been a thing to look out for. In 2015, he became the first player to score 1000 runs in the Big Bash League. He also captained his country in the shortest format of the game when he was also rated as the number 1 batsman in international T20 cricket. Injuries hampered Finch's career quite a bit during 2015-16 and also he was removed from captaincy weeks before the ICC World T20 in 2016. Although Finch remained a part of the team, he failed to leave much impact. His fortunes turned in 2018 when he was appointed as the captain again for the limited-overs after the ban of Steven Smith and David Warner. Their absence allowed him to make his Test debut as well but it wasn't very fruitful. Aaron Finch did experience a dip in form in 2018 but his leadership quality kept him in good stead. After delivering the goods on the tours of India and Pakistan, Aaron was praised for his captaincy and he went on to lead Australia in the 2019 World Cup. The biggest success of his captaincy was when Australia lifted their maiden T20 World Cup trophy. Unfortunately, Aaron Finch's dip in his batting form turned out to be an extended one. He decided to step down from the ODI captaincy and also retired from that format in 2022, ending an illustrious career in which he scored 17 centuries and had 5000-plus runs. Aaron Finch continued to lead Australia in T20Is.",
  "nationality": "Australia",
  "career_span": {
    "Test": "2018-2018",
    "ODI": "2013-2022",
    "IPL": "2010-2022"
  }
}