{
  "id": "pprofile_63719",
  "type": "player_bio",
  "player": "Lockie Ferguson",
  "full_name": "Lachlan Hammond Ferguson",
  "dob": "June 13, 1991",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm fast",
  "teams": [
    "New Zealand",
    "Auckland Aces",
    "Derbyshire",
    "New Zealand A",
    "Yorkshire",
    "Royal Challengers Bengaluru",
    "Kolkata Knight Riders",
    "Punjab Kings",
    "Sydney Thunder",
    "New Zealand XI",
    "Rising Pune Supergiant",
    "Team Abu Dhabi",
    "Manchester Originals",
    "Trent Rockets",
    "Welsh Fire",
    "Gujarat Titans",
    "Desert Vipers",
    "Los Angeles Knight Riders",
    "Washington Freedom"
  ],
  "bio": "Lachlan Hammond Ferguson, otherwise more commonly known as Lockie Ferguson, is a speedster from New Zealand. Born on 13th June 1991, Lockie played for Auckland in his first two first-class seasons (2014-16) in New Zealand. He got a national call-up into the ODI squad for a series against Australia in December 2016, and he made his international debut. The Kiwi made a lot of headlines for his brilliant performance in the 2019 ODI World Cup. He took 21 wickets in 9 matches and finished as the leading wicket-taker for New Zealand in the tournament with his best performance (4/37) coming against Afghanistan. Towards the end of the year, he made his Test debut against Australia but went wicketless, and it was evident that he was more suited for the shorter format. He was picked up in the 2019 IPL auction by Kolkata for INR 1.6 crore and was retained for the next three seasons. He was bought for INR 10 crore by the Gujarat franchise for their maiden IPL season, which turned out to be a title-winning campaign in 2022. Despite his contributions, he was traded back to his old franchise, Kolkata, ahead of the next season. In 2023, Ferguson encountered a string of setbacks due to injuries, sidelining him for pivotal segments of the Indian Premier League season with Kolkata and the ODI World Cup with New Zealand. Released ahead of the 2024 Indian Premier League player auction, Bengaluru swiftly secured his services for the 17th edition of the tournament. With 9 wickets from 7 games, Ferguson played his part in Bengaluru's journey to the playoffs during the 2024 IPL season. However, the team could not go all the way. Ahead of the IPL mega auction, Ferguson was released by Bengaluru. Recognising his value as a proven speedster, Punjab acquired him to bolster their pace attack for the 2025 edition.",
  "nationality": "New Zealand",
  "career_span": {
    "Test": "2019-2019",
    "ODI": "2016-2023",
    "IPL": "2017-2025"
  }
}