{
  "id": "pprofile_4311",
  "type": "player_bio",
  "player": "Marcus Stoinis",
  "full_name": "Marcus Peter Stoinis",
  "dob": "August 16, 1989",
  "role": "All-Rounder",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm medium",
  "teams": [
    "Australia",
    "Australia A",
    "Kent",
    "Royal Challengers Bengaluru",
    "Punjab Kings",
    "Delhi Capitals",
    "Western Australia",
    "Victoria",
    "Australia Under-19",
    "Australian XI",
    "Melbourne Stars",
    "Perth Scorchers",
    "Barbados Royals",
    "Australians",
    "Surrey Jaguars",
    "Deccan Gladiators",
    "Southern Brave",
    "Trent Rockets",
    "Lucknow Super Giants",
    "Durban's Super Giants",
    "Western Australia XI",
    "Sharjah Warriorz",
    "San Francisco Unicorns",
    "Texas Super Kings"
  ],
  "bio": "Handy with the bat, handy with the ball - Marcus Stoinis made his first appearance at the age of 19 for his home state, Western Australia. He then moved to Victoria due to limited opportunities and didn't waste much time in showcasing his caliber. In 2013-14, Stoinis scored an impressive 170 against Tasmania in a Sheffield Shield match, and from there, his career graph soared. A successful 2014-15 season with Victoria, where he ended as their leading run-getter, earned him a call-up to the national squad for the limited-overs series against England in 2015. However, inconsistent form meant he struggled to secure his place. His breakthrough came in 2017 when he played a breathtaking knock of 146* off 117 balls against New Zealand, nearly pulling off an impossible win. That innings cemented his place in the national team, making him a crucial all-rounder for Australia. Stoinis was initially part of the Perth Scorchers in the Big Bash League before moving to the Melbourne Stars. In the Indian Premier League, he started with the Delhi franchise in 2015, moved to Punjab for three seasons, and was then traded to Bangalore in 2019. In April 2018, he was awarded a national contract by Cricket Australia for the 2018–19 season. In January 2019, he was added to Australia's Test squad for the series against Sri Lanka. He was later named in Australia’s squad for the 2019 Cricket World Cup, but after playing the first four games, he suffered a side strain injury. In April 2022, Stoinis was signed by the Southern Brave for The Hundred in England, and in March 2023, he joined the San Francisco Unicorns for the inaugural Major League Cricket season in the United States. In December 2024, he was named captain of the Melbourne Stars for BBL14, replacing Glenn Maxwell. With his ability to clear the ropes and bowl at the death, Stoinis became one of the most sought-after all-rounders for Australia. He played a key role in the 2019 World Cup and had a standout season in the 2020 IPL with Delhi before moving to Lucknow. In August 2021, Stoinis was named in Australia’s squad for the 2021 ICC Men’s T20 World Cup. In May 2024, he was again included in Australia’s squad for the 2024 ICC Men’s T20 World Cup. Stoinis was then picked up by Punjab for the 2025 IPL season. Soon after being named in the 2025 Champions Trophy squad, Stoinis made a shocking announcement on February 6, 2025, retiring from ODI cricket to focus solely on the T20 format.",
  "nationality": "Australia",
  "career_span": {
    "Test": "",
    "ODI": "2015-2024",
    "IPL": "2016-2025"
  }
}