{
  "id": "pprofile_3723",
  "type": "player_bio",
  "player": "Robin Uthappa",
  "full_name": "Robin Venu Uthappa",
  "dob": "November 11, 1985",
  "role": "Wicket Keeper",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm medium",
  "teams": [
    "India",
    "India A",
    "India B",
    "India Blue",
    "Indian Board Presidents XI",
    "India Green",
    "India Red",
    "Rest of India",
    "South Zone",
    "Royal Challengers Bengaluru",
    "Kolkata Knight Riders",
    "Chennai Super Kings",
    "Rajasthan Royals",
    "Mumbai Indians",
    "India Under-19",
    "India Under-19",
    "Saurashtra",
    "Karnataka",
    "Kerala",
    "Pune Warriors India",
    "Bijapur Bulls",
    "Ballari Tuskers",
    "Kalyani Bengaluru Blasters",
    "Bangla Tigers",
    "Bangalore Brigadiers",
    "Bharat Legends",
    "Atlanta Fire",
    "India Maharajas",
    "Collaze Bakehouse",
    "Manipal Tigers",
    "Dubai Capitals",
    "Patna Warriors",
    "Harare Bolts",
    "Atlanta Riders",
    "Chhattisgarh Warriors",
    "Rajasthan Kings",
    "India Champions",
    "Grand Cayman Jaguars",
    "Chicago CC"
  ],
  "bio": "A stocky and athletic player, Robin Uthappa made his debut for the Indian ODI team against England in 2006 on the back of some run mountains in the domestic circuit. He first came to the public eye when he scored a scintillating 66 for India B against the A team boasting of an attack with the likes of Zaheer Khan, RP Singh and Murali Kartik. Uthappa scored so heavily (854 runs in 7 matches) in 2006-2007, that it was impossible to leave him out of the national team. This led to his memorable debut at Indore in 2006, where he transformed this form into a well-made 86 before he was run out. Inconsistency led to his removal from the team, but he was brought back for the 7-match ODI series against England. He played the sixth match with India trailing the series 3-2, and guided the team home to a famous win with an unbeaten 47 off only 33 balls. This secured his place in the team for a while. Uthappa was nicknamed ‘The Walking Assassin’ because of his unique tactic of strolling down the pitch. He is essentially an attacking minded player who loves to score runs quickly. He was included in the team for the 2007 ICC Cricket World Cup in the West Indies, but had a very poor tournament scoring a miserable 30 runs in the three group games. He was never really able to transfer his domestic form to the international scene on a consistent basis. In time, he came to be known more as a limited-overs specialist. Uthappa was instrumental in India’s triumph in the maiden ICC T20 World Cup. In the group match against Pakistan, he walked in to bat with the score at 39/4 and went on to crack his first half century in T20Is. In the same match, he went on to secure the bowl out in India’s favour and is remembered for tipping his cap over and saluting after he had hit the stumps. Uthappa played for the Mumbai in the first season of the Indian T20 league and in the following year, he swapped places with Zaheer Khan to join Bengaluru. In the third edition, he bludgeoned 51 runs in only 21 balls, the fastest half century at that time. In 2011, he was picked up by the new franchise, Pune for a whopping 2.1 million USD (approx. 9.4 crores), although he did not quite do justice to this price tag. Uthappa kept playing for Karnataka in the domestic front but was far from being considered for the national team. In the 7th season, he was drafted in to represent the Kolkata franchise. Robin Uthappa prospered in the role of an opener and was the leading run-scorer in the 2014 edition. After spending seasons after seasons with Kolkata, he was released by the franchise ahead of the auction of the 13th edition and Rajasthan acquired his services by spending INR 3 crore for him. Robin had a very poor season and was traded to Chennai in an all-cash deal for the 2021 season.",
  "nationality": "India",
  "career_span": {
    "ODI": "2006-2015",
    "IPL": "2008-2022"
  }
}