{
  "id": "pprofile_11938",
  "type": "player_bio",
  "player": "Mitchell McClenaghan",
  "full_name": "Mitchell John McClenaghan",
  "dob": "June 11, 1986",
  "role": "Bowler",
  "batting_style": "Left Handed",
  "bowling_style": "Left-arm fast",
  "teams": [
    "New Zealand",
    "ICC World XI",
    "Auckland Aces",
    "Lancashire",
    "North Island",
    "New Zealand A",
    "Worcestershire",
    "Mumbai Indians",
    "Middlesex",
    "Otago Volts",
    "Sydney Thunder",
    "Saint Lucia Kings",
    "Karachi Kings",
    "Lahore Qalandars",
    "Durban Qalandars",
    "World XI",
    "Maratha Arabians",
    "Punjabi Legends",
    "Toronto Nationals",
    "Nangarhar Leopards",
    "Nelson Mandela Bay Giants",
    "Belfast Titans",
    "Gujarat Greats",
    "Manipal Tigers",
    "Grand Cayman Jaguars"
  ],
  "bio": "Mitchell McClenaghan is a left-arm medium-fast bowler who kick-started his First-Class career with Central Districts but then moved to Auckland in the 2011-12 season. During the first phase of his First-Class career with Central districts, one of his most cherished moments came when he scalped 5 for 36 against England Lions playing for New Zealand A in the Emerging Players Tournament. It was after his switch to Auckland however, that he started making serious impact. A string of good performances in List A games propelled him into the New Zealand squad for the T20Is and ODIs on the 2012 tour of South Africa. He made his T20I debut in Durban and had an excellent start to his ODI career with figures of 4/20. He became just the second New Zealand player after Dayle Hadlee to scalp four wickets on ODI debut. With the ability to swing the ball at a good pace and a knack of picking up wickets at regular intervals, McClenaghan has grown leaps and bounds since his inception in the international arena and has been an integral part of the limited overs Kiwi side. Injuries did hamper his progress in 2016 but despite his good comeback, the form of Trent Boult and Tim Southee meant he got limited opportunities for his national side. He till date remains the fastest New Zealand bowler to take 50 ODI wickets, achieving the feat in just 23 matches. Mumbai bought him in the 2015 edition of the Indian T20 League where he bowled brilliantly to scalp 18 wickets at an average of 21.44, taking 3/25 in the final against Chennai. He remains one of their strike bowlers since then.",
  "nationality": "New Zealand",
  "career_span": {
    "Test": "",
    "ODI": "2013-2016",
    "IPL": "2015-2019"
  }
}