{
  "id": "pprofile_74837",
  "type": "player_bio",
  "player": "Nitish Kumar Reddy",
  "full_name": "Kaki Nitish Kumar Reddy",
  "dob": "May 26, 2003",
  "role": "All-Rounder",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm medium fast",
  "teams": [
    "India",
    "India A",
    "India B",
    "Andhra",
    "Sunrisers Hyderabad",
    "Godavari Titans",
    "Hyderabad CC",
    "Team B",
    "Bhimavaram Bulls"
  ],
  "bio": "Nitish Kumar Reddy, a talented bowling all-rounder from Visakhapatnam who represents Andhra in Indian domestic cricket, has steadily risen through the ranks with his all-round abilities. His journey began with a stellar performance in the 2017-18 Vijay Merchant Trophy, where he amassed 1,237 runs, including an extraordinary 441 against Nagaland, earning him the Best Cricketer Award in the Under-16 category at the 2018 BCCI Awards. Since making his senior domestic debut in January 2020, Reddy has further honed his bowling skills and delivered impactful performances. In the 2022-23 Ranji Trophy, Reddy was the third-highest wicket-taker for his state side, claiming 25 wickets and scoring 160 runs in eight matches while batting in the lower order. These consistent performances earned him get an IPL contract with Hyderabad in the 2023 auction, where he made his debut against Bengaluru. The 2024 IPL season saw Reddy solidify his reputation as a rising star, scoring 303 runs at an impressive average of 33.67 and also took three wickets, showcasing his utility as a dependable all-rounder. Reddy's impressive IPL form earned him a spot in the young Indian squad for a five-match T20I series against Zimbabwe. However, an unfortunate injury ruled him out, and Shivam Dube replaced him in the squad. His long-awaited opportunity came later in the year when he made his T20I debut against Bangladesh. He made an immediate impact, and in just his second T20I, Reddy smashed a blistering 74 off 34 balls and chipped in with two crucial wickets, earning the Player of the Match award as India sealed the series. This remarkable performance caught the attention of the Indian selectors, who included him in the squad for the prestigious 2024/25 Border-Gavaskar Trophy in Australia. It was a dream come true for the all-rounder when he received his maiden Test cap in the first Test at Perth from none other than Virat Kohli, his childhood idol.",
  "nationality": "India",
  "career_span": {
    "Test": "2024-2025",
    "ODI": "",
    "IPL": "2023-2025"
  }
}