{
  "id": "pprofile_67932",
  "type": "player_bio",
  "player": "Lalit Yadav",
  "full_name": "Lalit Yadav",
  "dob": "January 3, 1997",
  "role": "All-Rounder",
  "batting_style": "Right Handed",
  "bowling_style": "Off break",
  "teams": [
    "Delhi Capitals",
    "Delhi",
    "CAG",
    "Purani Delhi 6"
  ],
  "bio": "Lalit Yadav, a promising all-rounder from India, has been making waves in the domestic cricket circuit with his explosive batting and handy off-break bowling. Known for his heroics to hit six sixes in an over, a feat he has achieved twice, Yadav has captured the imagination of cricket fans with his aggressive style. His journey began in the domestic leagues, where he quickly established himself as a consistent performer. In his first-class debut against Maharashtra in 2017, Yadav scored a half-century, setting the tone for a career marked by resilience and flair. Yadav's prowess with the bat is complemented by his skill with the ball. In the Ranji Trophy, he has taken 15 wickets with an economy rate of 3.22, showcasing his ability to contribute in all facets of the game. His best bowling figures of 2/10 against Maharashtra highlight his potential as a game-changer. With a batting average of 38.04 in first-class cricket, Yadav has proven his mettle as a reliable middle-order batsman, capable of anchoring innings and accelerating when needed. Despite not having made his mark on the international stage yet, Yadav's performances in the Indian Premier League (IPL) have been noteworthy. Playing for Delhi Capitals, he has shown glimpses of his potential, with a highest score of 48 against Mumbai Indians. His IPL journey has been a learning curve, and with each season, he has grown in confidence and skill. Yadav's domestic T20 record is impressive, with 1077 runs at a strike rate of 135.13 and 53 wickets at an economy of 7.02. His ability to perform under pressure was evident in the Syed Mushtaq Ali Trophy, where he scored a crucial 66 against Tripura and took 3 wickets for just 10 runs. These performances have solidified his reputation as a dependable all-rounder in the domestic circuit. Looking ahead, Lalit Yadav's focus will be on cementing his place in the IPL and making a case for national selection. With the 2025 domestic season on the horizon, he will aim to continue his upward trajectory and make significant contributions to his team's success. His all-round capabilities make him a valuable asset, and with consistent performances, he could soon find himself donning the national colors.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "",
    "IPL": "2021-2024"
  }
}