{
  "id": "pprofile_67887",
  "type": "player_bio",
  "player": "Mukesh Choudhary",
  "full_name": "Mukesh Choudhary",
  "dob": "July 6, 1996",
  "role": "Bowler",
  "batting_style": "Left Handed",
  "bowling_style": "Left-arm medium",
  "teams": [
    "West Zone",
    "Chennai Super Kings",
    "Maharashtra",
    "Eagle Nashik Titans"
  ],
  "bio": "Mukesh Choudhary, a promising left-arm medium pacer from Bhilwara, Rajasthan, has steadily made a name for himself in Indian domestic cricket with his consistent performances. Born on July 6, 1996, Choudhary’s cricketing journey began with Maharashtra in the 2017-18 Ranji Trophy. Over the years, he has played 13 first-class matches, taking 38 wickets, and showcasing his potential as a reliable bowler. His standout performances in the 2019-20 Vijay Hazare Trophy and the Syed Mushtaq Ali Trophy helped solidify his reputation as a formidable force in domestic cricket. His knack for delivering under pressure was on full display during the Ranji Trophy, where he took eight wickets, including a match-winning five-wicket haul against Baroda, further proving his ability to shine in crucial moments. With a healthy bowling average in first-class cricket, Choudhary has shown his capability to perform consistently against top domestic sides. In the 2021-22 Vijay Hazare Trophy, Choudhary emerged as the leading wicket-taker for Maharashtra, further catching the eye of talent scouts across the country. His stellar performances in domestic competitions paid off when he was bought by Chennai Super Kings (CSK) for his base price of INR 20 lakhs at the IPL 2022 Mega Auction. He registered his IPL best figures of 4/46 against Sunrisers Hyderabad in the 2022 season itself. Unfortunately, Mukesh encountered a setback with two major injuries – a rib fracture followed by a stress fracture in his back – which resulted in him being sidelined for IPL 2023. When he returned for the 2024 season, he found it challenging to break into the playing XI and had a difficult outing in the one match he played, conceding 27 runs in an over to Abhishek Sharma of SRH. He was arguably at his best in the 2024/25 season of Syed Mushtaq Ali Trophy, where he finished as the third-highest wicket-taker, claiming 15 wickets in six matches at a decent economy rate, representing Maharashtra. Seeing him progressing gradually after those injuries, CSK yet again displayed trust in Mukesh and bought him for his base price of INR 30 lacs for the 2025 IPL season.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "",
    "IPL": "2022-2025"
  }
}