{
  "id": "pprofile_59547",
  "type": "player_bio",
  "player": "Deepak Chahar",
  "full_name": "Deepak Lokandersingh Chahar",
  "dob": "August 7, 1992",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm medium",
  "teams": [
    "India",
    "Central Zone",
    "India A",
    "India B",
    "Chennai Super Kings",
    "Mumbai Indians",
    "Rajasthan",
    "Rising Pune Supergiant",
    "Bhilwara Bulls"
  ],
  "bio": "Deepak Chahar is a medium-pacer born in Agra, Uttar Pradesh. He represents Rajasthan in the domestic circuit. His career started on an unpleasant note after he got rejected by Greg Chappell, the Director of Rajasthan Cricket Academy, in 2008. That rejection only made Chahar stronger as he announced his arrival in the domestic circuit with a bang. In a great display of swing bowling, Chahar hunted down eight wickets and that helped Rajasthan in bundling out Hyderabad for a score of just 21, which is also the lowest total in domestic cricket. Post that, Chahar had a bumpy ride due to fitness issues which reflected in his bowling form as well. He though continued to work hard and made immense progress in his fitness and gameplay, thus leading to a successful 2018 Syed Mushtaq-Ali Trophy. That turned out to be the turning point of his life as his performance got him picked by the Chennai franchise for the Indian Premier League. Chahar made outstanding use of the opportunity and was a regular wicket-taker for the yellow team, most importantly in the Powerplays. Under Dhoni's guidance, the young man's bowling shone and he was a key member of Chennai's successful season in 2018. The pacer took the confidence forward and was among the top three wicket-takers in the following season. His commendable performance in the Indian Premier League led to his inclusion in India A squad for the tri-series against West Indies A and England Lions. Deepak finished as the highest wicket-taker in that series and further proved his mettle. His hard work paid off when he finally got an international call-up in 2018 after Jasprit Bumrah got injured. Deepak made his T20I debut against England on July 8, 2018. Though he had a forgetful start to his international career. Opportunity knocked again on his door as this time, he was given a chance in the 50-over format. Chahar made his ODI debut in the same year in September against Afghanistan but once again it was a below-par performance by him. His ability to swing the ball and pick wickets made the selectors keep faith in his talent and although Chahar missed the bus for the 2019 World Cup, he travelled with the team as one of the four net bowlers. Soon after the mega event, Deepak was picked in the T20I squad for the tour of West Indies. During Bangladesh's tour of India in 2019, Chahar showed great form and in the T20I decider in Nagpur, he became the first Indian male bowler to pick a hat-trick in this format and also finished with bowling figures of 3.2-0-7-6, the best by any bowler in this format. Not to forget, Deepak Chahar worked on his skills bowling at the death, as well, and as a result, 4 out of those six wickets came towards the end. Deepak Chahar is also a very handy batter, and he has scored useful runs for India lower down the order and won his team a few games as well. During the mega auction before the 2022 Indian Premier League, Chennai paid a whopping INR 14 crore to buy him back, but he was ruled out of the entire season due to a back injury. Ahead of the 2025 season, Chahar was purchased by Mumbai.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "2018-2022",
    "IPL": "2016-2025"
  }
}