{
  "id": "pprofile_9782",
  "type": "player_bio",
  "player": "Jos Buttler",
  "full_name": "Joseph Charles Buttler",
  "dob": "September 8, 1990",
  "role": "Wicket-Keeper",
  "batting_style": "Right Handed",
  "bowling_style": "-",
  "teams": [
    "England",
    "England A",
    "England XI",
    "Lancashire",
    "Rajasthan Royals",
    "Mumbai Indians",
    "England Under-19",
    "Somerset",
    "Melbourne Renegades",
    "Sydney Thunder",
    "England Lions",
    "Comilla Victorians",
    "Deccan Gladiators",
    "Manchester Originals",
    "Team Buttler",
    "Gujarat Titans",
    "Lancashire CCC",
    "Durban's Super Giants",
    "Paarl Royals"
  ],
  "bio": "A tall and well-built player, Joseph Buttler first grabbed headlines when, as a 19-year old, he had a terrific 2010 season with Somerset. His aggressive batting helped him score 440 runs in the 40-overs domestic tournament at a staggering average of 55.00. He was named the Young Wisden School Cricketer of the Year in the very same year. A right-handed batter, Buttler came across as a prolific run-scorer in the one-day arena, though his First-Class record did not inspire much confidence. Despite that, he was always seen as a potential and challenging entry in England's one-day side, right from the beginning. Buttler made his First-Class debut for Somerset in 2009 and scored a decent 30 against Lancashire. An able wicket-keeper, he is one of the cleanest hitters of the cricket ball. He was also an integral part of the England Under-19 team in the 2009-10 winter, his first appearance coming in a Twenty20 encounter against the Bangladeshi Under-19s. Buttler received a surprise call-up to England's T20I squad in 2011 to face India in their one-off Twenty20 International at Old Trafford, Manchester. A year later, he made his ODI debut against Pakistan in Dubai. He was in and out of the side initially but once given a proper run, Buttler came out with flying colours. He scored a 61-ball ODI hundred against Sri Lanka at home to showcase his skills. It was the then fastest ODI hundred for an English player before he himself broke that record in 2015, scoring a 46-ball ton against Pakistan. He made his Test debut against India and stamped his authority with an 85. His form, however, dipped going into England's disastrous 2015 World Cup campaign. Things though changed since then. Buttler became an integral part of England's limited-overs cricket. His quick scoring and innovative hitting won him a contract with Mumbai for the 2016 edition of the Indian Premier League. He didn't quite set the stage on fire but had a few meaningful contributions. In 2018, Rajasthan spent a big amount to acquire his service. Jos didn't start well for them, but once he got promoted to open the innings, his fortunes turned. At that time, he became only the second batter in the history of the League to notch up five consecutive 50 plus scores. Buttler scored 312 run in 9 innings in the 2019 ODI World Cup and played a important role helping his country to lift the trophy. It took time for Buttler to cement his position in the Test team but a few winning contributions during the series against West Indies and Pakistan in 2020 helped him to establish himself as the number one wicketkeeper batter in the country. In 2021, Buttler was named in the England squad for the T20 World Cup, and in the match against Sri Lanka scored his first T20I century becoming the first English player to score tons in all three formats. He was also named the vice-captain for the 2012-22 Ashes. The following year, in an ODI against Netherlands, he smashed 162 in just 70 balls and also became the second fastest back then to score 150 which came in 65 balls, just one ball behind AB De Villiers. Following the retirement of Eoin Morgan, Buttler was appointed captain for England in ODIs and T20Is. In the 2022 T20 World Cup he led from the front and with his excellent leadership skills helped England win the title. He was also part of the next two T20 World Cups and a disastrous 2023 ODI World Cup in India. Buttler has been a consistent performer in the Indian Premier League and for Rajasthan Royals also helping them to reach the final in 2022. However, after being a long servant for them, he wasn't retained ahead of the 2025 season and was bought by Gujarat.",
  "nationality": "England",
  "career_span": {
    "Test": "2014-2022",
    "ODI": "2012-2025",
    "IPL": "2016-2025"
  }
}