{
  "id": "pprofile_84562",
  "type": "player_bio",
  "player": "Dewald Brevis",
  "full_name": "Dewald Brevis",
  "dob": "April 29, 2003",
  "role": "All-Rounder",
  "batting_style": "Right Handed",
  "bowling_style": "Leg break",
  "teams": [
    "South Africa",
    "Hampshire",
    "South Africa A",
    "South African Invitation XI",
    "Titans",
    "Chennai Super Kings",
    "Mumbai Indians",
    "South Africa Under-19",
    "Knights",
    "St Kitts and Nevis Patriots",
    "Kandy Falcons",
    "New York Strikers",
    "Morrisville Samp Army",
    "MI Cape Town",
    "MI New York"
  ],
  "bio": "Fondly known as AB de Villers’ protégé’, aka ‘Baby AB’, Dewald Brevis first captured global attention during the 2022 ICC Under-19 Cricket World Cup in the West Indies, where his tournament-leading 506 runs, including two centuries and three fifties, earned him Player of the Tournament honors. This breakout performance paved the way for his swift transition into professional cricket, with Mumbai Indians securing his services in that year's IPL auction. As his reputation grew, Brevis became a fixture in franchise leagues worldwide. He joined St Kitts & Nevis Patriots for the 2022 Caribbean Premier League, where he memorably struck five consecutive sixes, before representing MI Cape Town in South Africa's SA20 and the Kandy Falcons in Sri Lanka's Lanka Premier League. His most remarkable performance came on October 31, 2022, when he blasted 162 runs off just 57 balls for the Titans, setting multiple records including the highest T20 score in South Africa and the fastest-ever 150 in T20 cricket, achieved in just 52 deliveries. At 19 years and 185 days, he also became the youngest South African to score a men's T20 century. The following year saw Brevis make his international debut for South Africa against Australia in August 2023, while continuing to expand his global footprint with MI New York in the inaugural Major League Cricket season, where his contributions helped secure the championship. His career trajectory continued upward in 2025 with a move to Hampshire County Cricket Club for England's T20 Blast and a significant IPL transfer to Chennai Super Kings in April as a replacement player for the injured Gurjapneet Singh, marking a new chapter with a new franchise, after three-season stint with Mumbai Indians. In the 2025 IPL season, Brevis amassed 225 runs across six innings for Chennai Super Kings, averaging 37.50 with a blistering strike rate of 180.00. His standout performance was a dynamic 78 off 39 balls against Rajasthan Royals. Through these achievements, Brevis has steadily built his own identity in the game, moving beyond early comparisons to AB de Villiers while establishing himself as one of cricket's most exciting young talents with a growing list of accomplishments.",
  "nationality": "South Africa",
  "career_span": {
    "Test": "2025-2025",
    "ODI": "2025-2025",
    "IPL": "2022-2025"
  }
}