{
  "id": "pprofile_3896",
  "type": "player_bio",
  "player": "Cheteshwar Pujara",
  "full_name": "Cheteshwar Arvind Pujara",
  "dob": "January 25, 1988",
  "role": "Batsman",
  "batting_style": "Right Handed",
  "bowling_style": "Leg break",
  "teams": [
    "India",
    "Derbyshire",
    "Gloucestershire",
    "India A",
    "India B",
    "India Blue",
    "Indian Board Presidents XI",
    "India Green",
    "Leicestershire",
    "Nottinghamshire",
    "Rest of India",
    "West Zone",
    "Yorkshire",
    "Royal Challengers Bengaluru",
    "Kolkata Knight Riders",
    "Punjab Kings",
    "Chennai Super Kings",
    "India Under-19",
    "Sussex",
    "Saurashtra",
    "Mumbai A",
    "Zalawad Strikers",
    "Indians"
  ],
  "bio": "Even before he made his international debut for India, Cheteshwar Pujara was touted as a batting genius capable enough of replacing the great batter Rahul Dravid and was seen as one of the most promising talents in the country. While most modern Indian cricketers have a swashbuckling style of play, Pujara possessed the rare, old-school, Dravid-like temperament and technique. Pujara was a prolific run machine in every grade of cricket since childhood and starred in India's ICC U19 Cricket World Cup campaign in 2006. After a successful 2007-08 Ranji season, the Saurashtra batter was captured by Kolkata for the inaugural Indian Premier League season in 2008, followed by Bangalore. Two years later, the youngster was already representing India in whites, scoring a gritty 72 off just 89 balls on debut against Australia in a fourth-innings run chase. However, he was unfortunate to miss out on an entire year in 2011 due to a knee injury. He had a huge appetite for runs, evident from the multiple triple centuries scored at the domestic level. Centuries in the series against the touring English side proved that he was here to stay. It was only after Rahul Dravid’s retirement in 2012 that Pujara truly made the No. 3 position his own, filling in with similar poise and stability. Throughout his Test career, Pujara has been India’s backbone in challenging conditions, especially overseas. One of his most celebrated performances came during the 2018-19 Border-Gavaskar Trophy in Australia, where he scored 521 runs across four Tests, including three centuries. His immense powers of concentration were key to India securing a historic first-ever Test series victory on Australian soil. He was rightly named Player of the Series. He reprised that grit during India’s miraculous 2020-21 tour of Australia, with valiant knocks in Sydney and Brisbane despite being battered by short balls, helping India win the series 2-1 while fielding a second-string side. Pujara’s slow scoring rate has often drawn criticism, especially in an era where strike rotation and aggression are highly valued. At times, his inability to accelerate or rotate strike put pressure on partners, leading to scrutiny from selectors and pundits alike. As a result, he was dropped multiple times between 2020 and 2023 due to poor form, only to fight his way back through consistent performances in the Ranji Trophy and English County Championship. In stark contrast to his red-ball dominance, Pujara’s limited-overs career never quite took off. In the IPL, despite being picked by franchises like Kolkata, Bengaluru, Punjab, and Chennai, he rarely got a chance to play.",
  "nationality": "India",
  "career_span": {
    "Test": "2010-2023",
    "ODI": "2013-2014",
    "IPL": "2010-2014"
  }
}