{
  "id": "pprofile_65584",
  "type": "player_bio",
  "player": "Sam Curran",
  "full_name": "Samuel Matthew Curran",
  "dob": "June 3, 1998",
  "role": "All-Rounder",
  "batting_style": "Left Handed",
  "bowling_style": "Left-arm medium fast",
  "teams": [
    "England",
    "ICC World XI",
    "Auckland Aces",
    "England XI",
    "Surrey",
    "Punjab Kings",
    "Chennai Super Kings",
    "England Under-19",
    "England Lions",
    "South",
    "Oval Invincibles",
    "Team Buttler",
    "MI Cape Town",
    "Desert Vipers"
  ],
  "bio": "If you have to find an example of strong cricketing genes, you need not look further than Sam Curran who comes from a family of cricketers. His grandfather played domestic cricket before his father represented Zimbabwe at the international level and he along with both his brothers were destined to become cricketers. Born on 3rd June 1998 in Northampton, England when his father was playing county cricket for Northamptonshire, he grew up and studied in Harare before moving permanently to England in 2012. He began playing cricket early and progressed rapidly while playing for Zimbabwe U13, where he was considered a prodigy, before relocation. He was immediately drafted into the Surrey side for age-division cricket and his growth was so rapid that he was picked into the senior side as soon as he turned 17 making his T20 debut in the NatWest T20 Blast midway through 2015. The following month he made his first-class debut for Surrey in the County Championship Division Two and made an instant impact with a five-wicket haul in his first outing followed by three more wickets in the second inning. Bearing a slight frame, Sam Curran has mild features and does not come across as a fast bowler but he makes up for these deficiencies with the ability to swing the ball both ways at a decent speed. As a left-arm bowler, his natural angle away from right-handed batters tends to cause massive problems and he possesses the requisite aggression to keep his opponents on their toes. His cricketing ability is not limited to his bowling as time and again he has proven to be quite proficient with the bat playing handy knocks down the order. A few days after his impressive five-fer in the County Championship, he made his List A debut in the Royal London One-Day Cup taking four wickets for 32 runs in his 7 overs. He was picked for the England U19 squad taking part in the 2016 ICC U19 World Cup where he scored 201 runs and took 7 wickets before becoming a part of the England Lions squad gaining ample attention from the national selectors. An injury to Ben Stokes gave Sam his opportunity to represent England at the international level. Sam made his Test debut against Pakistan midway through 2018, two days before he turned 20, in the second Test of the two-match series. A few weeks later he made his ODI debut against Australia taking two wickets and scoring 15 useful runs down the order. His moment of fame arrived in the five-match Test series that followed against India which was the number 1 side in the world. He claimed four wickets in the first inning of the first Test and scored a counter-attacking half-century in the final inning chase to clinch his maiden Player of the Match award. He was adjudged Player of the Series for helping his side win 4-1 having scored 272 runs and taking 11 wickets. It became evident that England had produced another genuine all-rounder as it was getting difficult to pick out which was his stronger suit. He was named the 2018 Cricket Writer’s Club Young Cricketer of the Year for his performances throughout the year and was rewarded with an Indian Premier League contract as he was bought by the Punjab franchise for INR 7.20 crore for the 2019 edition despite not playing a single international T20. He picked up a hat-trick in the second game he played against the Delhi franchise and soon after got his maiden fifty in the competition against the Kolkata franchise. He did show an aptitude for the shortest format of the game but due to the flat nature of the Indian pitches he proved to be mostly ineffective and was released by his franchise. He made his T20I debut late in 2019 against New Zealand and found himself in contention for selection in all three formats thereafter. He was bought by the Chennai franchise to play in the 2020 Indian Premier League for INR 5.5 crore and had a decent season taking 13 wickets along with scoring 186 runs. He was retained by his side for the 2021 season but played only 9 games and claimed 9 wickets. Midway through 2021, he took his maiden five-wicket haul in international cricket in the second ODI against Sri Lanka and was named in the squad for the 2021 ICC Men’s T20 World Cup. He was ruled out of the tournament due to a back injury that sidelined him for 7 months which also resulted in him opting out of the 2022 Indian Premier League mega auction. He made his comeback in the County Championship in the first half of 2022 and began regaining match fitness as he represented the Oval franchise in The Hundred. He kept growing in strength during his rehabilitation and claimed his first five-wicket haul in T20 cricket in the 2022 T20 Blast followed by his maiden first-class century scoring 126 runs in just 62 balls. He found himself back into the national set-up and was picked for the 2022 ICC Men’s T20 World Cup. In the first game of England’s campaign, Sam took his maiden T20I five-fer and became the first English player to achieve this feat. He was named the Player of the Match in the finals against Pakistan as he took three wickets and conceded just 12 runs in his four overs. He was the second-highest wicket-taker in the tournament claiming 13 wickets at an average of 11.38 and received the Player of the Series award for his contribution to England’s title run. This World Cup performance prompted a bidding war in the 2023 India T20 League auction and he was eventually bought by the Punjab franchise for a record sum of INR 18.50 crore. He had a decent season scoring 276 runs and picking up 10 wickets in 14 games. He was also one of the key players for Oval Invincibles and helped them win the Men's Hundred 2023 title. Curran was named in the England squad for the ODI World Cup 2023 and became the first English player to take a wicket off the first ball on his World Cup debut. Curran also played in some of the other franchise leagues around the world and gained valuable experience. Curran was part of the England squad for the 2024 T20 World Cup and he was picked up by Chennai for the 2025 Indian Premier League season.",
  "nationality": "England",
  "career_span": {
    "Test": "2018-2021",
    "ODI": "2018-2024",
    "IPL": "2019-2025"
  }
}