{
  "id": "pprofile_96648",
  "type": "player_bio",
  "player": "Allah Mohammad",
  "full_name": "Allah Mohammad Ghazanfar",
  "dob": "March 20, 2006",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Off break",
  "teams": [
    "Derbyshire",
    "Kolkata Knight Riders",
    "Mumbai Indians",
    "Afghanistan Under-19",
    "Afghanistan",
    "Rangpur Riders",
    "Afghanistan A",
    "Band-e-Amir Region",
    "Band-e-Amir Dragons",
    "Mis-e-Ainak Knights",
    "Team Abu Dhabi",
    "Colombo Strikers",
    "Kabul Zalmi",
    "Sunrisers Eastern Cape",
    "Rawalpindi Raiders",
    "Abu Dhabi Knight Riders",
    "MI Emirates",
    "Pokhara Avengers",
    "Junior Champions",
    "Antigua & Barbuda Falcons"
  ],
  "bio": "Allah Mohammad Ghazanfar, a promising young cricketer from Afghanistan, has quickly made a name for himself with his impressive bowling skills. Known for his off-break deliveries, Ghazanfar has been compared to the renowned Afghan spinner Mujeeb Zadran. His journey began in the Paktia Province, where he transitioned from a fast bowler to a spin bowler under the guidance of former Afghanistan captain Dawlat Ahmadzai. Ghazanfar's bowling prowess was evident during his debut for the Mis Ainak Knights in the Afghan Shpageeza Cricket League, where he took 1-27 in four overs, followed by a four-wicket haul in his second match. His performance in the 2024 Under-19 Cricket World Cup was notable, particularly his 3-29 against New Zealand, showcasing his potential on the international stage. Ghazanfar's bowling style is characterized by his ability to maintain a tight line and length, making him a challenging opponent for the batters. His adaptability to different pitch conditions and his knack for picking up crucial wickets have been key to his success. In the 2024 ODI series against Zimbabwe, he claimed a five-wicket haul, conceding just 33 runs, further cementing his reputation as a formidable bowler. His best bowling figures in ODIs stand at 6-26 against Bangladesh, highlighting his capability to deliver match-winning performances. While Ghazanfar's batting contributions have been limited, his primary role as a bowler has been instrumental in his team's successes. In the domestic circuit, he has played for teams like the Rawalpindi Raiders in the Pakistan Junior League and the Band-e-Amir Dragons in the Shpageeza Cricket League, where he consistently delivered with the ball. His performances in the ACC Men's T20 Emerging Teams Asia Cup, where he took multiple two-wicket hauls, demonstrate his consistency and potential to excel in the shortest format of the game. With his impressive start and a promising future, Allah Mohammad Ghazanfar is undoubtedly a player to watch in the coming years, as he continues to develop and contribute to Afghanistan's cricketing success.",
  "nationality": "Afghanistan",
  "career_span": {
    "Test": "2024-2024",
    "ODI": "2024-2024",
    "IPL": ""
  }
}