{
  "id": "pprofile_4508",
  "type": "player_bio",
  "player": "Wriddhiman Saha",
  "full_name": "Wriddhiman Prasanta Saha",
  "dob": "October 24, 1984",
  "role": "Wicket-Keeper",
  "batting_style": "Right Handed",
  "bowling_style": "-",
  "teams": [
    "India",
    "East Zone",
    "India A",
    "India Blue",
    "Indian Board Presidents XI",
    "India Red",
    "Rest of India",
    "Kolkata Knight Riders",
    "Punjab Kings",
    "Chennai Super Kings",
    "Bengal",
    "Tripura",
    "Sunrisers Hyderabad",
    "Indians",
    "Gujarat Titans",
    "Rashmi Medinipur Wizards"
  ],
  "bio": "Just as a reserve goalkeeper in any sport has to await his chance till the established one gives way, the scenario has become the same for modern-day wicketkeepers. Drafted into the Bengal side after regular glove-man Deep Dasgupta opted for the rebel league, Wriddhiman Saha’s century on his Ranji debut was instrumental in propelling him to the Indian Premier League stage where Kolkata signed him in 2008. Despite having McCullum and Taibu as specialist keepers in the team, the former’s reluctance to don the keeping gloves and the four-foreign player rule resulted in him playing a major chunk of the tournament and he displayed his batting talents with a half-century. He was later bought by Chennai in 2011. Saha couldn’t get many chances with Dhoni taking the gloves and other prominent batsmen edging him easily into the playing XI. However, the 2014 season provided him with a new dawn as he was picked by Mohali in the auction, with no other specialist keeper in the squad. He managed to impress not only with his glove work but also with his bat where is scored 362 runs at an average of 32.90 and a strike-rate of 145.28. He also scored the century, which was the first-ever century in the Indian Premier League final. His knock came in a losing cause but he did impress many with his knock. In 2018 he was picked up by Hyderabad. A few fine performances for India A later helped Saha earn his maiden Test call-up in early 2010 as the team’s reserve wicket keeper with his chances of debuting next to impossible. However, India’s bizarre decision to go into the series with just seven specialist batsmen backfired as Laxman and Rohit Sharma injured themselves before the game and with little time left, Saha was quickly drafted in as a specialist batsman. The nerves showed as he got out on a duck in the first innings but was more watchful in his second scoring 36. Dropped thereafter, he returned to the ODI version in late 2010, debuting against New Zealand after MS Dhoni was rested for the series. In 2011, he earned a surprise call-up to India’s ODI squad for the series in the West Indies, in the absence of most of the senior players. But he didn't any game as he was picked as a reserve for first-choice wicketkeeper Parthiv Patel. He was then part of the squad touring Australia in 2011/12. Saha got his chance to play when Dhoni for suspended for a game due to slow overrate. He did some decent scoring as he scored 25 in the first inning and 13 in the second inning. As Dhoni retired from Test cricket in 2014 it opened the gates for Saha to become the Indian Test team's first-choice keeper. In 2016, Saha was picked for the squad touring West Indies. In the first Test itself, Saha made record books as he became the third wicketkeeper in Indian Cricket history to be featured in six dismissals in an innings. He notched his maiden Test century when he scored 104 against the hosts in the third Test match. In 2018 against South Africa, Saha again made it in record books when he became the first Indian wicketkeeper to take 10 catches in a single Test. In 2019, Saha played in the 3-match Test series against South Africa in India and became the fifth wicket-keeper for India to affect 100 dismissals in Test cricket in November 2019. In January 2020, he was selected for 2 Test Series in New Zealand but did not play any matches. In December 2020, he was selected for 4 Test Match series in Australia and played only in the first Test. In November 2021, Saha was selected as the first-choice wicketkeeper in the two-match test series between India and New Zealand. Despite suffering a neck injury during the first test, he scored an unbeaten 61 runs during the second innings of the match. He amassed 214 runs in 2020 at an average of over 70, including two half-centuries. With a strike rate of 93.57 and an average of 14.55, he scored 131 runs in 2021. Sunrisers Hyderabad released him prior to the 2022 Indian Premier League auction after which he was picked up by the then newly formed Gujarat franchise and he went on to win the title with them in their maiden 2022 season. Saha has continued to be an integral part of the Gujarat franchise.",
  "nationality": "India",
  "career_span": {
    "Test": "2010-2021",
    "ODI": "2010-2014",
    "IPL": "2008-2024"
  }
}