{
  "id": "pprofile_63520",
  "type": "player_bio",
  "player": "Shashank Singh",
  "full_name": "Shashank Singh",
  "dob": "November 21, 1991",
  "role": "Batsman",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm medium",
  "teams": [
    "Punjab Kings",
    "Delhi Capitals",
    "Rajasthan Royals",
    "Mumbai",
    "Sunrisers Hyderabad",
    "Western Wolves",
    "Chhattisgarh",
    "Triumph Knights Mumbai North East",
    "DY Patil Group B",
    "Chhattisgarh CC",
    "Chhattisgarh Red",
    "Chhattisgarh Blue"
  ],
  "bio": "The 25-year-old Shashank Singh is an aggressive all-rounder originally from Madhya Pradesh. Singh came to the limelight with his unsung contribution in the recently concluded West Zone Inter-State T20 Tournament where he represented Mumbai. In his brief career so far, he has proved a utility player with his handy off-breaks while also hitting the long ball when needed. Mumbai boasts of a powerful batting line-up and hence he didn't always get a lot of opportunities. His chance finally came against Saurashtra where he belted an unbeaten 22-ball 47 to take Mumbai home in a tense run-chase in the company of the experienced Abhishek Nayar. That was an inning that made people take notice of his hard-hitting abilities and eventually gifted him an Indian Premier League contract with Delhi for the 2017 season. In 2019, Rajasthan bought him and he also made his first-class debut for Chattisgarh. He couldn't cement his place in the Rajasthan squad and was released in 2021. He was picked up by Hyderabad in the following season where he got a few games. His big moment came in 2023 when he became the first Indian First Class cricketer to score 150 runs and take five wickets in the same match during his team's Vijay Hazare Trophy 2023 win over Manipur by 88 runs. His decent domestic performances made Punjab buy him ahead of the 2024 Indian Premier League but not without some controversy. There was some confusion at the auction table as two players of the same name were on the list, and it seemed like Punjab bought him by mistake, but the franchise has come forward and cleared the air, saying that he was always a target for them. Shashank was one of the few who performed well in an otherwise disappointing campaign for Punjab. His most notable knock was the 68 off just 28 balls, helping Punjab chase 262 against Kolkata which was the highest successful chase in the format anywhere in the world. From his controversy in the auction to being one of the two players retained by Punjab ahead of the 2025 season, he surely made his mark.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "",
    "IPL": "2022-2025"
  }
}