{
  "id": "pprofile_64274",
  "type": "player_bio",
  "player": "Andrew Tye",
  "full_name": "Andrew James Tye",
  "dob": "December 12, 1986",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm medium fast",
  "teams": [
    "Australia",
    "Australia A",
    "Durham",
    "Gloucestershire",
    "Northamptonshire",
    "Punjab Kings",
    "Chennai Super Kings",
    "Rajasthan Royals",
    "Western Australia",
    "Perth Scorchers",
    "Sydney Thunder",
    "Gujarat Lions",
    "Karachi Kings",
    "Australians",
    "World XI",
    "Brampton Wolves",
    "Team Abu Dhabi",
    "Lucknow Super Giants",
    "Western Australia XI",
    "Dubai Capitals",
    "Seattle Orcas",
    "Washington Freedom",
    "Caribbean Tigers"
  ],
  "bio": "Andrew Tye is a right-arm fast bowler who excels in the ability of bowling yorkers at will and has clever variations to deceive any batsman. He is one of the late bloomers in international cricket as he made his debut for Western Australia in the state one-day competition at the age of 26. He ended the tournament on a high and finished as the second most successful bowler by bagging 13 wickets. A modern day bowler who specialized the art of bowling at the death, he was soon selected by the Sydney Thunders franchise for the 2013-14 Big Bash League. In the very next year, he changed his loyalties to Perth Scorchers and that was the season which saw his rise. His impressive performances there landed him with a call-up for the national team against India in 2016. He made his Indian T20 League debut in the 2017 edition for the Gujarat franchise and registered the then best bowling figures by a bowler on his debut (5/17) which included a hat-trick. In January 2018, Tye was named in Australia's One Day International squad for the series against England. He made his ODI debut for Australia in that series on 14th January 2018. Later that year, he was bought by Punjab for the 2018 Indian T20 League. In that season, he picked up 24 wickets and was the highest wicket-taker. Tye finished the year becoming the leading wicket-taker in T20Is in 2018 with 31 wickets. He wasn't too effective in the following edition and was released by Punjab ahead of the 2020 auction. Rajasthan bagged his services after spending INR 1 crore.",
  "nationality": "Australia",
  "career_span": {
    "Test": "",
    "ODI": "2018-2018",
    "IPL": "2017-2022"
  }
}