{
  "id": "pprofile_10043",
  "type": "player_bio",
  "player": "Dan Christian",
  "full_name": "Daniel Trevor Christian",
  "dob": "May 4, 1983",
  "role": "All-Rounder",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm fast medium",
  "teams": [
    "Australia",
    "South Australia",
    "Gloucestershire",
    "Hampshire",
    "Nottinghamshire",
    "Royal Challengers Bengaluru",
    "Delhi Capitals",
    "Deccan Chargers",
    "Middlesex",
    "New South Wales",
    "Victoria",
    "Australia Under-19",
    "Brisbane Heat",
    "Hobart Hurricanes",
    "Melbourne Renegades",
    "Sydney Sixers",
    "Sydney Thunder",
    "Barbados Royals",
    "Trinbago Knight Riders",
    "Rising Pune Supergiant",
    "Karachi Kings",
    "Prime Ministers XI",
    "Multan Sultans",
    "Jozi Stars",
    "Dublin Chiefs",
    "Manchester Originals",
    "Ponting XI",
    "Manipal Tigers",
    "VVIP Uttar Pradesh",
    "NY Superstar Strikers",
    "Australia Champions",
    "Australia Masters"
  ],
  "bio": "A product of the Australian Cricket Academy of 2003, Daniel Christian has been a huge asset and a notable contributor to Australia's domestic cricket. A right-hand batsman and a right-arm fast-medium bowler, Christian's impressive performances for South Australia fetched him all the limelight, especially his contribution to the Under 19 team that won the World Cup in 2001-02. Moving from New South Wales, Christian debuted in first-class cricket for South Australia in 2008. His powerful hitting coupled with his wicket-taking ability made him the perfect all-rounder for his team. He was soon elevated to Australia's Twenty20 set-up a year later. With a solid domestic background, Christian was picked to debut in national colours in a T20I encounter against the West Indies in 2010. He also made it to Australia's T20I side for the 2010 World Twenty20. He went on to make his debut against India in 2012 in the home Tri-series involving Sri Lanka. In this series, he became the fourth Aussie to take a hat-trick in ODIs, which came against Sri Lanka. However, his moment of recognition arrived with an India T20 League call-up in 2011, where the Deccan Chargers signed him for the fourth season. It was then that “Dan” shone in his favorite format, emerging as one of the most talented players in the team. Two years later, he was bought by the Bangalore for the sixth season. Christian is one of the best players to have played in the BBL. He was the Man of the Match in the 2018-19 BBL final and has grown stronger ever since. Daniel was part of the Sydney Sixers squad in the 2020-21 edition of the BBL and was one of the key reasons for their title triumph. Known for being a serial T20 trophy winner, Christian put forward his name for the 2021 edition of the Indian T20 League and was picked up again by Bangalore.",
  "nationality": "Australia",
  "career_span": {
    "Test": "",
    "ODI": "2012-2021",
    "IPL": "2011-2021"
  }
}