{
  "id": "pprofile_69656",
  "type": "player_bio",
  "player": "Ayush Badoni",
  "full_name": "Ayush Badoni",
  "dob": "December 3, 1999",
  "role": "Batsman",
  "batting_style": "Right Handed",
  "bowling_style": "Off break",
  "teams": [
    "India A",
    "North Zone",
    "India Under-19",
    "Delhi",
    "Lucknow Super Giants",
    "South Delhi Superstarz"
  ],
  "bio": "Ayush Badoni is a utility cricketer who hails from India. He is a skilful right-handed batter who can also contribute with his off-spin bowling. He is a lightning-quick fielder as well, which makes him a three-dimensional player that every team would love to have in their ranks. In 2021, he made his T20 debut for Delhi in the Syed Mushtaq Ali Trophy. He showed his true potential in a U-19 four-day game against Sri Lanka where Badoni troubled the batters with an excellent spell as he picked up four wickets while conceding just 24 runs. He then smashed 185 runs off 202 balls, which caught the eye of a lot of scouts. Badoni realized his dream when the Lucknow franchise bought him for the 2022 Indian Premier League. He came into the limelight on the big stage when he scored his maiden half-century on his debut against Gujarat. His hook shot for a six against one of the fastest bowlers world Lockie Ferguson had tongues wagging and he also showed a great aptitude to handle Rashid Khan who can be considered one of the best T20 spinners in the world. He had played for the Delhi domestic side only a handful of times but Gautam Gambhir, the mentor of the Lucknow side, backed him and he repaid his faith showing calmness beyond his years. In the latter part of 2022, he made his List A debut, and in early 2023, he played his maiden first-class match for Delhi and scored 40 runs in the second innings. Ayush Badoni remains a key player for Lucknow, consistently justifying the trust placed in him with his clutch performances. His ability to deliver under pressure makes him a player to watch in the seasons ahead. As he continues to evolve, his impact extends beyond franchise cricket, with a potential call-up to the national team seemingly on the horizon.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "",
    "IPL": "2022-2025"
  }
}