{
  "id": "pprofile_62023",
  "type": "player_bio",
  "player": "Travis Head",
  "full_name": "Travis Michael Head",
  "dob": "December 29, 1993",
  "role": "Batsman",
  "batting_style": "Left Handed",
  "bowling_style": "Off break",
  "teams": [
    "Australia",
    "South Australia",
    "Australia A",
    "Worcestershire",
    "Yorkshire",
    "Royal Challengers Bengaluru",
    "Delhi Capitals",
    "Australia Under-19",
    "Sussex",
    "Adelaide Strikers",
    "Sunrisers Hyderabad",
    "National Performance Squad",
    "Australians",
    "Washington Freedom"
  ],
  "bio": "Travis Michael Head, born in the northern suburbs of Adelaide, has carved a remarkable journey in cricket, representing Australia across all formats of the game. A left-handed batter with a penchant for counterattacking and a part-time off-spin bowler, Head's career is a testament to grit, determination, and exceptional talent. Whether donning the whites for South Australia or taking centre stage in international cricket, Head's contributions have been nothing short of extraordinary. Head's leadership credentials have also shone brightly. Initially named co-vice-captain of the Australian Test side in 2019, he returned to the role alongside Steve Smith in the 2023 Pakistan series. Adding to his leadership repertoire, he captained the Australian T20I side and served as ODI vice-captain in 2024. But it’s not just leadership that defines Head. His performances on the biggest stages have cemented his legacy. He was pivotal in Australia's triumphs in the 2023 ICC World Test Championship Final and the 2023 ICC Cricket World Cup Final, earning Player of the Match honors in both. In fact, Head made history by becoming the first cricketer to score centuries in two consecutive ICC tournament finals in a single calendar year. Head's love affair with cricket began at Craigmore Cricket Club and Trinity College, where his talents first came to light. Representing South Australia in Under-17 and Under-19 competitions, he showcased leadership early on by captaining his team to victory in the National Under-19 Championships and being named Player of the Tournament twice. His first-class debut for South Australia in the Sheffield Shield came at just 18, setting the stage for a flourishing domestic career. In 2015, at the age of 21, he was named captain of South Australia, becoming the youngest in the team’s 122-year first-class history. Head's exploits with the bat were nothing short of sensational. He announced himself in the 2015–16 season with a breathtaking List A double century, blasting 202 off 120 balls to chase down a daunting 351-run target. Around the same time, he registered his maiden first-class and T20 centuries, the latter in a thrilling New Year’s Eve performance for the Adelaide Strikers, where he scored 56 runs in the last three overs to clinch victory. These feats did not go unnoticed; Head was soon called up to the Australian side, making his international debut in a T20I against India at his home ground, the Adelaide Oval. Consistent domestic performances saw Head shine across formats, including a historic Sheffield Shield Player of the Year award and multiple match-winning innings for South Australia. His ODI debut followed in 2016, and a maiden century came soon after in 2017, where he partnered with David Warner to post a record-breaking 284-run stand against Pakistan. Despite the early highs, Head faced challenges cementing his Test spot, but his resilience paid off with key contributions in the 2021–22 Ashes, where he earned the Compton–Miller Medal for Player of the Series. Head’s ability to rise to the occasion became a hallmark of his career. In the 2023 ICC World Test Championship Final, he scored a dazzling 163, followed by a stunning century in the World Cup Final against India, guiding Australia to its sixth title. His heroics continued in T20Is, where he climbed to the top of the ICC batting rankings and captained Australia in 2024, showcasing his versatility and leadership skills. The IPL also witnessed Head’s brilliance, particularly during his stints with Bangalore and Hyderabad. In the 2024 season, he began with a fiery 24-ball 62 and later smashed an unforgettable 102 off 41 balls to propel his team, Hyderabad to the finals. Head finished as Hyderabad’s leading run-scorer with 567 runs. Through the years, Travis Head has consistently delivered moments of magic, whether with bat or ball, in domestic cricket, the IPL, or on the international stage. His journey is one of resilience, talent, and an unyielding hunger to shine when it matters most.",
  "nationality": "Australia",
  "career_span": {
    "Test": "2018-2025",
    "ODI": "2016-2025",
    "IPL": "2016-2025"
  }
}