{
  "id": "pprofile_57308",
  "type": "player_bio",
  "player": "Billy Stanlake",
  "full_name": "Billy James Stanlake",
  "dob": "November 4, 1994",
  "role": "Bowler",
  "batting_style": "Left Handed",
  "bowling_style": "Right-arm fast",
  "teams": [
    "Australia",
    "Queensland",
    "Tasmania",
    "Australia A",
    "Derbyshire",
    "Yorkshire",
    "Royal Challengers Bengaluru",
    "Australia Under-19",
    "Adelaide Strikers",
    "Hobart Hurricanes",
    "Melbourne Stars",
    "Sunrisers Hyderabad",
    "National Performance Squad",
    "Australians",
    "Southern Storm",
    "South Brisbane",
    "Hobart Hurricanes Academy"
  ],
  "bio": "Billy Stanlake has what it takes to be called as an express pace bowler, he stands tall at a height of 6ft and 8in , produces express pace, have a rhythm in his bowling and also allows the ball to swing. The Australian pacer who hails from Queensland made a name for himself in first class arena with his lethal pace and his ability to produce extra bounce using his height. But that is not how Stanlake started, in his initial life his father along with his brother motivated him to join Australian Rules Football, until Billy changed his school and showered his love to cricket. After joining cricket, he became a successful youth cricketer, he represented Queensland U-19 and then was picked for 2012 and 2014 U-19 World Cups. Although he suffered injury in both of editions but was able to participate and play in the latter, where he turned out to be most economical bowler for Aussies which helped him to get a contract with Queensland for 2014-15 season. Stanlake was a surprise call up for international team and made an ODI debut against Pakistan in January 2017. On his debut he made to record books for Australia as he became the tallest player to represent Australia at international level at time of his debut. He made his T-20 debut in the same year against Sri Lanka. Billy Stanlake has also shown that with the use of his height and smooth bowling action he can even notch up the speed of 150 kmph, and is a lethal weapon in Australia's arsenal. In the franchise cricket, Billy Stanlake has been a part of the Adelaide Strikers since 2015 while in the Indian T20 League, Billy was bought by Hyderabad in the 2018 auction after he spent a year with Bangalore.",
  "nationality": "Australia",
  "career_span": {
    "Test": "",
    "ODI": "2017-2019",
    "IPL": "2017-2018"
  }
}