{
  "id": "pprofile_11803",
  "type": "player_bio",
  "player": "Suryakumar Yadav",
  "full_name": "Suryakumar Ashok Yadav",
  "dob": "September 14, 1990",
  "role": "Batsman",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm medium",
  "teams": [
    "India",
    "India A",
    "India B",
    "India Blue",
    "India Red",
    "West Zone",
    "Kolkata Knight Riders",
    "Mumbai Indians",
    "Mumbai",
    "Mumbai A",
    "India Under-23",
    "Triumph Knights Mumbai North East",
    "India C",
    "Team B",
    "Team C"
  ],
  "bio": "Suryakumar Yadav, fondly known as \"SKY,\" is a dynamic Indian cricketer celebrated for his fearless batting and innovative stroke play. Born on September 14, 1990, Suryakumar honed his skills at the prestigious Elf Vengsarkar Academy, excelling in age-group cricket for Mumbai. While he was also a talented badminton player, cricket became his true calling. After excelling in Mumbai's domestic circuit and earning a spot in the Ranji Trophy, he began to make waves with consistent performances. His Indian Premier League journey started in 2012 with Mumbai, followed by a successful stint with Kolkata. In 2018, he returned to Mumbai and solidified his position as a top-order mainstay. Known for his versatility and ability to execute unorthodox shots under pressure, Suryakumar has become one of modern cricket's most dependable players. Suryakumar announced his international arrival with a six off his first ball in T20Is against England in March 2021, followed by an impressive ODI debut later that year. In 2023, he made his Test debut in Nagpur against Australia. However, his true prowess has shone brightest in T20 cricket, where he has been a cornerstone for India. The year 2024 was particularly memorable for Suryakumar Yadav, as he was part of India's T20 World Cup-winning squad. Following the retirements of stalwarts like Virat Kohli, Rohit Sharma, and Ravindra Jadeja, Suryakumar was entrusted with the leadership of India's T20I side, marking the next chapter of his illustrious career. As the year came to a close, Suryakumar tasted more success on the domestic front. While he did not have the most prolific campaign as a batter, he was a part of Mumbai’s triumph in the Syed Mushtaq Ali Trophy, helping them secure their second title in the tournament's history.",
  "nationality": "India",
  "career_span": {
    "Test": "2023-2023",
    "ODI": "2021-2023",
    "IPL": "2012-2025"
  }
}