{
  "id": "pprofile_4338",
  "type": "player_bio",
  "player": "Trent Boult",
  "full_name": "Trent Alexander Boult",
  "dob": "July 22, 1989",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Left-arm fast medium",
  "teams": [
    "New Zealand",
    "Northern Districts",
    "New Zealand A",
    "Kolkata Knight Riders",
    "Delhi Capitals",
    "Rajasthan Royals",
    "Mumbai Indians",
    "New Zealand Under-19",
    "Melbourne Stars",
    "Sunrisers Hyderabad",
    "New Zealanders",
    "Toronto Nationals",
    "Northern Warriors",
    "Deccan Gladiators",
    "Birmingham Phoenix",
    "MI Cape Town",
    "MI Emirates",
    "MI New York"
  ],
  "bio": "Trent Boult, one of New Zealand’s finest left-arm pacers, was renowned for his ability to swing the ball both ways and trouble batters across conditions. While seaming tracks favoured his bowling, his ability to extract movement even on flat pitches made him a constant threat in world cricket. Born in Rotorua, Boult quickly emerged as a fast-bowling prodigy. He was selected for New Zealand’s U-19 squad for the 2008 World Cup, showcasing his raw pace and movement. His early potential earned him a place in the New Zealand A team for the 2007 winter training squad in Lincoln. By 17, he was the fastest bowler in secondary school cricket in the country. Boult’s international debut came in 2011 against Australia in Hobart, where he made an immediate impact, taking four wickets to help secure New Zealand’s first Test win in Australia since 1985. However, his career faced an early challenge when he suffered a major stress fracture in his back, attributed to his modified bowling action. Seeking guidance from former Kiwi great Shane Bond, he reverted to his original action, which significantly improved his performance. In 2013, Boult announced himself on the big stage with a stunning 10-wicket haul against the West Indies at the Basin Reserve, firmly establishing himself as a premier Test bowler. Boult formed a lethal new-ball partnership with Tim Southee, a duo that played a key role in many of New Zealand’s victories. In 2014 alone, the pair accounted for 67 out of 143 wickets taken by New Zealand in Tests. His defining moment came in the 2015 ICC Cricket World Cup, where he finished as the joint-highest wicket-taker with 22 scalps. His performances were instrumental in New Zealand reaching their first-ever World Cup final, including a match-winning five-wicket haul against Australia in the group stage. Though the Kiwis fell short in the final against Australia, Boult’s heroics earned him global recognition. While Boult didn’t feature in the 2016 ICC T20 World Cup due to tactical team decisions, his presence in franchise leagues grew. He was signed by Hyderabad in 2015 and later played for Kolkata (2017) and Delhi (2018), where he finished with 18 wickets in a struggling team. His biggest IPL moment came in 2020 with Mumbai. Purchased for 3.2 crore rupees, Boult delivered a phenomenal season, taking 25 wickets - the third-highest in the tournament, and bowling four maiden overs, the most by any player in a single IPL season. He was named Player of the Match in the final and was instrumental in Mumbai's title-winning campaign. Boult later moved to Rajasthan in 2022 before being repurchased by Mumbai ahead of the 2025 season. In January 2022, Boult took his 300th Test wicket in a match against Bangladesh. He continued to be a key figure for New Zealand despite stepping away from a central contract in August 2022 to focus on franchise cricket. Nevertheless, he remained available for major ICC tournaments and bilateral series. In May 2024, Boult was named in New Zealand’s squad for the 2024 ICC Men’s T20 World Cup. However, New Zealand suffered an early exit in the group stage, and following the tournament, Boult announced his retirement from international cricket. Trent Boult ended his career as one of New Zealand’s greatest-ever fast bowlers. His ability to generate prodigious swing and his impact in global tournaments cemented his place among the best left-arm pacers of his generation. While his international journey concluded in 2024, his presence in franchise cricket ensures that fans will continue to witness his brilliance with the ball.",
  "nationality": "New Zealand",
  "career_span": {
    "Test": "2011-2022",
    "ODI": "2012-2023",
    "IPL": "2015-2025"
  }
}