{
  "id": "pprofile_10025",
  "type": "player_bio",
  "player": "Ben Cutting",
  "full_name": "Benjamin Colin James Cutting",
  "dob": "January 30, 1987",
  "role": "All-Rounder",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm fast medium",
  "teams": [
    "Australia",
    "Queensland",
    "Australia A",
    "Kolkata Knight Riders",
    "Punjab Kings",
    "Rajasthan Royals",
    "Mumbai Indians",
    "Australia Under-19",
    "Brisbane Heat",
    "Sydney Thunder",
    "Sylhet Strikers",
    "Sunrisers Hyderabad",
    "Jamaica Tallawahs",
    "St Kitts and Nevis Patriots",
    "Quetta Gladiators",
    "Karachi Kings",
    "Peshawar Zalmi",
    "Prime Ministers XI",
    "World XI",
    "Bangla Tigers",
    "Surrey Jaguars",
    "Nangarhar Leopards",
    "Sindhis",
    "Amsterdam Knights",
    "Delhi Bulls",
    "Deccan Gladiators",
    "Dambulla Sixers",
    "Galle Marvels",
    "Lumbini All Stars",
    "South Brisbane",
    "Premium Aussies",
    "Australia Champions",
    "New York Lions CC",
    "Lumbini Lions",
    "Australia Masters"
  ],
  "bio": "Standing at 6 feet 4 inches, Ben Cutting's statuesque built adds an extra quality to the fiery pace of this prodigious national prospect. The right-arm fast bowler made his first class debut for Queensland in 2007, where he picked up three wickets. But unfortunately, a side strain kept him out of action for the rest of the year. Tall Cutting generates tremendous bounce by taking advantage of his height, and often surprises the batters with a faster delivery. His first innings 5-wicket haul in a match, included the likes of Phil Jaques, Philip Hughes and Simon Katich. However, Cutting was at his peak in the 2009-10 Sheffield Shield, becoming the leading wicket-taker with 46 scalps at an average of 23.91 and bagging a Test berth in Australia's squad against New Zealand at the Gabba in the 2011-12 season. Cutting has been a regular contribution in the one-day arena as well, taking wickets and scoring useful runs for his team. The talented speedster was included in the Punjab squad for the 2012 Indian Premier League along with South Africa's Kyle Abbott as replacement for injured players Stuart Broad and R Sathish. He made his international debut in an ODI against Sri Lanka and later in T20I as well against the same opposition in January 2013. He played for the Brisbane Heat in Australian Big Bash. He was bagged by Rajasthan in the 2014 season of the Indian T20 league for Rs. 80 lakhs.",
  "nationality": "Australia",
  "career_span": {
    "Test": "",
    "ODI": "2013-2014",
    "IPL": "2014-2019"
  }
}