{
  "id": "pprofile_71367",
  "type": "player_bio",
  "player": "Yuvraj Chaudhary",
  "full_name": "Yuvraj Chaudhary",
  "dob": "October 6, 2001",
  "role": "All-Rounder",
  "batting_style": "Left Handed",
  "bowling_style": "Slow left-arm orthodox",
  "teams": [
    "Central Zone",
    "Railways",
    "Uttarakhand",
    "India A Under-19",
    "Chandigarh",
    "Lucknow Super Giants",
    "Dehradun Warriors",
    "USN Indians"
  ],
  "bio": "Yuvraj Chaudhary, a promising all-rounder from India, has been making waves in domestic cricket with his impressive performances. Known for his left-handed batting and slow left-arm orthodox bowling, Chaudhary has shown the potential to become a key player for his teams. His journey in cricket began with the Uttarakhand team, where he made his first-class debut against Puducherry in January 2024. Since then, he has been a consistent performer, particularly in the Ranji Trophy, where he scored a remarkable 158 against Rajasthan, showcasing his ability to play long innings. Chaudhary's batting prowess is complemented by his bowling skills, making him a valuable asset in the shorter formats. In the Syed Mushtaq Ali Trophy 2024, he delivered a standout performance against Sikkim, scoring 61 runs off just 26 balls and taking four wickets for 15 runs, highlighting his all-round capabilities. His ability to contribute with both bat and ball has been crucial for his team, and his performances in the Vijay Hazare Trophy have further solidified his reputation as a dependable all-rounder. While Yuvraj Chaudhary is still carving out his niche in the cricketing world, his performances have not gone unnoticed. His ability to adapt to different formats and conditions has been praised by coaches and teammates alike. Although he has yet to make his mark on the international stage, his domestic performances suggest that he is on the right path to achieving greater heights in his cricketing career. In the IPL, Chaudhary has been associated with Lucknow, where he continues to hone his skills and gain valuable experience. His performances in the Uttarakhand Premier League have been noteworthy, with a high score of 103 against Nainital SG Pipers, further showcasing his potential as a future star in Indian cricket. Looking ahead, Yuvraj Chaudhary faces the challenge of maintaining his form and consistency as he aims to break into the national team.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "",
    "IPL": ""
  }
}