{
  "id": "pprofile_70761",
  "type": "player_bio",
  "player": "Tilak Varma",
  "full_name": "Namboori Thakur Tilak Varma",
  "dob": "November 8, 2002",
  "role": "Batsman",
  "batting_style": "Left Handed",
  "bowling_style": "Off break",
  "teams": [
    "India",
    "Hampshire",
    "India A",
    "South Zone",
    "Mumbai Indians",
    "India Under-19",
    "Hyderabad",
    "India Red Under-19",
    "India B Under-19",
    "Hyderabad U-19",
    "Reliance 1",
    "Team A"
  ],
  "bio": "Tilak Varma is an exciting talent in Indian cricket, known for his aggressive left-handed batting. Despite facing financial challenges growing up, Tilak’s childhood coach stepped in to support him by covering his coaching fees and equipment expenses, ensuring his passion for cricket was not hindered. He started his cricketing journey with Hyderabad, making his debut in all three formats during the 2018-19 season. A year later, he represented India at the 2020 Under-19 World Cup, though his performances were not his best during India’s runners-up finish. Varma's breakthrough came in the Indian Premier League, where he was bought by Mumbai in 2022. In his debut IPL season, he made an immediate impact, notably scoring 61 runs off 33 balls against Rajasthan in his second match. His consistent performances in both the IPL and domestic cricket earned him a call-up to the Indian national team for the 2023 T20I series against the West Indies. Tilak made his T20I debut in the opening game and finished as the highest run-scorer for India in that series. Though he had some inconsistent performances in the national setup post the West Indies tour, Tilak continued to impress in the IPL, scoring 416 runs in 13 innings during the 2024 season. His promise did not go unnoticed by the selectors, who named him captain for the Emerging Asia Cup, where India exited in the semifinals. That leadership experience boosted his confidence, and he went on to shine in South Africa, smashing back-to-back centuries in India's resounding 3-1 T20I series win.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "2023-2023",
    "IPL": "2022-2025"
  }
}