{
  "id": "pprofile_65860",
  "type": "player_bio",
  "player": "Mayank Dagar",
  "full_name": "Mayank J Dagar",
  "dob": "November 11, 1996",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Slow left-arm orthodox",
  "teams": [
    "India Green",
    "North Zone",
    "Royal Challengers Bengaluru",
    "Punjab Kings",
    "India Under-19",
    "Himachal Pradesh",
    "Sunrisers Hyderabad",
    "India Under-23",
    "Himachal Pradesh CC"
  ],
  "bio": "India have had a rich history of left arm spinners and they have been a major part of the team’s success over the years. The country still continues to produce left arm spinners with the likes of Mayank Dagar, Saurabh Kumar and Harpreet Brar coming up the ranks. Hailing from Delhi, Mayank Dagar is a left-arm spin bowler from India. He began his professional career when he made his List A debut for Himachal Pradesh against Railways during the Vijay Hazare Trophy 2015/16 season. Dagar was then picked in the India squad for the 2016 Under-19 World Cup in Bangladesh. He was a vital cog with 11 wickets from four games in India’s campaign where they finished as runners-up. Later in the year, he made his first-class A debut for Himachal Pradesh. Dagar was then picked by the Punjab franchise ahead of the 2018 Indian Premier League season but did not play that season. In 2022, the Hyderabad franchise bid heavily for him and acquired his services for the 2023 Indian Premier League season. Dagar featured in only three games for Hyderabad in that season before being traded to Bengaluru in a swap deal involving Shahbaz Ahmed. When the 2024 edition of the Indian Premier League comes around, Mayank Dagar will be keen to make a mark and repay the faith shown in him by the new franchise. Mayank Dagar is a crafty bowler with his left spin. He tends to bowl it slow and extract turn from the wicket. He also has handy variations to bamboozle the batter. With the bat, he has the ability to provide support lower down the order.",
  "nationality": "India",
  "career_span": {
    "IPL": "2023-2024"
  }
}