{
  "id": "pprofile_64448",
  "type": "player_bio",
  "player": "Navdeep Saini",
  "full_name": "Navdeep Amarjeet Saini",
  "dob": "November 23, 1992",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm fast",
  "teams": [
    "India",
    "India A",
    "India B",
    "India Green",
    "Kent",
    "Leicestershire",
    "North Zone",
    "Rest of India",
    "Worcestershire",
    "Royal Challengers Bengaluru",
    "Delhi Capitals",
    "Rajasthan Royals",
    "Delhi",
    "India C",
    "Indians",
    "East Delhi Riders",
    "West Delhi Lions"
  ],
  "bio": "Son of a driver hailing from Haryana, Navdeep is a dedicated right-arm pacer who represents Delhi in the domestic circuit and has been a valuable player for them in recent years. Saini made headlines in the 2017-2018 domestic season after becoming the leading wicket-taker for Delhi with 34 wickets and helped his team in reaching the Ranji Trophy finals. Saini was also the leading wicket-taker for Delhi in the 2018-19 Vijay Hazare Trophy. In February 2017 Navdeep was bought by the Delhi franchise for 10 lakhs in the 2017 Indian T20 League but he did not get to play a single game. Saini's improvement in ability to swing the ball and his impressive pace made him lethal in the domestic circuit. He was one of the few bowlers who can bowl at 150 clicks. His domestic performances led to a bidding war for him during the 2018 Indian T20 League auction where he eventually was bought by the Bengaluru franchise for a whopping 3 crores. After going unused in that edition, Saini turned up for Bangalore in 2019 and was the second most successful bowler for them. Seeing his destructive pace and swing with the red ball in the domestic circuit, Saini was included in India's Test squad for their one-off match against Afghanistan. Saini also travelled with India's World Cup squad in 2019 as one of the net bowlers. Following that tournament, Navdeep Saini was included in the ODI and T20I squads for the tour of West Indies. He had a dream outing in his first T20I match where he bagged a 3-wicket haul and became the 6th Indian to get the Man of the Match award on debut. With age on his side and a bag full of skill and talent, he shall look forward to cementing his place in the regular playing XI.",
  "nationality": "India",
  "career_span": {
    "Test": "2021-2021",
    "ODI": "2019-2021",
    "IPL": "2019-2023"
  }
}