{
  "id": "pprofile_67136",
  "type": "player_bio",
  "player": "Kulwant Khejroliya",
  "full_name": "Kulwant Khejroliya",
  "dob": "March 13, 1992",
  "role": "Bowler",
  "batting_style": "Left Handed",
  "bowling_style": "Left-arm medium fast",
  "teams": [
    "India A",
    "India B",
    "Royal Challengers Bengaluru",
    "Kolkata Knight Riders",
    "Delhi Capitals",
    "Mumbai Indians",
    "Delhi",
    "Madhya Pradesh",
    "Gujarat Titans",
    "Rewa Jaguars",
    "Indore Pink Panthers"
  ],
  "bio": "In recent times, India has managed to produce quite a few left-arm pacers who have shown a lot of promise on the domestic circuit. Arzan Nagwaswalla, Arshdeep Singh, and Kulwant Khejroliya have been some of those promising names. Kulwant Khejroliya is a left-arm fast bowler from India. Born in Jhunjunu, Rajasthan, Khejroliya made the switch to Delhi and began his cricket career there in 2016. He had an impressive showing in the trials but could not make it to the Delhi squad. In 2017, Khejroliya was eventually called up to the Delhi squad for the 2016–17 Vijay Hazare Trophy. He made his List A debut for Delhi against Himachal Pradesh in that competition. In the same year, he was selected by the Mumbai franchise for the 2017 Indian T20 League season. Khejroliya made his first-class debut in the 2017-18 season against Assam. He picked up 18 wickets in the season, including a six-fer in the semi-final of the Ranji Trophy. In 2018, he made his T20 debut for Delhi against Punjab in the 2018 Syed Mushtaq Ali Trophy. In what was his debut Syed Mushtaq Ali Trophy season, Khejroliya ended the competition as Delhi’s highest wicket-taker and helped them clinch the title. The Bangalore franchise was impressed by his performances and picked him up for the 2018 Indian T20 League season. He will appear for the Kolkata franchise in the 2023 Indian T20 League season. Kulwant Khejroliya is more of a seam bowler than a swing bowler. Khejroliya was picked up by the Mumbai Indians in 2024, but spent the entire season warming the bench, waiting for his chance in the playing XI. Despite this, he continued to impress with his performances at the domestic level. In the 2025 IPL auction, he initially went unsold, but Gujarat Titans showed interest during the accelerated round and secured his services for INR 30 lakhs. He can move the ball both ways. Moreover, he has the ability to generate bounce, which makes him tough to counter.",
  "nationality": "India",
  "career_span": {
    "IPL": "2018-2025"
  }
}