{
  "id": "pprofile_59314",
  "type": "player_bio",
  "player": "Evin Lewis",
  "full_name": "Evin Lewis",
  "dob": "December 27, 1991",
  "role": "Batsman",
  "batting_style": "Left Handed",
  "bowling_style": "-",
  "teams": [
    "West Indies",
    "West Indies A",
    "Rajasthan Royals",
    "Mumbai Indians",
    "Trinidad & Tobago Red Force",
    "West Indies Under-19",
    "Guyana Amazon Warriors",
    "Trinbago Knight Riders",
    "St Kitts and Nevis Patriots",
    "Dhaka Capitals",
    "Comilla Victorians",
    "Barisal Bulls",
    "Peshawar Zalmi",
    "Khulna Tigers",
    "Bangla Tigers",
    "Punjabi Legends",
    "Vancouver Knights",
    "Delhi Bulls",
    "Deccan Gladiators",
    "Karnataka Tuskers",
    "Jaffna Kings",
    "Lucknow Super Giants",
    "Chicago Steelpan Players",
    "Scarlet Ibis Scorchers",
    "Powergen Penal SC",
    "New York Strikers",
    "Pretoria Capitals",
    "Sharjah Warriorz",
    "Bess Motors Marchin Patriots",
    "Parakeet Buccaneers",
    "Dallas All Stars",
    "Harare Bolts",
    "Pirates Bay Raiders",
    "Boca Raton Trailblazers"
  ],
  "bio": "Evin Lewis, known as a destructive top-order batter, has gained significant recognition in the cricket world while representing the Men in Maroon. Inspired by Chris Gayle, he received mentorship from the Jamaican star, which helped him enhance his batting skills. Hailing from Trinidad, Lewis was a key member of the U-19 team that won the Caribbean Championship, a team he has been part of since 2012. Following impressive performances at the domestic West Indies level, Lewis was signed by the Barisal Bulls to compete in the Bangladesh Premier League. There, he demonstrated his explosive batting talent, notably scoring a blazing century against Dhaka Dynamites by amassing an unbeaten 101 runs from just 65 balls. As an exceptional T20 specialist, his achievements earned him a spot in the national team. He made his debut in a T20 International against Afghanistan on March 27, 2016, but did not score in his first match. However, he quickly made a mark by hitting his first T20I century in just his third appearance, dismantling India's bowling line-up and notably punishing Stuart Binny with five sixes in a single over. Lewis is widely recognized for his aggressive batting style and is considered a promising limited-overs cricketer for the West Indies and domestic T20 competitions worldwide. His talent was further recognized when, in February 2022, the Lucknow Super Giants bought him for the IPL. He delivered a quick-fire innings of 55 not out off 23 balls in a match against Chennai Super Kings, leading his team to their first-ever victory in the IPL. Later that year, he signed with the Jaffna Kings for their third season in the Lanka Premier League, continuing his career as a prominent T20 batter on the international circuit.",
  "nationality": "West Indies",
  "career_span": {
    "Test": "",
    "ODI": "2016-2025",
    "IPL": "2018-2022"
  }
}