{
  "id": "pprofile_71411",
  "type": "player_bio",
  "player": "Noor Ahmad",
  "full_name": "Noor Ahmad Lakanwal",
  "dob": "January 3, 2005",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Left-arm wrist spin",
  "teams": [
    "Chennai Super Kings",
    "Afghanistan Under-19",
    "Afghanistan",
    "Melbourne Renegades",
    "Saint Lucia Kings",
    "Trinbago Knight Riders",
    "Comilla Victorians",
    "Quetta Gladiators",
    "Karachi Kings",
    "Peshawar Zalmi",
    "Speen Ghar Region",
    "Mis-e-Ainak Region",
    "Band-e-Amir Dragons",
    "Boost Defenders",
    "Mis-e-Ainak Knights",
    "Bangla Tigers",
    "Kabul Region",
    "Khost Province",
    "Team Abu Dhabi",
    "Manchester Originals",
    "Welsh Fire",
    "Dambulla Sixers",
    "Galle Marvels",
    "Jaffna Kings",
    "Gujarat Titans",
    "Durban's Super Giants",
    "Sharjah Warriorz",
    "Far West United",
    "Texas Super Kings",
    "Joburg Bangla Tigers"
  ],
  "bio": "Noor Ahmad, a talented left-arm wrist spinner from Afghanistan, has gained significant recognition in T20 leagues worldwide, following the path of Rashid Khan and Mujeeb Ur Rahman. His unique skillset has made him a sought-after player in franchise cricket from a young age. Born on January 3, 2005, Noor made his first-class debut for Kabul Region on April 29, 2019, in the Ahmad Shah Abdali 4-day Tournament at just 14 years old. Later that year, he played his first T20 match for Mis Ainak Knights on October 8, 2019, in the Shpageeza Cricket League. By December 2019, he earned a spot in Afghanistan’s squad for the 2020 Under-19 Cricket World Cup. His career in franchise cricket took off in July 2020 when he was signed by the St Lucia Zouks for the Caribbean Premier League (CPL). Shortly after, on October 14, 2020, he made his List A debut for Mis Ainak Region in the Ghazi Amanullah Khan Regional One-Day Tournament. His growing reputation led to a contract with the Melbourne Renegades for the 2020–21 Big Bash League (BBL), making him the youngest player in the tournament’s history at just 15 years old. In 2021, Noor continued his rise in the T20 leagues. He was included as a net bowler for Chennai Super Kings in the Indian Premier League (IPL) and later played for Karachi Kings in the Pakistan Super League (PSL). By July 2021, he received a call-up to Afghanistan’s One Day International (ODI) squad for the series against Pakistan. In December 2021, he was named in Afghanistan’s squad for the 2022 ICC Under-19 Cricket World Cup in the West Indies. That same month, Quetta Gladiators signed him in the supplementary category for the 2022 PSL. He made his PSL debut on February 12, 2022, playing against Islamabad United at Lahore’s Gaddafi Stadium. His IPL breakthrough came in February 2022 when Gujarat Titans acquired him at the auction. Later that year, he played a pivotal role in Afghanistan’s Under-19 team, taking 10 wickets in the 2022 ICC Under-19 Cricket World Cup. This performance earned him a maiden international call-up, and on June 14, 2022, he made his T20I debut against Zimbabwe. He had an immediate impact, securing four wickets and winning the Player of the Match award. Later in 2022, Noor earned his ODI cap on November 30, making his debut against Sri Lanka. His impressive performances led to his selection in Afghanistan’s squad for the 2023 ODI World Cup in India. He played his first World Cup match on October 23, 2023, against Pakistan in Chennai, becoming the youngest debutant in the tournament at just 18 years old. In the IPL, he made a strong impression in his debut season by claiming 16 wickets, helping Gujarat Titans reach the final. His success in the T20 leagues continued in 2024. In May, he was selected for Afghanistan’s squad for the ICC Men’s T20 World Cup. Later that year, in November 2024, he was signed by Chennai Super Kings for the 2025 IPL season, further solidifying his reputation as a franchise cricket star. Noor’s ability to excel in multiple leagues across different conditions has made him an invaluable asset in T20 cricket. From his early teenage years, he has been a sought-after player in leagues such as the IPL, BBL, CPL, and PSL. His rise from playing domestic cricket in Afghanistan to representing his national team and excelling in global tournaments highlights his immense potential. As Noor continues his journey, his performances in international cricket and franchise leagues will be closely watched. With his rare left-arm wrist spin and ability to deliver match-winning performances, he remains one of the young talents to watch out for in the 2025 Champions Trophy.",
  "nationality": "Afghanistan",
  "career_span": {
    "Test": "",
    "ODI": "2022-2025",
    "IPL": "2023-2025"
  }
}