{
  "id": "pprofile_58223",
  "type": "player_bio",
  "player": "Shahbaz Ahamad",
  "full_name": "Shahbaz Ahamad",
  "dob": "December 11, 1994",
  "role": "All-Rounder",
  "batting_style": "Left Handed",
  "bowling_style": "Slow left-arm orthodox",
  "teams": [
    "India",
    "East Zone",
    "India A",
    "Royal Challengers Bengaluru",
    "Bengal",
    "Sunrisers Hyderabad",
    "Tapan Memorial Club",
    "Lucknow Super Giants",
    "Shrachi Rarh Tigers"
  ],
  "bio": "Shahbaz Ahmed, a promising all-rounder from Haryana, has been making waves in the Indian domestic circuit with his consistent performances. Representing Bengal in First-Class cricket, Ahmed has showcased his prowess as a left-handed batter and a slow left-arm orthodox bowler. His journey began with a List A debut against Jammu and Kashmir in the 2018/19 Vijay Hazare Trophy, followed by his First-Class debut against Hyderabad in the Ranji Trophy the same year. His T20 debut came in February 2019 against Haryana, marking the start of a promising career. Ahmed's ability to contribute with both bat and ball has been a significant asset for Bengal. In First-Class cricket, he has accumulated over 1800 runs at an average of above 43, with a highest score of 116 against Madhya Pradesh. His bowling has been equally impressive, with 103 wickets, including a best of 7/57 against Punjab. In List A cricket, he has scored over 1000 runs at an average of above and taken more than 58 wickets, showcasing his all-round capabilities. In the IPL, Ahmed has been a valuable player, having been part of the Bangalore-based franchise since 2020. His performances in the 2024 season were noteworthy, with a standout match against Rajasthan where he took 3 wickets for 23 runs. His overall IPL stats include more than 530 runs and 21 wickets, highlighting his dual role in the team. Ahmed's leadership qualities and match-winning performances have been evident in domestic tournaments. His ability to perform under pressure was showcased in the 2023 Vijay Hazare Trophy, where he scored a century against Haryana and took crucial wickets throughout the tournament. His all-round performance in the 2024 Syed Mushtaq Ali Trophy, including a century against Punjab, further cemented his reputation as a clutch player. Looking ahead, Shahbaz Ahmed, with his consistent performances, is expected to play a crucial role in Bengal's campaign in the Ranji Trophy and other domestic tournaments. His all-round abilities make him a strong contender for future national team selections, and he will be keen to make his mark on the international stage.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "2022-2022",
    "IPL": "2020-2025"
  }
}