{
  "id": "pprofile_65756",
  "type": "player_bio",
  "player": "Rishabh Pant",
  "full_name": "Rishabh Rajendra Pant",
  "dob": "October 4, 1997",
  "role": "Wicket-Keeper",
  "batting_style": "Left Handed",
  "bowling_style": "-",
  "teams": [
    "India",
    "Asia XI",
    "India A",
    "India B",
    "Indian Board Presidents XI",
    "India Red",
    "Leicestershire",
    "North Zone",
    "Delhi Capitals",
    "India Under-19",
    "Delhi",
    "Indians",
    "Lucknow Super Giants",
    "Purani Delhi 6",
    "Team B"
  ],
  "bio": "Rishabh Pant belongs to the Adam Gilchrist school of Cricketology, a dashing left-handed batter who keeps wickets as well for his side. Originally from Uttarakhand, Pant had to shift bases quite a few times from a tender age as he targeted playing cricket at the highest level. It was the 2016 U-19 World Cup that brought him fame across the country. He smashed a quickfire fifty against Nepal while also racking up a ton against Namibia soon after. Unlike most southpaws, Pant's strength is mostly in the arc between mid on and square leg as his terrific bat swing causes mayhem on the bowlers. He does pepper the off side too but not as much as the usual left-handed batter. Picked by the Delhi franchise in the Indian Premier League in 2016, Pant showed his skills with quite a few explosive knocks. Although he burst onto the scene as a batter for the limited-overs format, Pant also scaled greater heights for Delhi in the domestic circuit as far as the four-day format is concerned. He smashed a breathtaking century off just 48 balls in the 2016-17 season. Pant finished among the top five run-getters of the season and what stood out was his astonishing strike rate of 107 - unimaginable in this format especially considering his staggering consistency. After his mighty batting display for Delhi in the Indian Premier League in 2018, the Indian selectors took a chance with him in the shortest format of the game. He was part of India’s T20I squad for a few series but he was unable to display his magic. He had an impressive Indian Premier League season, scoring over 350 runs and a noteworthy Syed Mushtaq Ali Trophy in the 2017/18 season, which made him part of India’s T20I squad for the Nidahas Trophy in 2018. After the next few months, Pant was named in India’s Test squad against England and he received his Test cap in the game at Trent Bridge. The following month after his Test debut, Pant made his ODI debut against West Indies. Since then, Pant has cemented his spot in India’s team across formats. Within a few years into international cricket, and at the age of just 23, Pant scored over 1000 runs in Test cricket, including a Test hundred each in England and Australia. However, in 2020, Pant did have a slightly tough phase in his career. He was the first-choice wicket-keeper after Dhoni’s retirement, but those big shoes were never easy to fill. Pant had a poor Indian Premier League in 2020 and failed to impress in limited-over cricket. Fans often criticized him whenever he made a mistake on the field and was then compared to Dhoni. But that period did not last too long. Pant was dropped from the white-ball squad on their tour to Australia but he kept his spot in the longest format. He made most of his opportunities there. Rishabh scored 97 runs in the second Test in Melbourne and played a match-winning knock of 89 runs in the fourth innings of the Test at Gabba and helped India chase a target of 328 runs. Over the last few years, Pant has become one of the most crucial players for India across formats. He was also named in India’s T20 World Cup squad in 2021. Rishabh Pant was named captain of Delhi in the 2021 season after an injury to Shreyas Iyer ruled him out. He was retained as captain in the following season. Pant also captained India against South Africa in 5 T20Is in 2022. His career took a tragic turn on December 30, 2022, when he was involved in a severe car accident. Sustaining multiple injuries, including ligament tears, he underwent surgery and faced a lengthy rehabilitation process. Despite the setbacks, Pant’s return to cricket in 2024 was nothing short of remarkable. Though he struggled to find his rhythm during the IPL, his undeniable talent and resilience earned him a spot in India’s World Cup squad. While his individual performances were subdued, Pant was part of India’s historic title triumph. The southpaw announced his return to the Test arena in grand style with a ton in his first Test since the accident. In the New Zealand series that followed, Pant was a shining light for India in what was otherwise a tough series, where they suffered a whitewash in the Test format. Pant was the highest run-getter of the series, showcasing his resilience in challenging conditions. As the series against New Zealand came to a close, attention shifted to the marquee Border-Gavaskar Trophy, with high expectations surrounding the southpaw, especially after his heroics at The Gabba during the previous tour, where he had played a pivotal role in India's memorable chase. However, Pant had a disappointing tour, managing only one fifty throughout the series. In the Melbourne Test, Pant found himself under intense scrutiny for his shot selection. His dismissal in the second innings, at a time when the Test seemed to be heading towards a draw, triggered a collapse for India. The tourists would go on to lose that Test, leaving them needing a win in the fourth Test to retain the Border-Gavaskar Trophy, a feat they ultimately couldn’t achieve. The end of 2024 wasn't all doom and gloom for the swashbuckling wicketkeeper-batter. At the IPL auction for the 2025 season, Lucknow roped him in for an astonishing amount of INR 27 crores. In January 2025, Pant was also announced as the captain by Lucknow, marking a major milestone in his career and offering a fresh start after a challenging period.",
  "nationality": "India",
  "career_span": {
    "Test": "2018-2025",
    "ODI": "2018-2024",
    "IPL": "2016-2025"
  }
}