{
  "id": "pprofile_3366",
  "type": "player_bio",
  "player": "Parthiv Patel",
  "full_name": "Parthiv Ajay Patel",
  "dob": "March 9, 1985",
  "role": "Wicket-Keeper",
  "batting_style": "Left Handed",
  "bowling_style": "Off break",
  "teams": [
    "India",
    "Elite Group C",
    "India A",
    "India B",
    "Indian Board Presidents XI",
    "India Green",
    "India Red",
    "India Seniors",
    "PCA Masters XI",
    "Rest of India",
    "West Zone",
    "Royal Challengers Bengaluru",
    "Chennai Super Kings",
    "Mumbai Indians",
    "Deccan Chargers",
    "India Under-19",
    "Gujarat",
    "Kochi Tuskers Kerala",
    "Sunrisers Hyderabad",
    "India Maharajas",
    "Gujarat Greats",
    "Cape Town Samp Army",
    "Morrisville Unity",
    "Southern Super Stars",
    "One Family"
  ],
  "bio": "Parthiv Patel is one of the many wicket-keepers India utilized before Mahendra Singh Dhoni came to prominence. In his brief tenure with the Indian cricket team that began in 2002-03, Patel played some commendable knocks against some of the best bowling line-ups despite his petite frame. His glove work was splendid, but lacked consistency. He never achieved the same success as Dhoni and so returned unceremoniously to the domestic league. However, just when you thought you’d seen the last of this young lad, Patel's willow started scripting a comeback of its own in 2007. Four consecutive centuries in the first-class circuit against national teams put him into the limelight once again, and he was signed by Chennai in 2008 for the Indian T20 league. After three successful seasons there, he was auctioned to Kerala in 2011, where he was named skipper after the departure of Mahela Jayawardena. Parthiv was then bought by Hyderabad in 2012 for the fifth edition of the Indian T20 league. Along with Shikhar Dhawan, Parthiv was consistent at the top of the order in that outfit. Bengaluru took note of that and grabbed him for the seventh season in 2014. He didn't have a great time and was acquired by Mumbai for the eighth edition of the Indian T20 League. Patel struck form in the second half of the tournament where he hit 339 runs to finish as Mumbai's 4th highest run-getter in their victorious 2015 campaign. His good run continued as he led Gujarat to their maiden Vijay Hazare Trophy title, scoring his maiden List A ton. Runs continued to flow off his bat as he registered four fifties in nine Syed Mushtaq Ali Trophy games and followed it up with a century against India A in Deodhar Trophy. It was in 2016, four years since he last played for the national team, he received a shock call-up for India for the third Test against England in place of injured Wriddhiman Saha. He responded well to the call with a brisk fifty and a career-best 71, opening the batting. He was also the highest run-getter for Mumbai in their victorious Indian T20 League campaign in 2017. In the following year, Parthiv Patel returned to Bengaluru as he was bought in the 2018 auction and was one of the vital members of their gameplan. The left-hander remains part of the Bengaluru team and has done reasonably well for them. His international career didn't take off the way he would have liked but the little southpaw continues to work hard to stay in the hunt.",
  "nationality": "India",
  "career_span": {
    "Test": "2002-2018",
    "ODI": "2003-2012",
    "IPL": "2008-2019"
  }
}