{
  "id": "pprofile_66823",
  "type": "player_bio",
  "player": "Rahul Chahar",
  "full_name": "Rahul Desraj Chahar",
  "dob": "August 4, 1999",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Leg break googly",
  "teams": [
    "India",
    "India A",
    "India B",
    "India Green",
    "Rest of India",
    "Punjab Kings",
    "Mumbai Indians",
    "India Under-19",
    "Rajasthan",
    "Services",
    "Sunrisers Hyderabad",
    "India Under-23",
    "Rising Pune Supergiant",
    "India C",
    "Jodhpur Sunrisers",
    "Team B"
  ],
  "bio": "There is relatively a high demand for wrist spinners in modern-day cricket owing to their ability to take wickets in any situation of the game and Rahul Chahar is a right-hand leg spinner who has made quite an impact in his short career. Born on 4th August 1999 in Bharatpur situated in the state of Rajasthan in western India, he started training under his paternal uncle Lokendra Singh Chahar along with his cousin brother Deepak Chahar at the age of 8. He initially wanted to follow in his brother’s footsteps and became a fast bowler but soon realized that his main ability was to spin the ball. Rahul was so focused on becoming a cricket that he decided to sacrifice his studies and played through age-group cricket representing his state at U16, U19, and U22 levels. He made his first-class debut towards the end of 2016 for the Rajasthan senior team against Odisha in the Ranji Trophy and picked up one wicket in each inning. He made his List A debut at the start of 2017 against Madhya Pradesh in the Vijay Hazare Trophy and got his big opportunity when he was selected in the Pune franchise squad for the 2017 Indian Premier League. He made his T20 debut against the Punjab franchise claiming one wicket and this opportunity to play in the big league proved to be a massive boost to his career as he shared the dressing room with some of the greatest minds of modern cricket like MS Dhoni and Steven Smith. His talent was identified by the national selectors as well and he got his opportunity to play for India U19 and had an impressive tour of England where he was one of the highest wicket-takers. Despite this performance, he was not picked for the 2018 ICC U19 World Cup and was kept as a stand-by player. He was bought by the Mumbai franchise for the 2018 Indian Premier League for INR 1.90 crore but he missed the tournament and most of the 2017-18 domestic season with injuries. He came back strong the following season becoming the highest wicket-taker for Rajasthan in the 2018-19 Vijay Hazare Trophy with 20 wickets in 9 games. He played every game for the Mumbai franchise in the 2019 edition taking 13 wickets and helping his side claim the title that year. His performance piqued the interest of the selectors and he found himself in national reckoning. Rahul is not a massive turner of the ball but gives the ball good flight and drift with his main skills lying in his variation. He can change up his length and pace efficiently which can trouble the batters and has a vicious googly in his arsenal. These qualities resulted in him making his T20I debut against West Indies in the second half of 2019 with his brother Deepak also a part of the side. His chances were limited thereafter but he kept himself in contention with another impressive season with the Mumbai franchise in 2020 as he claimed 15 wickets and helped them clinch another title. The Mumbai side had a humbling 2021 Indian Premier League but Rahul continued his stellar run in the competition by grabbing 13 wickets and once again found himself on the fringes of the national team. Midway through 2021, he made his ODI debut against Sri Lanka away from home, picking up three wickets and was one of the standout bowlers in the game. He was part of the squad for the 2021 ICC Men’s T20 World Cup but did not play a single game in a disappointing campaign for India as they were unable to progress beyond the group stages. He has not featured for the national side since then, and due to inconsistent performances finds himself down the pecking order. The Mumbai franchise did not retain him ahead of the 2022 mega auction and he was eventually picked by the Punjab franchise for INR 5.25 crore after an extended bidding war involving 5 teams vying for his services. He justified his price tag by claiming 14 wickets that season and was retained by his side ahead of the 2023 season. In 2023, he could not replicate his form and only managed 8 wickets in 14 games, but the franchise showed faith and retained him again. Rahul worked on himself and emerged as one of the key players for Rajasthan in domestic cricket. SRH secured his services for ₹3.20 crore in the IPL 2025 auction, marking a new chapter in his career. With his experience and skill set, he is expected to play a key role in Hyderabad’s bowling attack in the upcoming season. Beyond the IPL, Rahul continues to be a key figure in domestic cricket. His performances in tournaments like the Vijay Hazare Trophy, where he consistently picked up wickets, prove that he remains a dependable spinner. His recent spell of 3/34 against Meghalaya showcased his ability to dismantle batting line-ups with his clever variations and control over line and length. Despite the challenges of modern T20 cricket, where batting-friendly conditions often make life difficult for bowlers, Rahul has adapted well. He understands the importance of economy rates and varies his pace and length smartly to keep batters in check. With a mature approach to his craft, he continues to evolve as a bowler. .",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "2021-2021",
    "IPL": "2017-2025"
  }
}