{
  "id": "pprofile_67540",
  "type": "player_bio",
  "player": "Mujeeb Ur Rahman",
  "full_name": "Mujeeb Ur Rahman",
  "dob": "March 28, 2001",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Off break",
  "teams": [
    "Asia XI",
    "Hampshire",
    "Kolkata Knight Riders",
    "Punjab Kings",
    "Mumbai Indians",
    "Middlesex",
    "Afghanistan Under-19",
    "Afghanistan",
    "Brisbane Heat",
    "Melbourne Renegades",
    "Sunrisers Hyderabad",
    "Rangpur Riders",
    "Barbados Royals",
    "Jamaica Tallawahs",
    "Comilla Victorians",
    "Peshawar Zalmi",
    "Speen Ghar Region",
    "Band-e-Amir Dragons",
    "Boost Defenders",
    "Kabul Eagles",
    "Mis-e-Ainak Knights",
    "Bangla Tigers",
    "Nangarhar Leopards",
    "Qalandars",
    "Northern Superchargers",
    "Galle Marvels",
    "Kandy Falcons",
    "Fortune Barishal",
    "Maiwand Defenders",
    "Hindukush Strikers",
    "Hindukush Stars",
    "Paarl Royals",
    "Dubai Capitals",
    "Gulf Giants",
    "Bulawayo Brave Jaguars",
    "Cape Town Samp Army",
    "Ajman Bolts"
  ],
  "bio": "A young prodigy from Afghanistan, Mujeeb developed a taste for cricket, while watching the 2012 T20I World Cup and that is where his journey in cricket began. He discovered his aptitude for spin bowling and learned how to bowl off-breaks and carrom balls too. He rose through the ranks to represent Afghanistan at the young age of just 16. He was named Rashid Khan's apprentice in the team, but he handled the pressure nicely and was well groomed too. He was also part of the Afghanistan Under-19 team that dismantled Bangladesh 3-1 in their own den. He peaked when he ended with figures of 7/19, defending a very low total of 133 and he showed how he is adaptable to pressure situations. Mujeeb continued to display his skill as he ended up with 20 wickets in 5 games, in the ACC Under-19 Asia Cup, with a very great performance in the semi-final and finals too. He made his ODI debut against Ireland in late 2017. His debut was something that he would never forget as he took 4 wickets for 24 runs, from his 10 overs, and helped them win the game, and was also awarded the Man of the Match. In May 2018, he was also named in Afghanistan's squad for their inaugural Test match, played against India and he also snared a wicket in the first innings. Just at the tender age of 17, he bagged a contract of INR 4 crore with Punjab in 2018. He also represented Afghanistan at the 2019 ICC Cricket World Cup and picked up 7 wickets in the tournament. Also, Hyderabad placed their trust in him, ahead of the 2021 Indian T20 League auctions and picked him for the 2021 season, for INR 1.50 crores. With age still on his side, Mujeeb has a long road ahead, in his cricketing journey, and with his displays so far, the future looks bright for the young Afghan. Mujeeb has been a prominent figure in the national side and played a key role in the side's success at the ICC Men's World Cup 2023 in India. Mujeeb has lost a bit of mystery about him but is still a very hand wicket-taking option and that is the reason that the Kolkata franchise picked him up in the auction for the 2024 season of the Indian T20 League.",
  "nationality": "Afghanistan",
  "career_span": {
    "Test": "2018-2018",
    "ODI": "2017-2023",
    "IPL": "2018-2025"
  }
}