{
  "id": "pprofile_23487",
  "type": "player_bio",
  "player": "Donovan Ferreira",
  "full_name": "Donovan Ferreira",
  "dob": "July 21, 1998",
  "role": "Wicket-Keeper",
  "batting_style": "Right Handed",
  "bowling_style": "Off break",
  "teams": [
    "South Africa",
    "Border",
    "Northerns",
    "Titans",
    "Yorkshire",
    "Delhi Capitals",
    "Rajasthan Royals",
    "Barbados Royals",
    "Tshwane Spartans",
    "Oval Invincibles",
    "Chennai Brave Jaguars",
    "New York Strikers",
    "Joburg Super Kings",
    "Texas Super Kings",
    "Harare Bolts"
  ],
  "bio": "Donovan Ferreira is a right-handed wicketkeeper batter from South Africa. Like many young cricketers, Ferreira had to work his way up through domestic cricket before getting noticed on the bigger stage. He made his T20 debut for Northerns in 2018, and over the next few years, he gradually built a reputation as a powerful striker of the ball and a handy off-spinner. His performances in South Africa's domestic tournaments, especially in the CSA T20 Challenge, showed glimpses of his immense potential. His versatility makes him a valuable asset in the modern game, where adaptability is key to success. Ferreira is an exciting all-rounder who can bat, bowl, and even do the wicket-keeping gloves when needed. It was in the 2020-21 CSA T20 Challenge that Ferreira truly showed his talent. Playing for the Titans, he amassed 166 runs in just six innings. His aggressive batting style and ability to finish games caught the attention of scouts from various T20 franchises around the world. The following season, he continued to impress, scoring 209 runs in the CSA One Day Cup. With such explosive performances, it was only a matter of time before he attracted big bids in franchise leagues. In the inaugural SA20 auction, Joburg Super Kings picked him up for R 5.5 million, making him one of the most expensive players in the tournament. He justified the price tag with a stunning 82* off just 40 balls in his debut game. Ferreira’s aggressive batting and all-round abilities also earned him a spot in South Africa’s national T20I team. In September 2023, he made his international debut against Australia in Durban and played a remarkable knock of 48 off 21 balls. His success in T20 cricket has also led him to the biggest stage of all, the Indian Premier League. In 2023, Rajasthan Royals secured his services for ₹50 lakh, and in 2024, they retained him for ₹75 lakh. His ability to accelerate in the middle order and contribute with the ball makes him a valuable addition to any team. In the 2025 Indian Premier League auction, Delhi Capitals acquired him for ₹75 lakh.",
  "nationality": "South Africa",
  "career_span": {
    "Test": "",
    "ODI": "",
    "IPL": "2024-2025"
  }
}