{
  "id": "pprofile_65160",
  "type": "player_bio",
  "player": "T Natarajan",
  "full_name": "Thangarasu Natarajan",
  "dob": "April 4, 1991",
  "role": "Bowler",
  "batting_style": "Left Handed",
  "bowling_style": "Left-arm medium",
  "teams": [
    "India",
    "Punjab Kings",
    "Delhi Capitals",
    "Tamil Nadu",
    "Sunrisers Hyderabad",
    "Lyca Kovai Kings",
    "Trichy Grand Cholas",
    "Dindigul Dragons",
    "IDream Tiruppur Tamizhans",
    "Vijay CC"
  ],
  "bio": "When we talk about modern-day toe-crushing yorkers, a name always comes to our mind, T Natarajan. He has been rated so highly of this skill. But his story is nothing short of inspirational. He comes from Chinnappampatti, a small village in Tamil Nadu, and grew up in a modest household. His father worked as a weaver, and his mother ran a small roadside food stall. As the eldest of five siblings, Natarajan faced many struggles, but his love for cricket remained strong. Playing with a tennis ball on dusty village grounds, he honed his natural talent for fast bowling without any formal training. His life took a major turn when a local well-wisher, Jayaprakash, spotted his talent and encouraged him to pursue professional cricket. With Jayaprakash’s guidance, Natarajan moved to Chennai and started playing in the Tamil Nadu Cricket Association (TNCA) leagues. He worked tirelessly to improve his bowling and soon made a mark with his ability to bowl pinpoint yorkers, a skill that would later make him famous. Natarajan made his first-class debut for Tamil Nadu in the 2014-15 Ranji Trophy. However, his career hit a roadblock when he was reported for a suspect bowling action. Instead of giving up, he worked hard to remodel his action and made a strong comeback. His breakthrough moment came in the inaugural Tamil Nadu Premier League (TNPL), where his yorkers became the talk of the town. His impressive performances caught the attention of Indian T20 League scouts, and in 2017, Kings XI Punjab (now Punjab Kings) bought him for a whopping ₹3 crore. The Indian T20 League, however, did not start as expected for Natarajan. He played only six matches in 2017 and was sidelined for the next two seasons. But he didn’t let the setbacks discourage him. He continued working on his skills, and in 2020, Sunrisers Hyderabad (SRH) picked him for ₹40 lakh. That season proved to be career-defining, as he emerged as one of the best death bowlers in the tournament. His ability to nail yorkers consistently made him a crucial asset for SRH. His IPL heroics earned him a call-up to the Indian team as a net bowler for the 2020-21 tour of Australia. Fate had bigger plans for him, though. Due to injuries in the squad, he was drafted into the playing XI, making his international debut in all three formats on the same tour, a rare achievement in Indian cricket history. In the T20Is, he shone with his accurate death bowling, and in his Test debut at the Gabba, he picked up key wickets to help India secure a historic series win. In the following years, Natarajan struggled with injuries, missing several crucial matches. Despite this, he made strong comebacks and continued to impress in domestic cricket and the Indian Premier League. In 2024, SRH retained him for ₹4 crore, but in the 2025 Indian Premier League auction, Delhi Capitals acquired him for a staggering ₹10.75 crore, proving that his value as a left-arm pacer remains high. Beyond cricket, Natarajan has used his success to give back to his community. He has set up a cricket academy in his village, providing free training to young aspiring cricketers. He remains a true inspiration for aspiring cricketers across the country.",
  "nationality": "India",
  "career_span": {
    "Test": "2021",
    "ODI": "2020-2021",
    "IPL": "2017-2025"
  }
}