{
  "id": "pprofile_66046",
  "type": "player_bio",
  "player": "Finn Allen",
  "full_name": "Finnley Hugh Allen",
  "dob": "April 22, 1999",
  "role": "Batsman",
  "batting_style": "Right Handed",
  "bowling_style": "-",
  "teams": [
    "New Zealand",
    "Auckland Aces",
    "Lancashire",
    "Wellington Firebirds",
    "Yorkshire",
    "Royal Challengers Bengaluru",
    "New Zealand Under-19",
    "Perth Scorchers",
    "New Zealand XI",
    "Quetta Gladiators",
    "Northern Warriors",
    "Birmingham Phoenix",
    "Southern Brave",
    "San Francisco Unicorns"
  ],
  "bio": "New Zealand have produced one of the most destructive openers in Brendon McCullum who terrorised the bowlers throughout his career. Talking about explosive Kiwi openers, Finnley Hugh Allen is another one that comes to mind. Born in Auckland in 1999, he is a right-handed batter who is also known for his explosive style. Finn Allen first played for New Zealand's Under-19 team in the 2016 World Cup, and again in 2018. While he was young in 2016, the 2018 World Cup was a key moment in his career. He scored the first century of the tournament against the West Indies on the opening day. He finished as New Zealand’s top run-scorer with 338 runs in that tournament. Although he kept performing well in domestic cricket, Allen didn't get a call-up to the senior national team. In 2020, he was offered a contract by Wellington for the domestic season. He made the most of this chance, helping Wellington win the Super Smash title while becoming the top run-scorer of the tournament with 512 runs. His strong performances in domestic cricket led to his first call-up to the senior national team for a T20 series against Bangladesh in March 2021. Allen impressed by scoring 71 runs from just 29 balls in his third T20I. Although he performed well, he missed out on a spot in New Zealand's squad for the 2021 T20 World Cup in the UAE. After his success in domestic cricket, Allen was selected by Bengaluru for the 2021 IPL season, but he didn’t get much playing time. In the 2022 ICC T20 World Cup in Australia, he played a key role in helping New Zealand secure a dominant win against Australia in the opening match. While Allen became a regular player in New Zealand's T20I team, he struggled in One-Day Internationals. His biggest achievement came on January 17, 2024, when he scored 137 runs off 62 balls against Pakistan in a T20I match. He hit 16 sixes, breaking the record for the most sixes by a Kiwi in a T20I innings. Allen has played for various cricket teams worldwide and joined the Perth Scorchers for the 2024-25 Big Bash League season in Australia. Additionally, he returned to play for Auckland in domestic cricket. However, unfortunately, he could not get any team in the Indian Premier League auction for the 2025 season. Allen has been in and out of the national team, but he is working hard at the domestic level to be more consistent, and with age on his side, he can be a future star in white-ball cricket.",
  "nationality": "New Zealand",
  "career_span": {
    "Test": "",
    "ODI": "2022-2023",
    "IPL": ""
  }
}