{
  "id": "pprofile_62325",
  "type": "player_bio",
  "player": "Michael Bracewell",
  "full_name": "Michael Gordon Bracewell",
  "dob": "February 14, 1991",
  "role": "All-Rounder",
  "batting_style": "Left Handed",
  "bowling_style": "Off break",
  "teams": [
    "New Zealand",
    "New Zealand A",
    "Wellington Firebirds",
    "Worcestershire",
    "Royal Challengers Bengaluru",
    "Otago Volts",
    "New Zealand Under-19",
    "New Zealand XI",
    "New Zealanders",
    "Multan Sultans",
    "Northern Superchargers",
    "Southern Brave",
    "MI New York",
    "Seattle Orcas"
  ],
  "bio": "Michael Bracewell, born into a cricketing legacy, hails from a family steeped in the sport. He is the nephew of former New Zealand internationals John and Brendon Bracewell, and the son of Mark Bracewell, an Otago first-class cricketer. Growing up in such a cricketing environment, it was no surprise that Michael developed a passion for the game from an early age. In 2010, he was part of the Kiwi squad for the Under-19 World Cup alongside his cousin Doug. Following that global event, Bracewell’s rise continued as he made his way into the Otago Volts where he earned his first domestic contract in 2011. After spending several years with Otago, Bracewell made the switch to Wellington ahead of the 2017/18 season. His decision was fueled by a desire to play in a more competitive environment, and it paid off as his influence on the team grew. Under the mentorship of Wellington's head coach Bruce Edgar, Bracewell's game flourished. In the 2018/19 season, he was named co-captain of the Wellington Firebirds alongside Hamish Bennett. Between 2019 and 2021, Wellington experienced incredible success in the domestic scene, with the team clinching back-to-back Dream11 Super Smash titles and also winning the prestigious Plunket Shield title. Bracewell’s all-round performances played a significant role in these triumphs, as he showcased his ability to contribute in multiple areas of the game, especially in key moments. Originally known for his batting and wicketkeeping, Bracewell felt the need to enhance his value to the team by adding another dimension to his game. This led him to develop his off-spin bowling, a decision that ultimately became a game-changer in his career. Given his stellar performances, a call-up to the national side was only a matter of time. His breakthrough moment came in 2022, when he made his debut in all three formats for New Zealand. Bracewell seemed destined for greater heights, but just as he was cementing his place in the New Zealand setup, an Achilles injury struck a cruel blow. The injury, which required surgery, ruled him out of the 2023 ODI World Cup. However, Bracewell’s resilience shone through during his recovery, and his long-awaited return to international cricket was a special occasion. In 2024, with several senior players away at the Indian Premier League, Bracewell was handed the captaincy for New Zealand’s T20I series in Pakistan. Not quite where he would have wanted to be since the injury, but Bracewell's steady contributions across formats ensured he was always in the mix. The persistence ultimately paved the way for his selection in New Zealand's squad for the 2025 Champions Trophy.",
  "nationality": "New Zealand",
  "career_span": {
    "Test": "2022-2025",
    "ODI": "2022-2025",
    "IPL": "2023-2023"
  }
}