{
  "id": "pprofile_65618",
  "type": "player_bio",
  "player": "Matthew Breetzke",
  "full_name": "Matthew Paul Breetzke",
  "dob": "November 3, 1998",
  "role": "Batsman",
  "batting_style": "Right Handed",
  "bowling_style": "-",
  "teams": [
    "South Africa",
    "Eastern Province",
    "Northamptonshire",
    "South Africa A",
    "South African Invitation XI",
    "South Africa Under-19",
    "Warriors",
    "South Africa Emerging",
    "Nelson Mandela Bay Giants",
    "Lucknow Super Giants",
    "Durban's Super Giants",
    "Cape Town Samp Army"
  ],
  "bio": "Matthew Breetzke, a promising right-handed batter from Port Elizabeth, South Africa, has been making waves in the cricketing world with his elegant stroke play and adaptability at the crease. Known for his ability to anchor innings, Breetzke has been a vital part of South Africa's cricketing setup, showcasing his talent across various formats. His journey began with a first-class debut for Eastern Province in 2017, and he quickly rose through the ranks to represent South Africa in the 2018 Under-19 Cricket World Cup. Breetzke's international debut came in a T20I against Australia in 2023, where his fearless approach earned him praise despite a challenging outing. Breetzke's prowess was on full display during the ODI Tri-Series in Pakistan in 2025, where he scored a remarkable 150 against New Zealand, followed by an 83 against Pakistan, boasting an impressive average of 116.50. His ability to perform under pressure was further highlighted in the domestic circuit, where he amassed more than 3400 runs in first-class cricket at an average of above 37, including eight centuries. In the shorter formats, Breetzke has been a consistent performer, with above 1800 runs in List A cricket and above 2600 runs in T20s, demonstrating his versatility and adaptability. His ability to switch between the top and middle order has made him a valuable asset, and his fearless approach has been lauded by team management and peers alike. Breetzke's career statistics reflect his growing influence in the game. In just his first two ODIs, he has scored 233 runs, with a century and a fifty to his name. His T20I career, though still in its infancy, shows promise with a highest score of 51 against Ireland. In domestic T20 leagues, Breetzke has been a key player, particularly in the SA20 League, where he has consistently contributed with the bat. As Matthew Breetzke continues to develop his game, the cricketing world watches with anticipation, eager to see how this young talent will shape the future of South African cricket.",
  "nationality": "South Africa",
  "career_span": {
    "Test": "2024-2025",
    "ODI": "2025-2025",
    "IPL": "2025-2025"
  }
}