{
  "id": "pprofile_64783",
  "type": "player_bio",
  "player": "Vishnu Vinod",
  "full_name": "Vishnu Vinod",
  "dob": "December 2, 1993",
  "role": "Wicket-Keeper",
  "batting_style": "Right Handed",
  "bowling_style": "-",
  "teams": [
    "India A",
    "South Zone",
    "Royal Challengers Bengaluru",
    "Punjab Kings",
    "Delhi Capitals",
    "Mumbai Indians",
    "Kerala",
    "Sunrisers Hyderabad",
    "KCA Eagles",
    "KCA Tuskers",
    "KCA Tigers",
    "Reliance 1",
    "Kerala CC",
    "Aries Kollam Sailors",
    "Thrissur Titans"
  ],
  "bio": "Vishnu Vinod was born on 2 December 1993 and is an Indian cricketer who plays for Kerala in domestic cricket. He is a right-handed wicket-keeper-batter and occasional medium pacer. Vishnu is an attacking opening batterwho can play as a finisher in the lower middle order as well. Apart from being a wicket-keeper, he is also a good outfielder and useful medium-pacer. He is also known for his six-hitting ability in the domestic arena. He made his Twenty20 debut against Karnataka in the 2014-15 Syed Mushtaq Ali Trophy season for Kerala on 3 April 2014. He made his List A debut against Hyderabad in the 2014-15 Vijay Hazare Trophy season Kerala on 10 November 2014. He made his first-class debut for Kerala in the 2016–17 Ranji Trophy on 5 November 2016. In the 2018-19 Ranji Trophy, he hit his maiden first-class century against Madhya Pradesh scoring an unbeaten 193 off 282 balls. He was the top run scorer of Kerala in 2019-20 Vijay Hazare Trophy scoring 508 runs from 8 matches with an average of 63.50 including 3 centuries. In October 2019, he was named in India A's squad for the 2019–20 Deodhar Trophy. In November 2021, he scored a 26-ball 65* including seven sixes against Tamil Nadu in the quarter-finals of the 2021-22 Syed Mushtaq Ali Trophy. However, the match ended in a losing cause. In December 2021, Vishnu scored an unbeaten 100, also forming a record-breaking seventh-wicket of 174 runs along with Sijomon Joseph, winning the match for Kerala in a match against Maharashtra in the 2021-22 Vijay Hazare Trophy. In April 2017, Vishnu was signed to play for Bangalore in the 2017 Indian Premier League as a replacement for wicket-keeper-batter KL Rahul who was ruled out of the tournament. He played 3 matches in the season scoring a total of 19 runs and wasn't retained by the team in the next season. He went unsold in the 2018, 2019, and 2020 seasons of the Indian Premier League. In February 2021, Vinod was bought by Delhi in the auction ahead of the 2021 Indian Premier League but was benched the whole season. He was released by Delhi ahead of the 2022 Indian Premier League auction. In February 2022, he was bought by Hyderabad in the auction for the 2022 Indian Premier League tournament. The following season, he was picked up by Mumbai where he spent a couple of years as a back-up keeper, but was released. Ahead of the 2025 season, he was picked up by Punjab.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "",
    "IPL": "2017-2023"
  }
}