{
  "id": "pprofile_62297",
  "type": "player_bio",
  "player": "Karun Nair",
  "full_name": "Karun Kaladharan Nair",
  "dob": "December 6, 1991",
  "role": "Batsman",
  "batting_style": "Right Handed",
  "bowling_style": "Off break",
  "teams": [
    "India",
    "India A",
    "Indian Board Presidents XI",
    "India Green",
    "India Red",
    "Northamptonshire",
    "Rest of India",
    "South Zone",
    "Royal Challengers Bengaluru",
    "Kolkata Knight Riders",
    "Punjab Kings",
    "Delhi Capitals",
    "Rajasthan Royals",
    "India Under-19",
    "Karnataka",
    "Vidarbha",
    "Mangalore United",
    "Mysore Warriors",
    "Lucknow Super Giants",
    "Canara Bank"
  ],
  "bio": "Karun Nair is a right handed opening batsman and an occasional off-break bowler. Born in Jodhpur, Rajasthan, Karun represents Karnataka in domestic cricket. He has played for Karnataka at all junior levels. He has also represented India's U-19 team touring Australia. Karun was signed by the Bangalore team for the fifth edition of the Indian Premier League in 2012 but could not play more than 2 games. He had an excellent 2013-14 Ranji season in which he scored three centuries in six matches including an innings of 151 not out in the semi-final. He was under perfect guidance of Rahul Dravid, Shane Watson and Brad Hodge as he was a part of the Rajasthan team in the 2014 season of Indian Premier League. In 2016 auction, Nair was bought by the Delhi franchise for a whopping Rs 4 crore, 40 times his base price. After delivering on a consistent basis for Karnataka and India A, Karun Nair finally got a call for the national team in 2015 when he replaced an injured Murali Vijay on the Sri Lankan tour. However, he never got a chance to break into the playing XI. Finally, in 2016 he made his Test debut against England in Mohali and made it count by scoring a mammoth triple ton in only his third Test. He also became the fastest player in history to convert his maiden Test century into a triple hundred. Despite this record-breaking feat, his international career did not take off as expected, and he was dropped from the team in the following series. In domestic cricket, Karun switched to Vidarbha and remained a consistent performer. The 2024-25 season was one of his best, where he scored 779 runs in the Vijay Hazare Trophy, including five centuries, at a staggering average of 389.50. He carried this form into the Ranji Trophy, where he played a match-winning role for Vidarbha in the final, scoring 86 and 135 in both innings against Kerala, helping his team lift their third Ranji title. Karun has also been a part of the Indian Premier League for several years, representing teams like Royal Challengers Bangalore, Rajasthan Royals, Delhi Daredevils, and Kings XI Punjab. In the 2025 Indian Premier League auction, he was bought by the Delhi Capitals for ₹50 lakh. With his vast experience and match-winning ability, he will be looking to make an impact and prove that he still has what it takes to compete at the highest level.",
  "nationality": "India",
  "career_span": {
    "Test": "2016-2025",
    "ODI": "2016",
    "IPL": "2013-2025"
  }
}