{
  "id": "pprofile_95322",
  "type": "player_bio",
  "player": "Robin Minz",
  "full_name": "Robin Minz",
  "dob": "September 13, 2002",
  "role": "Wicket Keeper",
  "batting_style": "Left Handed",
  "bowling_style": "Slow left-arm orthodox",
  "teams": [
    "Mumbai Indians",
    "Jharkhand",
    "Ranchi Raiders",
    "Gujarat Titans",
    "Jharkhand CC"
  ],
  "bio": "Robin Minz, often hailed as Jharkhand's 'next Chris Gayle' and 'next Dhoni,' is making waves in the cricketing world with his aggressive batting style and impressive wicketkeeping skills. Born on 13th September 2002, Minz has quickly become a name to watch in Indian domestic cricket. His journey began in the Gumla Premiere League, where he narrowly missed a century, scoring 96 runs, but soon made up for it with a blistering 154 off 73 balls in his next match. This performance not only helped his team secure victory but also caught the attention of selectors, leading to his promotion to Gumla Senior. Minz's prowess was further showcased in the Randhir Verma Trophy 2021-22, where he emerged as the top scorer with 70 runs, although his team fell short in the semi-finals. His consistent performances earned him a spot in the BC Mahanti Memorial T20 Invitational Cricket Tournament in 2023, where he scored an unbeaten 73 off 35 balls against Hyderabad, despite the match being abandoned due to rain. This innings, along with his overall performance, led to his selection in the IPL 2024 auction, where he was picked up by Gujarat for a whopping 3.6 crore rupees, making headlines across the nation. Unfortunately, an accident ruled him out of the entire season and Mumbai then picked him ahead of the 2025 season. Minz's batting style is characterized by his ability to clear the boundary with ease, reminiscent of the legendary Chris Gayle. His highest score in the Syed Mushtaq Ali Trophy 2024 was a quickfire 36 off 12 balls against Manipur, showcasing his ability to accelerate the innings when needed. In the Ranji Trophy 2024/25, he played two matches, scoring a total of 75 runs with a highest score of 39 against Saurashtra. Despite his young age, Minz has already shown glimpses of leadership potential, much like his idol MS Dhoni. His ability to perform under pressure and his aggressive approach to batting make him a valuable asset to any team. As he continues to develop his skills, Minz is expected to play a crucial role in Jharkhand's cricketing future and potentially make his mark on the international stage. With his eyes set on the future, Minz is determined to continue his upward trajectory and make a significant impact in Indian cricket.",
  "nationality": "India",
  "career_span": {
    "IPL": "2025"
  }
}