{
  "id": "pprofile_90572",
  "type": "player_bio",
  "player": "Gurnoor Brar",
  "full_name": "Gurnoor Singh Brar",
  "dob": "May 25, 2000",
  "role": "Bowler",
  "batting_style": "Left Handed",
  "bowling_style": "Right-arm fast",
  "teams": [
    "Punjab Kings",
    "Punjab",
    "Gujarat Titans",
    "Agri King's Knights",
    "Trident Stallions"
  ],
  "bio": "Gurnoor Singh Brar, a promising right-arm fast bowler from India, has been turning heads in the domestic cricket circuit with his impressive performances. Known for his ability to generate pace and movement, Brar has quickly become a key player for Punjab in the Ranji Trophy. His standout performance came against Bihar, where he claimed a remarkable five-wicket haul, finishing with figures of 5/14, highlighting his potential as a future star in Indian cricket. Brar's domestic career has been marked by consistent and impactful performances. In the 2024/25 Ranji Trophy season, he took 33 wickets in 12 matches at an average of 25.66, maintaining an economy rate of 3.43. His ability to adapt to varying pitch conditions and his disciplined line and length have been crucial to his success. His best bowling figures in a match, 5/14 against Bihar, showcased his knack for producing match-winning performances when his team needed him most. Before making his mark in professional cricket, Brar was one of the net bowlers for Mumbai Indians during the 2019 season. He made his List-A debut in 2022 against Goa and his first-class debut against Railways in the same year. Brar also made headlines in 2023 during a Ranji Trophy match against Jammu and Kashmir, where he scored a crucial 64, stabilizing Punjab's first innings and contributing to a 100-run partnership with Siddharth Kaul that helped them win by 4 wickets. Brar's rise continued in the IPL when he was bought by Punjab Kings for the 2023 season as a replacement for Raj Bawa, for Rs. 20 Lakhs. He made his IPL and T20 debut for Punjab Kings against Lucknow Super Giants in 2023. One of his standout performances came in the 2024 Sher-E-Punjab T20 League, where he was the top wicket-taker of the tournament, claiming 22 wickets in 11 matches. By 2025, recognizing his growth in the domestic circuit, Brar was acquired by Gujarat Titans in the IPL mega auction for a staggering INR 1.30 crores, far exceeding his base price, signaling his potential and promising future in the game.",
  "nationality": "India",
  "career_span": {
    "ODI": "2024",
    "IPL": "2023"
  }
}