{
  "id": "pprofile_63550",
  "type": "player_bio",
  "player": "Praveen Dubey",
  "full_name": "Praveen Dubey",
  "dob": "July 1, 1993",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Leg break googly",
  "teams": [
    "Royal Challengers Bengaluru",
    "Punjab Kings",
    "Delhi Capitals",
    "Karnataka",
    "Eastern Eagles",
    "Belagavi Panthers",
    "Hubli Tigers",
    "Gulbarga Mystics"
  ],
  "bio": "Praveen Dubey is a bowling all-rounder who hails from Azamgarh, Uttar Pradesh. He plays his domestic cricket for Karnataka and shot into the limelight after having an impressive outing in the Karnataka Premier League in 2015 where he represented Hubli Tigers. He showed good control with his variations and bagged seven wickets in six games at a terrific economy rate of 5.90. He was decent in the 2016 season of the league for his new franchise, Belgavi Panthers as well where he picked up nine wickets in eight matches. Also a handy batter lower down the order, Dubey is a utility player. He was picked up by Bangalore in the 2016 auction of the Indian Premier League and was retained for the following season as well but he is yet to make his debut. The good thing is that he is still young and has a long way to go. Dubey's breakthrough came when he made his Twenty20 debut for Karnataka in the 2017–18 Zonal T20 League on January 8, 2018. His impressive performances in the shortest format of the game quickly established him as a key player in Karnataka's T20 squad, where he showcased his ability to contribute with both bat and ball. In January 2020, Dubey achieved another milestone in his career when he made his first-class debut for Karnataka in the prestigious Ranji Trophy. His inclusion in the first-class arena was a testament to his consistent performances and dedication to the sport, further cementing his place in Karnataka's cricketing fraternity. Dubey's talent and potential did not go unnoticed in the Indian Premier League arena, where he was signed by Bangalore at the 2016 players auction for ₹35 lakh. His stint with Bangalore continued in the 2017 season, where he was retained by the franchise for ₹10 lakh, showcasing the trust and confidence placed in his abilities as a cricketer. In a significant development, Dubey was named as a replacement for the injured Amit Mishra in the Delhi squad for the Indian Premier League 2020. This opportunity provided Dubey with a platform to showcase his skills on the grand stage of the Indian Premier League, further enhancing his reputation as a promising talent in the world of cricket. Praveen Dubey's association with the Indian Premier League has been a defining phase in his cricketing career. His initial stint with Bangalore in the 2016 and 2017 seasons provided him with invaluable experience, allowing him to rub shoulders with some of the finest cricketers in the world and learn from seasoned professionals in the franchise setup. In a significant turn of events, Dubey was roped in by the Delhi Squad in the auction for the 2022 Indian Premier League tournament. His inclusion in the Delhi Squad marked a new chapter in his Indian Premier League journey, presenting him with an opportunity to make a mark for himself and contribute to the success of the franchise on the T20 stage. Dubey was then bought by Punjab for the 2025 season. Praveen Dubey is renowned for his dynamic style of play and all-round abilities on the cricket field. As a right-handed batter, Dubey possesses a wide array of shots and has the capability to anchor the innings or accelerate the run rate, depending on the match situation. His sound technique and ability to find the gaps make him a valuable asset in the middle order, capable of building crucial partnerships and steering the team towards victory. In addition to his batting prowess, Dubey's leg-break googly bowling adds a crucial dimension to his game. His ability to deceive batsmen with subtle variations in flight and spin makes him a potent weapon in the bowling department. Dubey's accuracy and control over his leg-spin deliveries enable him to pick up crucial wickets and apply pressure on the opposition, turning the tide of the game in his team's.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "",
    "IPL": "2020-2025"
  }
}