{
  "id": "pprofile_3632",
  "type": "player_bio",
  "player": "Dinesh Karthik",
  "full_name": "Krishnakumar Dinesh Karthik",
  "dob": "June 1, 1985",
  "role": "Wicket-Keeper",
  "batting_style": "Right Handed",
  "bowling_style": "Off break",
  "teams": [
    "India",
    "ICC World XI",
    "India A",
    "India B",
    "India Blue",
    "India Emerging",
    "Indian Inv XI",
    "India Red",
    "Rest of India",
    "South Zone",
    "Royal Challengers Bengaluru",
    "Kolkata Knight Riders",
    "Punjab Kings",
    "Delhi Capitals",
    "Mumbai Indians",
    "India Under-19",
    "Tamil Nadu",
    "Abahani Limited",
    "Gujarat Lions",
    "SKM Salem Spartans",
    "IDream Tiruppur Tamizhans",
    "Bangla Tigers",
    "India C",
    "Paarl Royals",
    "DY Patil Group B",
    "Southern Super Stars",
    "Dallas Lonestars CC"
  ],
  "bio": "As a wicket-keeper batter looking to be India’s answer to Adam Gilchrist, Dinesh Karthik had all the ingredients to be a reliable hand in both departments. With the willow, his technical nuance was evident. Proof of his underlined batting prowess is found in the fact that, even after Dhoni cementing his place as skipper-keeper, Karthik was recalled as a specialist batter alone. His batting ability stood the test of challenging pitches in England in 2007 where, as an opener, he recorded fifties in each of the three Tests to aid India in a historic series victory. Beyond 2007, Dhoni’s rapid success soon sidelined Karthik. But for his lapse in concentration, the Chennai-born keeper would have made greater waves. As time progressed, selectors looked to hone Karthik’s batting abilities alone and fit him in the interim as a specialist batter, aside from being Dhoni’s stand-in behind the sticks. Still, his role was limited to playing second fiddle and continuous stop-starts stunted his progress on a personal front, while, along with Parthiv Patel, he became proof of India’s embarrassment of riches in talent behind the stumps. Karthik was picked up by Mumbai for the 5th edition of the Indian Premier league as a specialist wicket-keeper but sent shock-waves in the cricketing world when he was grabbed for a whopping 12.5 crores by the Delhi franchise for the 7th edition of the Indian Premier League. In-and-out of the national team didn't affect his performance in the domestic circuit where he continued to pile on the runs. After Delhi, Bengaluru bought him for a huge sum in 2015, followed by the Gujarat franchise. With plenty of experience behind, DK landed the captaincy of Kolkata in 2018 and he took his team almost to the glory, only to get knocked out in Qualifier 2. It turned out to be a fruitful 2018 for Karthik as he once again got the opportunity to represent India when the selectors decided to rest Dhoni for the Nidahas Trophy. His 8-ball 29 which included a last-ball six in the final led India to the T20 tri-series win and DK staked his claim for the role of a finisher in the team. Considering his experience and composure in pressure situations, Karthik was selected ahead of Rishabh Pant for the second-choice wicket-keeper in India's World Cup squad for 2019. In the twilight of his career, Dinesh Karthik re-invented his style of batting and became one of the ferocious strikers of a cricket ball, earning him the tag of a 'new finisher'. DK successfully showcased his talent during the 2022 Indian Premier League, playing for his new team Bengaluru. With 330 runs from 16 matches at an impressive average of 55.00 and a strike rate of 183.33, Karthik grabbed the attention of the Indian selectors, earning himself a spot in the squad for the T20 World Cup that year. Karthik had a quiet IPL 2023 but was retained by Bengaluru for the 2024 season, where he impressed with vital cameos in their playoff run. Though a T20 World Cup return didn’t materialize, he retired at the end of the season. In 2025, he returned to action with Paarl Royals, becoming the first Indian to play in the SA20 League. Later that year, he transitioned into a mentor and batting coach role with Bengaluru for the 2025 IPL season. Beyond his contributions on the cricket field, Karthik has also made a name for himself in the broadcasting arena. His keen analytical skills have established him as one of the most sought-after names in the commentary field.",
  "nationality": "India",
  "career_span": {
    "Test": "2004-2018",
    "ODI": "2004-2019",
    "IPL": "2008-2024"
  }
}