{
  "id": "pprofile_63187",
  "type": "player_bio",
  "player": "Kuldeep Yadav",
  "full_name": "Kuldeep Yadav",
  "dob": "December 14, 1994",
  "role": "Bowler",
  "batting_style": "Left Handed",
  "bowling_style": "Left-arm wrist spin",
  "teams": [
    "India",
    "Asia XI",
    "Central Zone",
    "India A",
    "India Red",
    "Rest of India",
    "Kolkata Knight Riders",
    "Delhi Capitals",
    "Mumbai Indians",
    "India Under-19",
    "Uttar Pradesh",
    "Indians",
    "Team A"
  ],
  "bio": "Kuldeep Yadav, a left-arm chinaman bowler, is a rare and highly skilled talent in world cricket. Known for his lethal googly and impressive variations, Kuldeep’s rise to prominence has been a story of perseverance, passion, and immense hard work. Initially, Kuldeep aspired to be a fast bowler, but his coach, Kapil Pandey, recognising his small build, advised him to switch to left-arm wrist spin. After giving it a try, Kuldeep immediately felt a connection with the craft, which set him on his path to becoming one of the most prominent chinaman bowlers in the world. During his early years, Kuldeep faced challenges in finding the right resources, but his dedication never wavered. He began watching videos of Shane Warne, whose wrist spin style inspired him greatly. At just 17 years old, Kuldeep made his debut for India’s U-19 team in 2012, but it was his exceptional performance in the 2014 U-19 World Cup that truly put him on the map. He made history by becoming the first Indian bowler to take a hat-trick in the tournament and finished as the highest wicket-taker for India with 14 scalps, catching the attention of the selectors. This led to his first IPL contract, and he soon began making waves in domestic cricket as well, with standout performances in the Duleep Trophy in 2017. Kuldeep’s breakthrough at the international level came during India’s home Test series against Australia in 2017 when he was handed his Test cap by Anil Kumble. In his debut match, Kuldeep took four wickets in the first innings, outfoxing Australia’s batters with his spin. His limited opportunities didn’t stop him from showcasing his talent, and he soon made his ODI debut against the West Indies, though rain interrupted his debut performance. Later that same tour, Kuldeep made his T20I debut, and his rise continued as he took a hat-trick against Australia in an ODI match. Kuldeep’s remarkable consistency continued in 2019 when he took a five-wicket haul in Australia during his first Test on Australian soil and later took a hat-trick against the West Indies, becoming the first Indian bowler to take two hat-tricks in ODIs. His partnership with Yuzvendra Chahal, known as 'Kul-Cha,' was instrumental in India’s dominance in limited-overs cricket, as the duo wreaked havoc on opposition batting orders. Despite his success, Kuldeep faced a dip in form over the next few years, with limited opportunities both in the IPL and for India. But his resilience saw him working harder, adjusting his bowling speed, and introducing new variations to regain his place. He made a spectacular comeback in 2022 during a Test series against Bangladesh, where he picked up a five-wicket haul and played a key role in India’s victory. Kuldeep’s IPL journey has been equally dynamic. He was first added to the Mumbai squad in 2012 but didn't get any opportunities to play. In 2014, he joined Kolkata but still couldn't make his IPL debut. By 2017, he was playing regularly for Kolkata, where his partnership with Sunil Narine created a formidable spin attack. He continued to perform consistently, taking 17 wickets in 16 games in the 2018 season. But his form dipped in the following years, and he lost his place in the Kolkata team. He was picked by Delhi for the 2022 IPL season where he enjoyed a breakout year, picking up 21 wickets in 14 matches. This impressive showing led to Delhi retaining him for the 2023 season, but he had a quiet tournament by his standards and could not replicate his heroics from the previous edition. Kuldeep formed a lethal pairing with Ravindra Jadeja at the 2023 ODI World Cup, with the spin twins dominating the middle overs in India's journey to the final. Though the title eluded India that year, redemption came in 2024 as they finally got their hands on the trophy. Kuldeep played a pivotal role in the triumph, finishing as the highest wicket-taker among India's spinners. And there was no way Delhi were going to let go of a player of Kuldeep's calibre, especially considering the rarity of a left-arm wrist spinner. Unsurprisingly, they retained him for the 2025 season.",
  "nationality": "India",
  "career_span": {
    "Test": "2017-2024",
    "ODI": "2017-2025",
    "IPL": "2016-2025"
  }
}