{
  "id": "pprofile_61738",
  "type": "player_bio",
  "player": "Vijay Shankar",
  "full_name": "Vijay Shankar",
  "dob": "January 26, 1991",
  "role": "All Rounder",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm medium",
  "teams": [
    "India",
    "India A",
    "India B",
    "India Blue",
    "Rest of India",
    "South Zone",
    "Chennai Super Kings",
    "Delhi Capitals",
    "Tamil Nadu",
    "Sunrisers Hyderabad",
    "SKM Salem Spartans",
    "Chepauk Super Gillies",
    "Lyca Kovai Kings",
    "IDream Tiruppur Tamizhans",
    "India C",
    "Gujarat Titans",
    "Vijay CC"
  ],
  "bio": "Bhuvneshwar Kumar got injured in between the big match against Pakistan in the 2019 ICC World Cup - The bowler, who was brought on to complete Kumar's over, struck on the very first ball to remove Imam-ul-Haq and became only the third bowler after Malachi Jones of Bermuda and Ian Harvey of Australia to achieve this feat in an ODI World Cup - That's the best way to introduce Vijay Shankar. Born in the Tirunelveli district of Tamil Nadu, Vijay Shankar made his first appearance for his state team in the 2012 Ranji Trophy. A half-century and two wickets in his debut match were enough to show the glimpse of his all-round talent. The 2014-15 edition though should be considered as the breakthrough season for him. He finished with 500-plus runs at an average of 57.7 and was soon included in India A squad to play Australia. Primarily a batter who can bowl useful seam-up deliveries, Shankar was first selected in the Test squad in 2017 to replace Bhuvneshwar Kumar but he didn't get the chance to make his debut. A few months later though, he was picked in the T20I squad for the Nidahas Trophy and won the Man of the Match award in his second match. After Hardik Pandya's ban for controversial remarks in a television show, Vijay Shankar was named as the replacement for the remaining two ODIs of the Australian tour and the whole of the New Zealand series to follow in early 2019. Shankar's knock of 45 under pressure and in tough conditions in Wellington proved his talent as a batsman and a few more useful innings post that were enough to earn him the ticket for the 2019 Cricket World Cup. Shankar caused a stir in the media when he was selected for the national team for the 2019 Cricket World Cup in April 2019. In the match against Pakistan, he became the world’s third and first Indian player to take a wicket with the opening delivery of the World Cup. But the inevitable happened as he met with an injury, Shankar was unable to participate in India's final two matches. Despite limited opportunities, he showed glimpses of his ability, including a crucial 41 against Australia. For the 2019 season, he was traded back to Hyderabad for season 2019. The International Cricket Council (ICC) selected him as one of eight players to watch in March 2019 in advance of the 2019 Indian T20 League competition. In February 2022, Gujarat purchased him in the auction for INR 1.4 Cr and each season till 2022 for the same price. In that season he got a very limited chance. But he turned critics upside down in the season of 2023. He had the highest of 63 runs not out and parallelly scored three half-centuries in that season. To date, Vijay scored more than 1000 runs and also slammed 6 half-centuries. After remaining on the periphery of international cricket for an extended period, Vijay Shankar has continued to showcase his abilities in domestic tournaments across India. Following a three-year association with Gujarat Titans, he found himself back in the auction pool ahead of the IPL 2025 mega auction. Though his former franchise attempted to reacquire his services, it was Chennai Super Kings who ultimately secured the all-rounder for INR 1.20 crores. This move to CSK represents Shankar's fourth IPL team since beginning his tournament journey in 2017, adding another chapter to his wandering IPL career.",
  "nationality": "India",
  "career_span": {
    "Test": "2023",
    "ODI": "2019",
    "IPL": "2014-2025"
  }
}