{
  "id": "pprofile_65034",
  "type": "player_bio",
  "player": "Kamindu Mendis",
  "full_name": "Pasqual Handi Kamindu Dilanka Mendis",
  "dob": "September 30, 1998",
  "role": "All-Rounder",
  "batting_style": "Left Handed",
  "bowling_style": "Slow left-arm orthodox",
  "teams": [
    "Sri Lanka",
    "Sri Lankan Board XI",
    "Colombo Cricket Club",
    "Chilaw Marians Cricket Club",
    "Galle Cricket Club",
    "Sri Lanka Emerging",
    "Sri Lanka A",
    "Tamil Union Cricket and Athletic Club",
    "Sri Lanka Under-19",
    "Sylhet Strikers",
    "Sunrisers Hyderabad",
    "Sri Lanka Cricket Board President XI",
    "Sri Lanka Under-23",
    "Mohammedan Sporting Club",
    "Colombo",
    "Kandy",
    "Dambulla",
    "Kandy Falcons",
    "SLC Greens",
    "SLC Reds",
    "MI Emirates",
    "Kathmandu Knights",
    "Colombo Jaguars"
  ],
  "bio": "Kamindu Mendis, born on September 30, 1998, in Galle, Sri Lanka, began his cricketing journey at an early age at Richmond College. Known for his rare ability to bowl with both arms, Mendis quickly caught the eye of selectors, not only for his unique bowling skills but also for his stylish batting, setting the stage for a promising career. He made his List A debut on November 30, 2015, and continued to impress in domestic cricket, gaining selection for prestigious tournaments such as the Under-19 Cricket World Cups in 2016 and 2018. As captain of the Sri Lankan Under-19 team in both tournaments, Mendis demonstrated his leadership abilities. His consistent domestic performances led to appearances in Sri Lanka's Super Provincial tournaments and the Lanka Premier League, elevating his profile in the cricketing world. Mendis made his T20I debut for Sri Lanka on October 27, 2018, against England, followed by his ODI debut on March 10, 2019, against South Africa. His versatility was further showcased when he was appointed vice-captain for Sri Lanka's campaigns in the ACC Emerging Teams Asia Cup and the South Asian Games, where Sri Lanka secured a silver medal. His remarkable Test debut came on July 8, 2022, against Australia, where Mendis scored a maiden fifty and formed a crucial partnership with Dinesh Chandimal, helping Sri Lanka achieve an innings victory.",
  "nationality": "Sri Lanka",
  "career_span": {
    "Test": "2022-2025",
    "ODI": "2019-2025",
    "IPL": "2025-2025"
  }
}