{
  "id": "pprofile_66927",
  "type": "player_bio",
  "player": "Will Jacks",
  "full_name": "William George Jacks",
  "dob": "November 21, 1998",
  "role": "All-Rounder",
  "batting_style": "Right Handed",
  "bowling_style": "Off break",
  "teams": [
    "England",
    "Surrey",
    "Royal Challengers Bengaluru",
    "Mumbai Indians",
    "England Under-19",
    "Hobart Hurricanes",
    "Chattogram Challengers",
    "England Lions",
    "Comilla Victorians",
    "Islamabad United",
    "Quetta Gladiators",
    "Bangla Tigers",
    "England Cricket Board XI",
    "Delhi Bulls",
    "Oval Invincibles",
    "New York Strikers",
    "Morrisville Samp Army",
    "Pretoria Capitals",
    "MI Emirates"
  ],
  "bio": "Will Jacks, a hard-hitting all-rounder, discovered his passion for cricket at a young age and embarked on his journey with Surrey. Progressing through the ranks from the under-9s to the England Under-19 squad, Jacks quickly gained recognition for his spin bowling prowess and powerful hitting. His talent shone brightly during a U-19 red-ball fixture against India in 2017, where he scored a splendid century, earning him a spot in the England squad for the 2018 U-19 World Cup. Despite showcasing his potential with a majestic 102 against Canada, Jacks' performance in the tournament was inconsistent. Making his List-A debut for Surrey in the 2018 Royal London ODI Cup, Jacks left a significant impact by scoring a vital 121 against a strong Gloucestershire in just his third List-A game. Within a short span of time, Jacks also made his T20 and first-class debuts for Surrey. His maiden first-class season was memorable as Surrey went on to clinch the County Championship Division One title. Jacks grabbed headlines during a T10 encounter against Lancashire in 2019, where he smashed a remarkable century off just 25 balls. Continuing to showcase his talent, Jacks was selected by the Oval Invincibles for the inaugural season of The Hundred in 2021. He further solidified his reputation as a top performer in T20 cricket during the 2021 and 2022 T20 Blast seasons, finishing as the club’s leading run-getter. The year 2022 proved to be a breakthrough for Jacks as he made his T20I debut for England against Pakistan in September. Fate intervened again when a last-minute flu withdrawal by Ben Foakes paved the way for Jacks to make his Test debut in Rawalpindi, where he played a pivotal role in England's victory with a six-wicket haul. Jacks finally made his ODI debut in 2023 against Bangladesh in Dhaka. However, his momentum was halted when he sustained a muscle injury during the second game of the series, causing him to miss out on the opportunity to play for Bengaluru in what would have been his first Indian Premier League season. Despite the setback, Jacks bounced back strongly with centuries in the 2024 editions of the SA20 League and the Bangladesh Premier League. Jacks also made his mark in the 2024 Indian Premier League playing for Bengaluru, scoring 230 runs in 8 games including a smashing ton against Gujarat. He picked up form just at the right time as he was then named in the England squad for the 2024 T20 World Cup. Surprisingly, Bengaluru opted against retaining him, and he was picked up by Mumbai for the 2025 Indian Premier League season.",
  "nationality": "England",
  "career_span": {
    "Test": "2022-2022",
    "ODI": "2023-2025",
    "IPL": "2024-2025"
  }
}