{
  "id": "pprofile_66438",
  "type": "player_bio",
  "player": "Sai Kishore",
  "full_name": "Ravisrinivasan Sai Kishore",
  "dob": "November 6, 1996",
  "role": "Bowler",
  "batting_style": "Left Handed",
  "bowling_style": "Slow left-arm orthodox",
  "teams": [
    "India",
    "India A",
    "India B",
    "Leicestershire",
    "Rest of India",
    "South Zone",
    "Chennai Super Kings",
    "Tamil Nadu",
    "SKM Salem Spartans",
    "Chepauk Super Gillies",
    "Trichy Grand Cholas",
    "IDream Tiruppur Tamizhans",
    "Gujarat Titans",
    "Vijay CC",
    "Team B"
  ],
  "bio": "Sai Kishore, born 6th November 1996, is a left-arm orthodox bowler who has carved his path through domestic cricket with his wicket-taking abilities and economical spells. He had a slow start in domestic cricket, but no wonder he knew what his life was waiting for. Kishore made the List A debut for Tamil Nadu in the 2016-17 Vijay Hazare Trophy in March 2017 and bagged two wickets for the team. A well-publicized on-field incident in 2016 became a turning point, pushing him to refine his skills and emerge as a top bowler in the subsequent TNPL season. A couple of months later, in October, he made his first-class cricket debut for Tamil Nadu, and in January 2018 he made his Twenty20 debut for Tamil Nadu in the 2017-18 Zonal T20 League for his state. Kishore's talent shone brightly in the 2018-19 Ranji Trophy, leading the Tamil Nadu bowling attack in wicket count, with 22 dismissals in six matches. His ability to restrict runs with a tight economy, particularly in the Powerplay overs, became a hallmark of his bowling. This prowess was further evident in the Syed Mushtaq Ali Trophy 2019, where he picked up a significant number of wickets in the initial overs. Sai’s consistent performances in domestic tournaments caught the eye of the selectors of Chennai who drafted him in the 2020 Indian Premier League auction for INR 20 Lakhs. They retained him for one season but released him after that season. In 2021 he was called out as one of five net bowlers but debuted to positive case for COVID-19 he was added to the main squad but wasn’t capped though. In 2022 Gujarat invested a thick bundle to pick Sai into the square at a price of INR 3 crore in the auction and retained him till season 2024. In the year 2023, he also made an international debut for the nation, India, and marked his international debut against Nepal in the 2023 Asian Games and also helped the team pick a wicket. Sai Kishore's domestic performances have been equally noteworthy, particularly with the Gujarat Titans, who have shown great faith in him. The franchise used their Right to Match (RTM) card to retain him for the 2025 IPL season, successfully securing him for INR 2 crores after a fierce bidding war involving Sunrisers Hyderabad and Punjab Kings.",
  "nationality": "India",
  "career_span": {
    "ODI": "2022",
    "IPL": "2022-2025"
  }
}