{
  "id": "pprofile_58913",
  "type": "player_bio",
  "player": "Adam Zampa",
  "full_name": "Adam Palmer Zampa",
  "dob": "March 31, 1992",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Leg break googly",
  "teams": [
    "Australia",
    "South Australia",
    "Australia A",
    "Essex",
    "Surrey",
    "Royal Challengers Bengaluru",
    "Rajasthan Royals",
    "New South Wales",
    "Australia Under-19",
    "Australian XI",
    "Adelaide Strikers",
    "Melbourne Renegades",
    "Melbourne Stars",
    "Sydney Thunder",
    "Sunrisers Hyderabad",
    "Guyana Amazon Warriors",
    "Jamaica Tallawahs",
    "Rising Pune Supergiant",
    "Birmingham Phoenix",
    "Oval Invincibles",
    "Welsh Fire",
    "Abu Dhabi Knight Riders",
    "Dubai Capitals",
    "Sharjah Warriorz",
    "Los Angeles Knight Riders"
  ],
  "bio": "As soon as you see him bowl, he reminds you of a certain Shane Warne - with the same boyish looks, the courage to toss the ball up fearlessly, and the sharp spin that can deceive any batter. Adam Zampa has carried the legacy of his idol, establishing himself as Australia’s premier leg-spinner in the shorter formats. Born in South Australia, Zampa initially began his cricketing journey as a medium pacer. However, due to Cricket Australia’s restrictions on the number of pacers in junior teams, he switched to leg-spin, inspired by Warne. His transformation proved successful as he was selected in Australia’s U-19 squad for the 2010 U-19 World Cup, which the team went on to win. His performances earned him a rookie contract with New South Wales in 2010, marking the beginning of his domestic career. He made his first-class debut against Queensland in the 2012-13 Sheffield Shield, but in search of better opportunities, he moved to South Australia in 2013, where he was mentored by Johan Botha. This move proved to be a turning point as he developed consistency, and his performances in the 2015-16 season earned him a long-awaited call-up to the national team. Zampa made his ODI debut in February 2016, followed closely by his T20I debut against South Africa. His ability to control the middle overs with clever variations made him a crucial part of Australia’s white-ball plans. He was included in Australia’s squad for the 2016 T20 World Cup, but the tournament did not go as planned for him. However, he made a mark in franchise cricket. Playing for Pune in the IPL, Zampa delivered a sensational spell of 6/19, becoming only the second bowler in IPL history to take a six-wicket haul. His performances in the 2016 Caribbean Premier League further solidified his reputation, finishing as the most successful spinner with 15 wickets. Despite his success in limited-overs formats, Zampa struggled to break into Australia’s Test squad due to the presence of established spinners. In the 2019 ICC Cricket World Cup, he was part of the squad but did not feature regularly. However, his breakthrough moment came during the 2021 ICC T20 World Cup, where he played a crucial role in Australia’s title-winning campaign. On November 4, 2021, he picked up his first T20I five-wicket haul (5/19) against Bangladesh. His dominance continued in ODIs, reaching the 100-wicket milestone in March 2022 during a series against Pakistan. Later that year, in September 2022, he achieved his first ODI five-wicket haul against New Zealand in Cairns. Zampa’s biggest moment came during the 2023 ICC Cricket World Cup, where he played a key role in Australia’s title-winning run. He finished as the second-highest wicket-taker of the tournament with 23 wickets in 11 matches, setting the record for most wickets ever taken by an Australian spinner at a World Cup. He also equaled Muttiah Muralitharan’s record for the most wickets taken by a spinner in a single World Cup edition, cementing his place among the best in the format. In May 2024, Zampa was named in Australia’s squad for the ICC T20 World Cup. On June 11, 2024, he made history by becoming the first Australian bowler to take 100 wickets in T20 internationals, a testament to his longevity and impact in the shortest format of the game. Despite facing ups and downs, Adam Zampa has emerged as Australia’s most reliable limited-overs spinner. While he is yet to make his Test debut, his contributions in ODIs and T20Is have already secured his legacy as one of Australia’s greatest white-ball spinners.",
  "nationality": "Australia",
  "career_span": {
    "Test": "",
    "ODI": "2016-2025",
    "IPL": "2016-2025"
  }
}