{
  "id": "pprofile_64254",
  "type": "player_bio",
  "player": "Jofra Archer",
  "full_name": "Jofra Chioke Archer",
  "dob": "April 1, 1995",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm fast",
  "teams": [
    "England",
    "England XI",
    "Rajasthan Royals",
    "Mumbai Indians",
    "West Indies Under-19",
    "Sussex",
    "Hobart Hurricanes",
    "England Lions",
    "Quetta Gladiators",
    "Khulna Tigers",
    "Sindhis",
    "Southern Brave",
    "Team Buttler",
    "MI Cape Town"
  ],
  "bio": "A fiery pace bowler who can instill fear in the minds of the best batters around the world, Jofra Archer is an English player who was born in Barbados, West Indies. Already a World Cup winner with England in 2019, Archer's talent was spotted by fellow Barbados native Chris Jordan, who recommended him to county side Sussex. Archer impressed immediately, and it was not long before he made his mark all around the globe. Archer started his cricketing career in the West Indies, the place of his birth, and he was already a talented bowler back then. He represented the West Indies U19 in 2014, but relentless back injuries hampered his progress. Jofra's father, Frank Archer, is English, and it was through him that Jofra held British citizenship. Archer moved to England in 2015, and in July 2016 he made his first-class debut for Sussex during Pakistan's tour of England. That was followed by his T20 debut and List A debut in the same month, against Hampshire and Gloucestershire, respectively. His natural talent and raw pace were menacing for the opposition, and he quickly started to move up the ranks. In order to get a better experience, Archer went on to play for Hobart Hurricanes in the Big Bash League and for Rajasthan in the Indian Premier League. It was here that he burst onto the scene globally. In his debut Indian Premier League match against Mumbai, Archer took 3 wickets and was named the Player of the Match. He also won the Most Valuable Player award despite his team finishing at the bottom of the table. Archer had always aired his ambition of playing for England on the international stage. This was a huge stumbling block as he came to England and had to reside in the country for at least 7 years, i.e., until 2022, before he could represent the nation. However, a change in the rules just before the 2019 ICC World Cup meant that the 7-year period was cut short to 3 years, and Archer was eligible to represent his adopted nation. Archer finally made his international debut in an ODI against Ireland in May 2019, just before the ICC World Cup. Two days later, he made his T20I debut as well, playing against Pakistan. Archer shone at the grandest stage of them all, in the 2019 ICC World Cup, as England lifted the coveted trophy for the first time in their history. In the final of the tournament against New Zealand, the match was tied, and it resulted in a Super Over. The Barbados-born youngster was selected by England to bowl the most important over in England's cricket history, and he just about came up trumps, as he held his nerve in the end with the scores tied in the Super Over as well. England was crowned champions, however controversially. He followed up his impressive performances in the World Cup by making his Test debut in the 2nd Test match of the Ashes against mighty Australia. His menacing pace bowling had the Australian batters all over the place. One of his bouncers hit Australian talisman Steven Smith on the helmet, and he was taken off injured amid fears that he suffered from a concussion. The battle between Archer and Smith was a sight to behold with both players at the peak of their powers. Archer registered his first five-wicket haul in Tests, finishing with figures of 6 for 45. Eventually, it was Smith and Australia who had the last laugh as the series was drawn 2-2 and Australia retained the urn. Following the conclusion of the Ashes, Archer was handed his first central contract by the ECB. During the Ashes, though, Archer bowled long spells, and that had an adverse effect on him. Injuries have held Archer back, and it has been a stop-start career for him. In 2021, he underwent two operations for his injured elbow, which kept him out of the game for over a year. Archer was bought by Mumbai for a high price tag for the 2022 Indian Premier League, but he suffered a stress fracture that ruled him out of the tournament and also the English summer. Archer returned to international cricket in 2023 and picked up his then-best ODI figures of 6-40 in a match against South Africa. Archer was in line to play in the Ashes again, but another stress fracture meant he was sidelined. The ECB took a risk by naming him in the 2024 T20 World Cup squad, but it was worth it as Archer recovered from his elbow injury. Unfortunately, England was knocked out in the semi-finals by the eventual winner, India. Archer's fitness remains a concern, but that did not stop Rajasthan from paying INR 12.50 crores to buy his services for the 2025 Indian Premier League season.",
  "nationality": "England",
  "career_span": {
    "Test": "2019-2025",
    "ODI": "2019-2025",
    "IPL": "2018-2025"
  }
}