{
  "id": "pprofile_70500",
  "type": "player_bio",
  "player": "Harpreet Brar",
  "full_name": "Harpreet Brar",
  "dob": "September 16, 1995",
  "role": "Bowler",
  "batting_style": "Left Handed",
  "bowling_style": "Slow left-arm orthodox",
  "teams": [
    "Punjab Kings",
    "Punjab",
    "India Under-23",
    "BLV Blasters",
    "Royal Phantoms"
  ],
  "bio": "Harpreet Brar is a 6 feet 2 inches left-arm orthodox bowler who only plays limited-overs cricket and can be more than handy with the bat. Born on 16th September 1995 in Meerut in Uttar Pradesh, his family relocated to Hariewala, a small village in Punjab, when he was young and then to Zirakpur in Mohali District. He started playing for the Ropar side in the Punjab inter-district tournaments in 2011 and performed consistently claiming loads of wickets, which paved his way into the Punjab U16 setup. He rose through the ranks representing his state at the U19 and U22 levels and he was scouted for several years by the Punjab franchise that played in the Indian Premier League. He was handed his first contract for the 2019 Indian Premier League after he was picked up at base price in the auction by his home franchise. He made his T20 debut against the Delhi franchise in the competition and proved to be quite expensive with the ball but played a handy knock with the bat. He played just one more game in the 2019 edition but later that year he made his List A debut for India U23 against Bangladesh U23 at home. He played just one game in the 2020 Indian Premier League but it was his performance in the 2021 edition earned him praise from fans and pundits alike, and he was widely recognized as one of the breakout players of the season. He picked up his maiden Indian Premier League wicket against Bangalore and ended up with the three crucial wickets of Virat Kohli, Glenn Maxwell, and AB de Villiers. This performance prompted a bidding war for him the following year and he was bought once again by the Punjab franchise for 3.8 crores. His ability to turn the ball and get vital wickets along with his ability to score quick runs and provide valuable support to the top order has made him a crucial part of the squad. He was mostly used on a rotational basis, especially when they played on pitches offering turns, until the 2023 season when he became a regular member of the team playing 13 games and picking up 9 wickets with a good economy rate. After that, he also performed well in the Syed Mushtaq Ali Trophy 2023, where he registered 15 scalps in 10 matches for Punjab, helping them secure the title as well. Brar has been with Punjab for a long time and was once again picked up by them for the 2025 IPL season. There is a lot of competition for left-arm spinners in the national side but Brar will hope to put his name into the hat as well.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "",
    "IPL": "2019-2025"
  }
}