{
  "id": "pprofile_5313",
  "type": "player_bio",
  "player": "David Miller",
  "full_name": "David Andrew Miller",
  "dob": "June 10, 1989",
  "role": "Batsman",
  "batting_style": "Left Handed",
  "bowling_style": "Off break",
  "teams": [
    "South Africa",
    "Dolphins",
    "Durham",
    "Glamorgan",
    "KwaZulu Natal",
    "South Africa A",
    "Yorkshire",
    "Punjab Kings",
    "Rajasthan Royals",
    "Hobart Hurricanes",
    "Chattogram Challengers",
    "Uthura Rudras",
    "Knights",
    "Barbados Royals",
    "Saint Lucia Kings",
    "Jamaica Tallawahs",
    "Peshawar Zalmi",
    "Bloem City Blazers",
    "World XI",
    "Bangla Tigers",
    "Multan Sultans",
    "Winnipeg Hawks",
    "Durban Heat",
    "Northern Superchargers",
    "Welsh Fire",
    "Quinny’s Kites",
    "Dambulla Sixers",
    "Jaffna Kings",
    "Fortune Barishal",
    "Lucknow Super Giants",
    "Gujarat Titans",
    "Morrisville Samp Army",
    "Paarl Royals",
    "Los Angeles Knight Riders",
    "Texas Super Kings"
  ],
  "bio": "Young David Miller's quick-fire batting displays for his domestic side Dolphins and subsequently for South Africa A on their tour of Bangladesh prompted selector Andrew Hudson to include him in the Proteas' tour of West Indies as injured Wayne Parnell's replacement in 2010. Known as a T20 specialist, Miller enjoys playing a wide array of strokes on the front as well as the back foot. In his debut T20I match, Miller top scored with 33 in a game that South Africa won by a single run. It prompted his inclusion in ODIs and subsequently, he made his ODI debut against the West Indies. In his first two outings, some impressive slogging helped South Africa set difficult totals which they eventually went on to win. Miller was then named in South Africa's preliminary 2011 ICC Cricket World Cup squad but did not feature in the final 15 to make it to the tournament. After a hiatus of more than a year, Miller was back into the ODI team on the back of his improved ball striking and his ability to handle pressure-cooker situations. This ability was on display when Miller played some breathtaking knocks in the Indian Premier League for the Punjab franchise. His finishing in the league games was of the highest quality which emphasized his destructive prowess. One such innings saw him take the bowling attack to the cleaners giving his team an unlikely victory, one that would redefine ultimate slog-over hitting by the phrase, \"If it's in the V, it's in the tree, if it's in the arc, it's out of the park.\" During Bangladesh's tour of South Africa in 2017/18, Miller cracked the fastest T20I century off just 35 balls and also became the first batsman to hit a century while batting at number five. Also he achieved the distinction of being one of the few players to feature in 100 ODIs without playing a single Test match. Apart from his outing in the Indian Premier league, he has had stints in T20 competitions of Bangladesh, Sri Lanka and England. Punjab restored faith in Miller when he was one of the two players they retained ahead of the 2014 auction. He was also handed the captaincy of Punjab in 2016 but after a troubled start for them, he was replaced by Murali Vijay. Miller was released ahead of the auction for the 13th edition and Rajasthan bought him for INR 75 lakhs. David Miller faced a challenging period in his career, but he persevered by consistently participating in domestic cricket to regain his form. His efforts paid off during the 2019 ODI World Cup, where he surpassed the 3,000-run mark in ODIs. However, it was during the subsequent ICC tournaments in 2021 and 2022 that his career truly took off. In the 2023 ODI World Cup, Miller excelled, amassing 356 runs at an impressive average of 45, including a vital century against Australia in the semi-final, although his team ultimately lost. Simultaneously, Miller thrived in the franchise circuit, transitioning from Punjab to Rajasthan before finding a home with Gujarat. In 2022, he scored 481 runs at an outstanding average of over 68, playing a crucial role in helping the franchise secure its first title in its inaugural season. He maintained his performance into the following year, while his average dipped, he continued to contribute significantly. Given his strong domestic and franchise performances, it was no surprise that he earned a direct spot on the T20 World Cup 2024 squad. Throughout the tournament, he delivered key performances with the bat, but despite forming a remarkable partnership with Klaasen in the final, his team finished as runners-up. In a shocking decision, the Gujarat franchise decided to drop Miller, but he found a new home in the Lucknow team for the 2025 edition of the Indian Premier League. He was bought by the franchise for a whopping INR 7.5 crore which left the Gujarat fans shell shocked. In addition to his participation in the Indian Premier League, David Miller captained the Paarl Royals in the SA20 and competed in various franchise tournaments worldwide. While he played for the Texas Super Kings in America's Major League Cricket, he also has been a vital unit in the Caribbean Premier League His exceptional attacking and finishing abilities with the bat make him a formidable opponent for any team.",
  "nationality": "South Africa",
  "career_span": {
    "Test": "",
    "ODI": "2010-2025",
    "IPL": "2012-2025"
  }
}