{
  "id": "pprofile_3823",
  "type": "player_bio",
  "player": "Eoin Morgan",
  "full_name": "Eoin Joseph Gerard Morgan",
  "dob": "September 10, 1986",
  "role": "Batsman",
  "batting_style": "Left Handed",
  "bowling_style": "Right-arm medium",
  "teams": [
    "England",
    "Ireland",
    "ICC World XI",
    "England A",
    "England XI",
    "Royal Challengers Bengaluru",
    "Kolkata Knight Riders",
    "Punjab Kings",
    "Middlesex",
    "Ireland Under-19",
    "Sydney Thunder",
    "England Lions",
    "Sunrisers Hyderabad",
    "Barbados Royals",
    "Gazi Tank Cricketers",
    "Karachi Kings",
    "Peshawar Zalmi",
    "Durban Qalandars",
    "Kerala Knights",
    "Tshwane Spartans",
    "Dublin Chiefs",
    "Delhi Bulls",
    "London Spirit",
    "Team Morgan",
    "England Legends",
    "World Giants",
    "New York Strikers",
    "Paarl Royals",
    "Harare Bolts",
    "England Champions",
    "England Masters"
  ],
  "bio": "Unorthodox Irish batsman Eoin Morgan’s achievements will forever seem tainted by his switch to lucrative England to represent the Three Lions in international cricket. After successful youth stints for Middlesex, Morgan made his ODI debut for Ireland in 2006 against Scotland but then switched to England ahead of the 2009 World Twenty20. He played his first game in English colours in 2009 against the West Indies in Bristol. An extended opportunity came in the 7-match ODI series at home against Australia, where he featured on six occasions with top-scores of 43 and 58, showcasing a penchant for the reverse sweep. He later represented England in the World Twenty20, playing a solitary game against the Netherlands. He continued to perform well in both formats, with ODI centuries against Bangladesh and Australia in 2010. The left-hander’s ability to finish an innings drew comparisons to Australian Michael Bevan. After playing a crucial role in England’s World T20 success in 2010, Morgan was given his premier Test cap against touring Bangladesh. He retained his place to face Pakistan a month later, where he also scored his maiden Test hundred. Later, in 2011, he was appointed as Stuart Broad’s deputy in the T20 format. While many may doubt Moggie’s loyalty for turning against his home country, delving into a professional’s need to challenge himself with and against the best in the business, may render those doubts harsh. With the sacking of Alastair Cook as the ODI captain close to the 2015 World Cup, the selectors trusted Eoin Morgan to take over and do the job. Eoin started well in the tri-series in Australia, involving the home team and India, but in spite of his individual good form, his team failed to win the final. England's misery didn't end there as they experienced a very poor World Cup where they won just two matches (against Scotland and Afghanistan) and failed to qualify for the quarter-final. Post the 2015 World Cup debacle, Eoin Morgan decided to build a team with a fearless attitude. Many senior players were dropped and the team management invested in some young talents. Soon the results started to show and 'New England' under the able leadership of Eoin Morgan began to evolve. The revival was dramatic, to say the least, and in 2018 the Three Lions leapfrogged India to top World ODI Rankings for the first time in five years. Known for his composure under pressure, Morgan earned the respect and confidence of his players. He gave the license to his boys to fearlessly express themselves and that fresh approach changed everything for the English cricket as far as the shorter versions of the game is concerned. From down in the dumps in 2015, England entered the 2019 Cricket World Cup as one of the favourites and that was the testament of Morgan's inspirational captaincy. Eoin never let captaincy affect his batting. In fact, his batting average improved by leaps and bounds after taking over the reins. His ability as a batsman was never under doubt and his presence in the middle order allowed the top order to bat freely. In one of his knocks in the 2019 World Cup, Morgan smashed a 71-ball 148 against Afghanistan which included 17 sixes - a world record. Under Morgan's guidance and 'play fire with fire' approach, England scripted history by winning their maiden ODI World Cup title in 2019 and ended the 44-year long wait of a country that invented this beautiful game of cricket.",
  "nationality": "England",
  "career_span": {
    "Test": "2010-2012",
    "ODI": "2006-2022",
    "IPL": "2010-2021"
  }
}