{
  "id": "pprofile_69659",
  "type": "player_bio",
  "player": "Arjun Tendulkar",
  "full_name": "Arjun Sachin Tendulkar",
  "dob": "September 24, 1999",
  "role": "Bowler",
  "batting_style": "Left Handed",
  "bowling_style": "Left-arm medium fast",
  "teams": [
    "South Zone",
    "Mumbai Indians",
    "India Under-19",
    "Mumbai",
    "Goa",
    "Aakash Tigers Mumbai Western Suburbs"
  ],
  "bio": "Arjun Tendulkar, the son of the legendary Sachin Tendulkar, is carving his own path in the cricketing world with his left-arm medium-fast bowling and left-handed batting. Born in Mumbai, Arjun has been a part of the cricketing fabric from a young age, and his journey has been closely watched by fans and critics alike. His debut in the Indian Premier League with Mumbai in 2023 marked a significant milestone in his career, where he claimed his maiden wicket by dismissing Bhuvneshwar Kumar. Arjun's domestic career has seen him transition from Mumbai to Goa, where he continues to hone his skills. Arjun's bowling prowess was on full display during the Ranji Trophy 2024/25 season, where he took a five-wicket haul against Arunachal Pradesh, showcasing his ability to swing the ball and maintain a disciplined line and length. His best bowling figures of 5-25 in the match were a testament to his growing confidence and skill. In the same season, he also demonstrated his batting potential by scoring a maiden first-class century, hitting 120 runs against Rajasthan, which highlighted his capability as a lower-order batsman. While Arjun's career is still in its early stages, his performances have already caught the attention of cricketing circles. His ability to swing the ball both ways and his knack for picking up crucial wickets make him a promising prospect for the future. His performances in the Syed Mushtaq Ali Trophy, where he took four wickets for just 10 runs against Hyderabad, further underline his potential as a match-winner. Arjun Tendulkar's journey is one of potential and promise. As he continues to develop his skills, the cricketing world watches with anticipation to see how he will shape his career.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "",
    "IPL": "2023-2024"
  }
}