{
  "id": "pprofile_66870",
  "type": "player_bio",
  "player": "Cameron Green",
  "full_name": "Cameron Donald Green",
  "dob": "June 3, 1999",
  "role": "All-Rounder",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm fast medium",
  "teams": [
    "Australia",
    "Australia A",
    "Gloucestershire",
    "Royal Challengers Bengaluru",
    "Mumbai Indians",
    "Western Australia",
    "Australia Under-19",
    "Perth Scorchers",
    "Cricket Australia XI",
    "Prime Ministers XI",
    "Western Australia XI"
  ],
  "bio": "Cameron Green is a highly promising and versatile cricketer who hails from Australia. He is often regarded as the next best thing in Australian cricket and his unique ability to excel both as a right-handed batter and as a right-arm medium-fast bowler has drawn comparisons to legendary all-rounders like Jacques Kallis and Richard Hadlee. Green started at a young age and emerged through the ranks of the Western Australia cricket system. He made his first-class debut at the tender age of 17 in the 2016–17 Sheffield Shield against Tasmania and announced himself with a brilliant five-wicket haul in the first innings. He played his first List A game in the same year for Cricket Australia XI against the touring Pakistan side and picked up three wickets as well. He suffered from a stress fracture which kept him out of the game for almost the entire 2017–18 season. However, Green's breakthrough season came during the 2019-20 Sheffield Shield, where he scored 699 runs including an unbeaten 87 and another unbeaten 121 against Queensland to force an incredible draw. He also took 34 wickets, won the Bradman Young Cricketer of the Year award, and impressed the national selectors massively. Cameron Green playing for Australia was inevitable and in 2020, he made his ODI debut against India. In the same series, he also received his Baggy Green. In the longest format, he quickly showcased his all-round abilities. He is known for his elegant and technically sound batting, with the ability to play both aggressively and patiently. As a bowler, he can generate extra pace and bounce because of his height which makes him a lethal asset, especially in home conditions. He registered half-centuries in each of his first four series and picked up his maiden five-wicket haul in the Boxing Day Test against South Africa at MCG in 2022, that too, with a broken finger. After returning to the side from injury, Green notched up his first Test hundred against India in difficult conditions where other experienced batters failed which shows his exceptional skills. As far as T20 Leagues are concerned, Green made his T20 debut for Perth in the 2018/19 Big Bash League. His excellent performances on Indian soil in 2022 led to a bidding war in the IPL Auction where Mumbai ultimately bought him for a whopping 17.5 crore INR to be the long-term replacement of Kieron Pollard. He scored 452 runs including a fantastic century, and picked up six wickets in 16 matches. In Australia’s title-winning campaign at the 2023 ODI World Cup, Green had limited opportunities, but the maiden ODI World Cup was one to remember for the all-rounder. After a season with Mumbai in the Indian Premier League, he was acquired by Bengaluru in an all-cash trade before the 2024 auction. The start of 2024 saw Green return to Australia’s Test setup for the away series against Trans-Tasman rivals, New Zealand. He notched up a stunning ton in the first Test at Wellington, making a strong case for the number 4 spot, which became vacant after the retirement of David Warner, leading to Steven Smith's move to the top of the order. Cameron Green's meteoric rise, marked by remarkable performances across formats and conditions, cements his place as a cornerstone of Australia's cricketing future and a global all-rounder to watch in the years to come.",
  "nationality": "Australia",
  "career_span": {
    "Test": "2020-2025",
    "ODI": "2020-2025",
    "IPL": "2023-2024"
  }
}