{
  "id": "pprofile_48191",
  "type": "player_bio",
  "player": "Tabraiz Shamsi",
  "full_name": "Tabraiz Shamsi",
  "dob": "February 18, 1990",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Left-arm wrist spin",
  "teams": [
    "South Africa",
    "Dolphins",
    "Border",
    "Hampshire",
    "AET Tuskers",
    "Northamptonshire",
    "South Africa A",
    "Titans",
    "Royal Challengers Bengaluru",
    "Rajasthan Royals",
    "Warriors",
    "Rangpur Riders",
    "Saint Lucia Kings",
    "Guyana Amazon Warriors",
    "Jamaica Tallawahs",
    "St Kitts and Nevis Patriots",
    "Karachi Kings",
    "Lahore Qalandars",
    "Stellenbosch Kings",
    "Paarl Rocks",
    "Northern Warriors",
    "Edinburgh Rocks",
    "Deccan Gladiators",
    "Oval Invincibles",
    "Trent Rockets",
    "KG’s Kingfishers",
    "Galle Marvels",
    "Jaffna Kings",
    "Joburg Super Kings",
    "Paarl Royals",
    "New York Lions CC"
  ],
  "bio": "Cricket has seen a rare breed of bowlers known as chinamans, and in the current era, alongside India’s Kuldeep Yadav, Afghanistan’s Noor Ahmad, and South Africa’s Tabraiz Shamsi, the latter stands out as a vital asset for the Proteas. His crafty and deceptive variations have earned him a coveted spot in the national side. Tabraiz Shamsi began his cricket journey as a frontline seam bowler in high school. However, after trials for the under-19 team, his coaches advised him to switch to spin bowling, noting he wasn't fast enough for seam and had a knack for bowling cutters. After a standout 2013-14 season with Easterns, where he claimed 47 wickets at an impressive average of 20.02, Tabraiz Shamsi aimed for a franchise spot while bouncing between Highveld and Kwa-Zulu Natal. His performance caught the attention of the touring West Indies during their visit to South Africa in the summer of 2014, further solidifying his rising profile in cricket. In 2015, Tabraiz Shamsi joined the St Kitts and Nevis Patriots in the Caribbean Premier League under coach Eric Simons. He quickly made a name for himself, securing 11 wickets at an impressive average of 13.27 across seven matches, marking his rise in the T20 circuit. In April 2016, Tabraiz Shamsi was signed by Bengaluru franchise in the Indian T20 League as a replacement for the injured Samuel Badre, and made his debut against the now defunct Pune team. Tabraiz Shamsi began to carve out his niche in international cricket with his ODI debut during a triangular series in the Caribbean in June 2016. That same year, he made his Test debut against Australia in Adelaide, followed by his first T20 international the following June. However, he faced challenges securing a consistent spot in the South African lineup, as Keshav Maharaj had already established himself as the primary Test spinner, while Imran Tahir dominated the white-ball formats. Shamsi was included in the 2019 World Cup squad and played two matches, but it was only after Tahir's retirement post-tournament that Shamsi truly began to flourish in his role. Tabraiz Shamsi continued to make a name for himself in the domestic circuit, showcasing his talent as a premier spinner. In the 2017–18 Ram Slam T20 Challenge, he emerged as the leading wicket-taker, claiming 16 wickets in 11 matches. Additionally, he dominated the 2017–18 Momentum One Day Cup, finishing as the top wicket-taker with 26 wickets from just 9 matches, further solidifying his reputation in South African cricket. In March 2021, Tabraiz Shamsi achieved a significant milestone by becoming the top-ranked bowler in the ICC T20I rankings for the first time in his career. This accolade followed a stellar performance in a three-match T20I series against Pakistan, where he showcased his skills by taking six wickets. Additionally, he celebrated his first five-wicket haul in T20 internationals during a match against Sri Lanka later that year. Also, he overtook Dale Steyn to become the leading wicket-taker ever for South Africa in the the same year. Continuing with his impressive bowling stints, come 2021, he was acquired by the Rajasthan franchise of the Indian T20 League which was held in the UAE due to Covid restrictions. Now established as a key bowler in the South African setup across formats, Shamsi has featured in major ICC tournaments including the T20 World Cup of 2024 as well. He is no mug in the franchise world either.Mapping the world, he actively features in all the major T20 Leagues including the Indian T20 League of course, where he plays for the Rajasthan franchise while also featuring in the Lanka Premier League and the Pakistan Super League. In South Africa’s own SA20 he first played for the Paarl Royals in the initial years of the tournament, but was picked up by the Joburg Super Kings in the latest 2025 season. Considering the spinning conditions in the subcontinent, Shamsi was among the first-choice set of spinners to have considered for the Champions Trophy 2025 as well.",
  "nationality": "South Africa",
  "career_span": {
    "Test": "2016-2018",
    "ODI": "2016-2025",
    "IPL": "2016-2021"
  }
}