{
  "id": "pprofile_67489",
  "type": "player_bio",
  "player": "Darshan Nalkande",
  "full_name": "Darshan Girish Nalkande",
  "dob": "October 4, 1998",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm fast medium",
  "teams": [
    "Punjab Kings",
    "Delhi Capitals",
    "India Under-19",
    "Vidarbha",
    "Gujarat Titans",
    "Tata Sports Club",
    "Orange Tigers"
  ],
  "bio": "Darshan Nalkande is a right-arm fast bowler who also can bat down the order from Vidarbha. He comes from a small town, Wardha, Maharashtra, and grew up in a cricket-loving family, with his elder brother being a wicketkeeper-batter. This naturally pushed Darshan towards bowling, and by the age of nine, he had already started playing with the leather ball. His talent was evident early on, and he steadily climbed through Vidarbha’s age-group teams, representing them at U13, U16, and U19 levels before finally making his debut for the senior team in 2018. Darshan made his mark in domestic cricket with consistent performances. His List A debut came in the 2018-19 Vijay Hazare Trophy, followed by his first-class debut for Vidarbha in the Ranji Trophy the same season. He then made his T20 debut in the Syed Mushtaq Ali Trophy in 2019. With an ability to swing the ball and deliver crucial breakthroughs, he quickly became a valuable asset for his team. His Indian Premier League journey also has been quite good. In 2019, Punjab bought him for ₹30 lakh, but despite spending two seasons with them, he did not get a single game. In 2022, the Gujarat franchise picked him up for his base price of ₹20 lakh, and this time, he finally got his Indian Premier League debut against his former team, Punjab. Though opportunities were limited, he impressed with his sharp bowling and ability to handle pressure in crunch moments. Ahead of the 2024 Indian Premier League season, the Gujarat franchise retained him, showing faith in his abilities. But in the 2025 Indian Premier League auction, Delhi acquired him for ₹30 lakh, giving him a fresh start and a new opportunity to prove himself at the highest level. He played in the 2024-2025 Ranji Trophy Final for Vidarbha and picked up three wickets, and his team won its third Ranji Trophy title. He is a reliable all-rounder who can swing the bowl upfront and can also give some useful contributions with the bat down the order.",
  "nationality": "India",
  "career_span": {
    "IPL": "2022-2024"
  }
}