{
  "id": "pprofile_70402",
  "type": "player_bio",
  "player": "Kuldeep Sen",
  "full_name": "Kuldeep Rampal Sen",
  "dob": "October 22, 1996",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm fast",
  "teams": [
    "India",
    "Central Zone",
    "India A",
    "Rest of India",
    "Punjab Kings",
    "Rajasthan Royals",
    "Tamil Nadu",
    "Madhya Pradesh",
    "Rewa Jaguars",
    "Chambal Ghariyals"
  ],
  "bio": "Kuldeep Sen is a right-arm fast bowler. He was born in a small village in Madhya Pradesh and he grew up in a humble household where his father, Ram Pal Sen, worked as a barber. The third of five siblings, young Kuldeep had no idea that his love for cricket would one day put him on the world stage. Unlike many cricketers who start their journey early, Kuldeep picked up the sport seriously only at the age of 15. His passion for the game was immense, but his family, especially his father, was initially reluctant about his cricketing ambitions. However, his mother was his silent supporter, keeping his dreams alive. It was under the guidance of his coach, Aril Anthony, that Kuldeep honed his fast-bowling skills. His raw pace and ability to generate steep bounce made him a standout talent in the local circuit. Kuldeep’s hard work paid off when he made his first-class debut for Madhya Pradesh in the Ranji Trophy in November 2018. Just a few weeks later, he grabbed headlines by taking a five-wicket haul against Punjab. His ability to bowl consistently at speeds exceeding 140 kmph made him a valuable asset, and soon, he found himself making his T20 and List A debuts in the following seasons. The Indian Premier League (IPL) became his stepping stone to national recognition. In 2022, Rajasthan picked him up, and he announced his arrival in grand style. Defending 14 runs in the final over against Lucknow, he showcased nerves of steel, dismissing Marcus Stoinis to seal a thrilling victory. Performances like these caught the eye of national selectors, and by December 2022, he was donning the Indian jersey, making his ODI debut against Bangladesh. He took two wickets on debut, but an unfortunate back injury cut his international journey short. The road to recovery was long and filled with uncertainty. For two years, Kuldeep worked relentlessly, facing multiple setbacks, including a knee injury during the 2024 domestic season. However, his resilience never wavered. Encouragement from cricketing greats like Rahul Dravid and Rohit Sharma kept his spirits high. When he finally returned to competitive cricket in early 2024, it showed his unwavering determination.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "2022-2022",
    "IPL": "2022-2024"
  }
}