{
  "id": "pprofile_101907",
  "type": "player_bio",
  "player": "Shamar Joseph",
  "full_name": "Shamar Joseph",
  "dob": "August 31, 1999",
  "role": "Bowler",
  "batting_style": "Left Handed",
  "bowling_style": "Right-arm fast",
  "teams": [
    "West Indies",
    "West Indies A",
    "Guyana Harpy Eagles",
    "Guyana Amazon Warriors",
    "Peshawar Zalmi",
    "Northern Warriors",
    "Lucknow Super Giants",
    "Durban's Super Giants",
    "Dubai Capitals"
  ],
  "bio": "Standing at an imposing 6'2\", Shamar Joseph cuts an athletic figure with his lean, muscular frame. Hailing from the remote Guyanese village of Baracara, his rise in cricket has been as extraordinary as his physical stature. The Guyanese fast bowler's towering presence is complemented by broad shoulders and sinewy arms, a physique perfectly suited for generating the raw pace that characterizes his bowling. A young security guard from Guyana trades his night shifts for cricket whites, dreaming of bowling fast. In his very first Test series in Australia, he grabs five wickets in Adelaide - impressive, but just a warmup. Then comes Brisbane. Despite a crushed toe that would keep most players in the pavilion, Joseph produces pure magic. Through gritted teeth and sheer will, he charges in like a man possessed, balls whistling past Australian bats. Seven wickets fall. The last one clinches West Indies' first win Down Under in 27 years. In just two Tests, this sheer talent marked his arrival in style on the international platform. Joseph’s rise to the big stage of the Caribbean Premier League was one of the stories of 2023. It all began for Joseph at the Tucber Park Cricket Club when he left his job as a security guard and decided to pursue his passion for the sport. Selected as one of the four uncapped talents by the Guyana Harpy Eagles, Joseph emerged as an unexpected force during the 2022–23 Regional Four-Day Competition, with no prior representation for Guyana at any level. In February 2023, he made his debut in first-class cricket for Guyana against Barbados during the West Indies Championship, marking a groundbreaking entry into the professional arena. The highlight of this early phase was his maiden five-wicket haul against the Windward Islands in just his second first-class game. Initially enlisted as a net bowler for the Guyana Amazon Warriors in the 2023 Caribbean Premier League, as luck would have it, an injury to Keemo Paul resulted in Joseph being drafted as a replacement for the 2023 season. He was unlucky to pick up wickets in a fashion he would have liked, but he did not miss out on creating an impression in his debut Caribbean Premier League season. Later in the year, he ventured into List A cricket through his debut for Guyana during the 2023–24 Super50 Cup. His promising trajectory reached new heights as he earned a spot in the West Indies A side for their South African tour for three four-day games. Shamar Joseph ended the tour as the joint-most wicket-taker with 12 wickets to his name. Capping off a remarkable year, he found himself named among the seven uncapped players in the West Indies Test squad for the tour of Australia. After his Australian heroics, Joseph quickly racked up honors. Cricket West Indies gave him an international contract in February 2024. He made history by becoming the first West Indies player to win ICC Player of the Month (January 2024). The selectors then picked him for the T20 World Cup squad in May 2024, despite him never having played T20 internationals. Joseph's market value soared after his Test heroics. Lucknow franchise signed him for INR 3 crore in the 2024 Indian T20 League auction, despite his limited T20 experience of just two games. He was later sold to the same team for ₹75 lakh in the 2025 mega auction. Shamar Joseph’s meteoric rise in international cricket is nothing short of extraordinary, showcasing a blend of raw talent, relentless determination, and an exceptional work ethic.",
  "nationality": "West Indies",
  "career_span": {
    "Test": "2024-2025",
    "ODI": "2024-2025",
    "IPL": "2024-2024"
  }
}