{
  "id": "pprofile_66818",
  "type": "player_bio",
  "player": "Shubman Gill",
  "full_name": "Shubman Singh Gill",
  "dob": "September 8, 1999",
  "role": "Batsman",
  "batting_style": "Right Handed",
  "bowling_style": "Off break",
  "teams": [
    "India",
    "Glamorgan",
    "India A",
    "India B",
    "India Blue",
    "North Zone",
    "Kolkata Knight Riders",
    "India Under-19",
    "Punjab",
    "India Under-23",
    "India C",
    "Indians",
    "Gujarat Titans",
    "Team A"
  ],
  "bio": "Shubman Gill, a gifted top-order batter from Punjab, honed his skills playing cricket in his hometown, Fazilka before his father relocated to Mohali to provide better opportunities for his budding cricket career. Gill began his professional journey representing Punjab at the Under-16 level, where his talent quickly became evident. In 2017, Gill made his List A debut for Punjab, followed by his Ranji Trophy debut the same year. His exceptional performances at the Under-16 and domestic levels earned him a place in India’s U-19 team. Gill's rise to prominence came during the 2018 Under-19 World Cup in New Zealand, where he amassed 372 runs at an astounding average of 124, playing a pivotal role in India’s title-winning campaign. These standout performances caught the attention of IPL scouts, and Kolkata secured his services for the 2018 season. In 2019, Gill made his ODI debut during India’s tour of New Zealand. His Test debut came in December 2020 at the Melbourne Cricket Ground during India's tour of Australia. He impressed with a gritty 91 at The Gabba in the series-deciding Test, helping India secure a historic series victory in Australia. After four fruitful years with Kolkata, Gill moved to Gujarat ahead of the 2022 mega auction for a significant sum. As Gill’s career progressed, he has shown that he has the game to excel in all three formats. His leadership potential came to the fore when Gujarat appointed him captain ahead of the 2024 IPL season, following Hardik Pandya’s departure from the franchise. Gujarat had an underwhelming season, finishing 8th, but Gill had yet another fine season with the bat in the IPL. However, when it came to his fortunes with the national team, his performances left a lot to be desired, whether it was the Test series at home against New Zealand or the Border-Gavaskar Trophy Down Under. Looking at his leadership qualities, 2025 saw Gill earn a place in the leadership group as he was named vice-captain of the ODI team for the Champions Trophy and the preceding ODI series against England. A stellar series against England propelled Gill to the top of the ODI rankings for the second time in his career, having first achieved the feat during the 2023 ODI World Cup. May 2025 saw both Rohit Sharma and Virat Kohli bring their illustrious Test careers to a close. With a new World Test Championship cycle on the horizon, their departures created a significant leadership void in the longest format. Several contenders emerged for the coveted role, but the Indian selectors ultimately appointed Shubman Gill as the new Test captain, entrusting him with the responsibility of leading the team into a new era.",
  "nationality": "India",
  "career_span": {
    "Test": "2020-2025",
    "ODI": "2019-2025",
    "IPL": "2018-2025"
  }
}