{
  "id": "pprofile_3899",
  "type": "player_bio",
  "player": "Ishant Sharma",
  "full_name": "Ishant Sharma",
  "dob": "September 2, 1988",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm fast medium",
  "teams": [
    "India",
    "India A",
    "India Blue",
    "India Red",
    "North Zone",
    "Rest of India",
    "Kolkata Knight Riders",
    "Punjab Kings",
    "Delhi Capitals",
    "Deccan Chargers",
    "India Under-19",
    "Sussex",
    "Delhi",
    "Sunrisers Hyderabad",
    "Rising Pune Supergiant",
    "Indians",
    "Gujarat Titans",
    "Purani Delhi 6",
    "West Delhi Lions"
  ],
  "bio": "Ishant Sharma or \"Lambu\" as he is called by his teammates because of his tall and lean figure which measures up to 193 cm was born in Delhi on 02 September 1988. At the age of 14, his love for cricket translated on the pitch as he started getting serious about building his career around the Gentleman's Game. Like many others in the Indian cricket team, his journey to the first team was paved through the Ranji Trophy as he made his debut for Delhi when he was 18. An injury to Munaf Patel made way for Ishant to make his Indian Test debut against Bangladesh in May 2007. Also, he made his impact against Pakistan in a Test match scalping 5/140 in late 2007 which was just the second Test of his career. His biggest announcement on the world stage came against Australia during the 2008 tour, especially his bowling against the Aussie captain and legend, Ricky Ponting. Not surprisingly, he also holds the distinction of having bowled the fastest ball ever bowled by an Indian when his delivery crossed the 150+ mark clocking 152.6 km/h in the same tour at the Adelaide Oval, which has now been over-taken by Jasprit Bumrah as he clocked 153 km/h at the same location. During the following CB series, he scalped 14 wickets and was also the highest wicket-taker in the series. His exploits got Kolkata's attention in the inaugural season of the Indian Premier League as they cashed out for him and got him which also made him one of the highest-paid players of the League. During the later stages of 2008, when the Australian team toured India, Ishant and Zaheer ripped them apart with their reverse swing. He was also named the Man of the Series as he picked up 15 wickets throughout the course of the series. Coming into 2009, Ishant's form took a huge dip, and his self-confidence was shattered as well. In the Indian Premier League, he didn't replicate his form from the previous years as he was picked as a bowler by the batsmen to attack and hit all over the park as Kolkata performed horribly and finished last in the second season. His form did not pick up during the 2009 ICC T20 World Cup either. In 2012, Ishant underwent ankle surgery and could not play for the next couple of months. The selectors decided to keep him in the Test squad but he performed sub-par picking up just 16 wickets in 8 Tests when India toured England, Australia and later when Australia toured India. He did have a shimmer of hope in 2013 as during the ICC 2013 Champions Trophy, he picked up 10 wickets including important wickets in the finals against the hosts England. This was probably the highlight of his ODI career as his form in the ODI format has been very hot and cold. He was also dropped for the 2014 edition of the Asia Cup. Ever since his return to the Test squad, he has performed really well. He played three Test matches during India's tour of England in 2014, where he won the Man of the Match award and performed admirably during the second innings of the Lord's Test, with figures of 7/74. He returned to ODI cricket with a wonderful performance which grabbed him his career-best figures of 4/34 against Sri Lanka later that year. He also played well in the 2014-15 Border-Gavaskar Trophy in three Test matches. This good run of form surprisingly made the selectors pick him for the 2015 ICC World Cup squad but unfortunately for him, he failed to recover from a knee injury which then meant that he couldn't take part in the showpiece tournament. Even in the Indian Premier League, he has been with a few different teams, which has raised questions about his ability to develop and perform in different playing conditions. He has played for around 5 different teams until 2019 and in the 2020 season of the Indian Premier League coming up, he will be representing Delhi with the likes of Kagiso Rabada and Chris Woakes. Though since 2016, Ishant has been down the pecking order for the pacers of the Indian team due to the emergence of Mohammad Shami, Umesh Yadav, Jasprit Bumrah, etc, he has still shown time and time again that in the Test format, there is no one quite like him and thus captains like MS Dhoni and Virat Kohli both make it a point to include him in their Test squads. He was also part of the 2018-19 Border-Gavaskar Trophy held Down Under. Over time, Ishant has proven that he does have the necessary mettle to prove his worth in all formats but he has not been able to showcase it on every opportunity that has been presented. Throughout his career, Sharma has achieved remarkable milestones, including his 300th Test wicket in February 2021, cementing his legacy as one of India's greatest pacers. Known for his \"rhythm\" bowling style, Sharma's ability to consistently clock speeds more than 140 km/h has made him a formidable force in international cricket. In recognition of his outstanding contributions to Indian cricket, Ishant Sharma was honored with the prestigious Arjuna Award by the Indian government in 2020. This accolade serves as a testament to Sharma's exemplary achievements and impact on the sport, inspiring future generations of cricketers in India and beyond. Despite facing challenges and setbacks throughout his career, Ishant Sharma's resilience, determination, and passion for the game have remained unwavering. Although Sharma has been away from the international cricket scene, the tall pacer continues to make his mark in domestic cricket, especially in the IPL. Over the years, he has played for various franchises, with the 36-year-old veteran representing Delhi Capitals until the 2024 season. While his selection in the playing XI was inconsistent, he made the most of the opportunities he was given. Ahead of the 2025 IPL auction, he was released by Delhi, and Gujarat Titans showed interest, acquiring his services for his base price of INR 75 lakhs. This move marked Ishant's sixth IPL franchise. With 93 IPL wickets to his name, the 2025 season offers him a great chance to reach the milestone of 100 wickets in this prestigious tournament.",
  "nationality": "India",
  "career_span": {
    "Test": "2007-2021",
    "ODI": "2007-2016",
    "IPL": "2008-2025"
  }
}