{
  "id": "pprofile_70227",
  "type": "player_bio",
  "player": "Sediqullah Atal",
  "full_name": "Sediqullah Atal",
  "dob": "August 12, 2001",
  "role": "Batsman",
  "batting_style": "Left Handed",
  "bowling_style": "-",
  "teams": [
    "Delhi Capitals",
    "Afghanistan Under-19",
    "Afghanistan",
    "Rangpur Riders",
    "Afghanistan A",
    "Band-e-Amir Region",
    "Amo Region",
    "Band-e-Amir Dragons",
    "Kabul Eagles",
    "Mis-e-Ainak Knights",
    "Maiwand Defenders",
    "Pamir Legends",
    "Hindukush Strikers",
    "MI Cape Town",
    "Dubai Capitals",
    "Maiwand Champions"
  ],
  "bio": "Sediqullah Atal has emerged as one of Afghanistan's most promising young talents, showcasing a classical style of batting that has steadily evolved. Known for his elegant strokeplay and composed demeanor at the crease, Atal has grown in consistency. On September 7, 2020, he played his first Twenty20 match for Kabul Eagles in the 2020 Shpageeza Cricket League. He was included in Afghanistan's squad for the 2020 Under-19 Cricket World Cup before making his T20 debut. On October 17, 2021, he made his List-A debut for the Band-e-Amir Region in the Ghazi Amanullah Khan Regional One Day Tournament. Sediqullah was included in Afghanistan's One Day International (ODI) team for their series against Pakistan in July 2021, however, the series was subsequently postponed as the Taliban took control of the country. Both cricket boards agreed to play three T20I matches in place of ODIs when the series was rescheduled on January 2023. Afghanistan's lineup for that series against Pakistan once more included Sediqullah. On March 27, 2023, he made his T20I debut in the series' third and last T20I encounter. He was also added to Afghanistan's squad for the 2024 ICC Men’s T20 World Cup competition in May 2024 as a reserve player. Sediqullah Atal represented Afghanistan A in the ACC Emerging Team Asia Cup in October 2024, scoring 368 runs in 5 games to win the tournament's player award. At a remarkable strike rate of 145 and batting average of 122.66, he scored 368 runs in the tournament and displayed immaculate consistency with mature composure. With this outstanding performance, he became the top run-scorer on the board and guided Afghanistan A to their first-ever ACC Asia Cup trophy victory. Atal's consistent performances with the bat have earned him a spot in the national team at a young age. With his solid technique and reliable temperament, he has all the makings of a dependable opening batter and is poised to be a key asset to Afghanistan's lineup in the years ahead.",
  "nationality": "Afghanistan",
  "career_span": {
    "Test": "2024-2024",
    "ODI": "2024-2025",
    "IPL": "2025-2025"
  }
}