{
  "id": "pprofile_60544",
  "type": "player_bio",
  "player": "Matt Henry",
  "full_name": "Matthew James Henry",
  "dob": "December 14, 1991",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm fast medium",
  "teams": [
    "New Zealand",
    "Canterbury",
    "Derbyshire",
    "Kent",
    "New Zealand A",
    "South Island",
    "Worcestershire",
    "Punjab Kings",
    "Chennai Super Kings",
    "Somerset",
    "New Zealand XI",
    "New Zealanders",
    "Edinburgh Rocks",
    "Welsh Fire",
    "Lucknow Super Giants",
    "San Francisco Unicorns"
  ],
  "bio": "Matt Henry is a highly skilled New Zealand cricketer, born in Christchurch. A right-arm fast-medium bowler, Henry is renowned for his ability to swing the ball effectively and his excellent seam position. Henry's journey in domestic cricket began with Canterbury, where he made his first-class debut in 2010. His consistent performances earned him a reputation as a key player. His form in domestic cricket eventually led to a spot in the New Zealand A team, where he continued to impress. Henry’s strong displays in domestic cricket paved the way for his call-up to the New Zealand national team. He made his ODI debut in 2014 against India, immediately making an impact with a remarkable 4/38 in his first match. He followed up with his T20I and Test debuts shortly thereafter. Just a year after his ODI debut, Henry was part of New Zealand’s squad for the 2015 ODI World Cup. Due to the fierce competition for spots in the pace attack, with established names like Tim Southee, Trent Boult, and Adam Milne, Henry featured in only a couple of games. It was during the 2019 ODI World Cup that Henry truly made his mark on the international stage. He took 14 wickets in 9 games, but his standout performance came in the semifinal against India. Henry set the tone for New Zealand's success by dismissing both Indian openers, and his three-wicket haul earned him the Player of the Match award. In the years that followed, Henry continued to perform well in the domestic circuit, pushing for a more consistent run in the national side. However, with Boult and Southee already established as the key pacers, Henry’s opportunities remained limited. In 2022, after Boult opted out of the central contract and his appearances for New Zealand became limited to ICC events, Henry started featuring more regularly for the national team and he did not disappoint. The 2022-23 Plunket Shield season was a standout for Henry as he finished as the leading wicket-taker for Canterbury, underlining his growing importance in New Zealand cricket. During the off-season in New Zealand, Henry took his talents to Somerset in England, where he continued his excellent form. In the T20 Blast, he played a key role in Somerset's title-winning campaign. Henry finished as the highest wicket-taker with 31 wickets in just 14 innings, showcasing his exceptional ability in limited-overs cricket. He carried that form into the County Championship, where he continued to excel, further solidifying his place as one of New Zealand's most consistent and successful fast bowlers. At the 2023 ODI World Cup, with Tim Southee recovering from an injury, Matt Henry was entrusted with spearheading New Zealand's pace attack alongside Trent Boult. He started the tournament with a bang, taking two impressive three-wicket hauls in the early stages. However, disaster struck when Henry suffered a right hamstring injury, which ruled him out of the event. His injury was a significant blow to New Zealand's hopes, and the team ultimately bowed out in the semifinals. Henry made a successful comeback in 2024, and there was no looking back. He hit his straps post-return, showcasing his resilience. While New Zealand faced losses against both Australia and England in home series, Henry continued to give his all. His performances, however, were not limited to losses. During New Zealand's tour of India, Henry ripped through India's batting in the Bengaluru Test, helping New Zealand gain a series lead that they eventually extended to a 3-0 win.",
  "nationality": "New Zealand",
  "career_span": {
    "Test": "2015-2025",
    "ODI": "2014-2025",
    "IPL": "2017-2024"
  }
}