{
  "id": "pprofile_28994",
  "type": "player_bio",
  "player": "Mohammad Shami",
  "full_name": "Mohammad Shami Ahmed",
  "dob": "September 3, 1990",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm fast",
  "teams": [
    "India",
    "Asia XI",
    "ICC World XI",
    "East Zone",
    "India A",
    "Rest of India",
    "Kolkata Knight Riders",
    "Punjab Kings",
    "Delhi Capitals",
    "Bengal",
    "Sunrisers Hyderabad",
    "Indians",
    "Gujarat Titans",
    "Shrachi Rarh Tigers"
  ],
  "bio": "The prettiest sight for a fast bowler, watching the stumps cartwheel or getting knocked out of the ground, became more of a next-door neighbour for Mohammed Shami at the start of his international career for India. He made his first-class debut against Assam in November 2010, where he took three wickets. In 2011, he was picked by Kolkata for the fourth season of the Indian Premier League. Later on, Delhi acquired his services in 2014 and retained him in 2016. With the ability to swing the new as well as the old ball at a brisk pace, Shami gained a lot of respect from the Aussies during their ODI tour to India in 2013, admitting that Shami's deliveries hit their bats pretty hard. He was drafted into the Test squad thereafter against West Indies and made his debut on his home ground at the Eden Gardens. He shell-shocked the West Indians with his reverse swing, finding the stumps on numerous occasions. Mohammed Shami made a significant impact in the 2015 World Cup and played a key role in taking his team to the semis. Soon after the tournament, his career hit a roadblock when he was diagnosed with a knee injury. He missed the limited-overs tour to Australia, the Asia Cup, and the World T20 during that period. When Shami returned to full fitness, he was drafted into India's Test squad to play in West Indies. With 11 wickets, he was the second most successful bowler for India in the series and showed his class once again. Shami continued his progress and played a key role in India's overseas Test tours in 2017/18. In the shorter versions as well, Mohammad Shami had a strong tour of New Zealand in early 2019, where he was India's leading wicket-taker. It was a no-brainer that India picked Shami in their World Cup squad for 2019. After waiting for a few games, he got a chance to play in place of an injured Bhuvneshwar Kumar and took a hat-trick against Afghanistan. There was no looking back for Shami after that World Cup. A player who had previously underwhelmed in the IPL, the tournament proved to be the spark the right-arm quick needed. Though Punjab fell short of the playoffs in both 2020 and 2021, Shami made his presence felt with the ball in both seasons. After being released by Punjab, Gujarat, one of the two new entrants to the IPL in 2022, acquired his services. Shami led from the front, finishing as the highest wicket-taker in Gujarat's title-winning campaign in their very first season. Come 2023, the ODI World Cup in India presented another big stage, and Shami delivered a dream tournament. However, it all ended in heartbreak in the final against Australia. With 24 wickets from just 7 innings, he finished as the tournament's highest wicket-taker. But following that remarkable run, he faced a long injury layoff, undergoing recovery and rehabilitation after surgery on his right heel. Shami made his return to domestic cricket towards the back end of 2024. As the much-anticipated Border-Gavaskar Trophy approached, expectations were high for his comeback to international cricket. However, his return hit a roadblock as his left knee developed minor swelling due to increased joint loading from his bowling workload in domestic matches. As a result, his return to the Indian side was delayed. The wait finally ended in 2025 when he made his long-awaited comeback after 14 months on the sidelines. First came his return to the T20I setup, followed by a comeback in ODIs, and he was subsequently picked for the Champions Trophy, completing a full-circle moment in his international resurgence.",
  "nationality": "India",
  "career_span": {
    "Test": "2013-2023",
    "ODI": "2013-2025",
    "IPL": "2013-2025"
  }
}