{
  "id": "pprofile_65027",
  "type": "player_bio",
  "player": "Wanindu Hasaranga",
  "full_name": "Pinnaduwage Wanindu Hasaranga De Silva",
  "dob": "July 29, 1997",
  "role": "All-Rounder",
  "batting_style": "Right Handed",
  "bowling_style": "Leg break",
  "teams": [
    "Sri Lanka",
    "Colombo Cricket Club",
    "Galle Cricket Club",
    "Sri Lanka Emerging",
    "Sri Lanka A",
    "Royal Challengers Bengaluru",
    "Rajasthan Royals",
    "Sri Lanka Under-19",
    "Ace Capital Cricket Club",
    "Sylhet Strikers",
    "Sunrisers Hyderabad",
    "Rangpur Riders",
    "Sri Lanka Under-23",
    "St Kitts and Nevis Patriots",
    "Comilla Victorians",
    "Colombo",
    "Galle",
    "Quetta Gladiators",
    "Khulna Tigers",
    "Sri Lankans",
    "Colombo District",
    "Dambulla",
    "Maratha Arabians",
    "Team Srilankan Cricket",
    "Northern Warriors",
    "Team Sri Lanka",
    "Delhi Bulls",
    "Deccan Gladiators",
    "Manchester Originals",
    "Jaffna Kings",
    "Kandy Falcons",
    "SLC Blues",
    "SLC Reds",
    "Desert Vipers",
    "Washington Freedom",
    "SLC Yellow",
    "Jaffna Titans"
  ],
  "bio": "Wanindu Hasaranga, the versatile all-rounder hailing from the vibrant city of Galle, has carved a niche for himself in the cricketing arena with his adept leg-spin bowling. His cricketing journey commenced at Richmond College, Galle, where he honed his skills and laid the foundation for his illustrious career. Initially recognised for his prowess as a frontline seam bowler, Hasaranga heeded the advice of his mentor and transitioned into a leg-spinner, a move that would shape his future in the sport. In 2016, Hasaranga's talent caught the eye of selectors as he earned a spot in Sri Lanka's U19 World Cup squad, marking his debut on the international stage. A year later, he made a memorable entry into ODI cricket, clinching a hat trick in his debut match against Zimbabwe. The year 2019 witnessed Hasaranga's long-awaited T20I debut against New Zealand, a significant milestone in his international career. His breakthrough performance came later that year during the T20I series against Pakistan, where his bowling prowess earned him the prestigious title of Man of the Series after claiming 8 wickets in three matches. Earning a spot in the Test squad to face South Africa in December 2020 marked another significant milestone in Hasaranga's journey, as he ventured into the longest format of the game, showcasing his adaptability across all formats. The pinnacle of Hasaranga's career came during the 2021 ICC World Twenty20, where he emerged as the leading wicket-taker of the tournament. The subsequent year saw him play a pivotal role in Sri Lanka's triumph at the 2022 Asia Cup, where his stellar all-round performances earned him the prestigious title of Player of the Tournament. In June 2023, Wanindu played a pivotal role in Sri Lanka’s successful qualification for the ODI World Cup. However, his World Cup dreams were dashed when a hamstring injury ruled him out of the tournament. After an extended injury layoff, Hasaranga made a triumphant return in early 2024, but his joy was short-lived. Chronic heel pain in his left foot forced him to miss the 2024 IPL season for Hyderabad. He recovered in time to lead Sri Lanka in the 2024 T20 World Cup, but the team endured a disappointing campaign, failing to progress beyond the group stage. Ahead of the 2025 IPL auction, Hyderabad released Hasaranga, and he was subsequently snapped up by Rajasthan for INR 5.25 crore.",
  "nationality": "Sri Lanka",
  "career_span": {
    "Test": "2020-2021",
    "ODI": "2017-2025",
    "IPL": "2021-2025"
  }
}