{
  "id": "pprofile_58065",
  "type": "player_bio",
  "player": "Dushmantha Chameera",
  "full_name": "Pathira Vasan Dushmantha Chameera",
  "dob": "January 11, 1992",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm fast",
  "teams": [
    "Sri Lanka",
    "Sri Lanka Emerging",
    "Nondescripts Cricket Club",
    "Sri Lanka A",
    "Royal Challengers Bengaluru",
    "Kolkata Knight Riders",
    "Delhi Capitals",
    "Rajasthan Royals",
    "Wayamba",
    "Nagenahira Nagas",
    "Sri Lanka Cricket Board President XI",
    "Yaal Blazers",
    "Colombo",
    "Kandy",
    "Galle",
    "Galle Guardians",
    "Sri Lankans",
    "Matara District",
    "Team Srilankan Cricket",
    "Northern Warriors",
    "Delhi Bulls",
    "Colombo Strikers",
    "Galle Marvels",
    "Kandy Falcons",
    "SLC Greens",
    "SLC Reds",
    "Chennai Brave Jaguars",
    "Lucknow Super Giants",
    "Dubai Capitals",
    "Hambantota Bangla Tigers"
  ],
  "bio": "Dushmantha Chameera, born on January 11, 1992, is a Sri Lankan right-arm fast bowler renowned for his speed and inswinging deliveries. He made his international debut in 2015 and quickly gained recognition for his bowling prowess. Initially spotted at Nondescript Cricket Club in 2012, Chameera's talent as a bowler was evident from the start. His outstanding domestic season in 2013–14 earned him a spot in Sri Lanka's Test team to face New Zealand at the end of 2014, although he didn't feature in any of the matches. However, he made his ODI debut against New Zealand during the same series in Wellington and left a mark with his pace, claiming a wicket. Chameera was part of Sri Lanka's 2015 ICC World Cup squad and played a crucial role in a group stage match against Scotland, where he took three vital wickets contributing to Sri Lanka's victory. Later that year, he achieved his first five-wicket haul against New Zealand in Hamilton, displaying exceptional fast bowling skills. Despite his promising start, Chameera faced challenges with injuries that affected his career. Knee problems since 2015 have led to a decline in his pace and intermittent appearances in the Sri Lankan team. However, his talent as a fast bowler remains undeniable. In the Indian Premier League, Chameera has represented teams like Rajasthan, Bangalore and Lucknow in the past. In the 2024 season, Kolkata signed him as a replacement for Gus Atkinson, acquiring him for his base price of INR 50 lakh after going unsold at the auction.",
  "nationality": "Sri Lanka",
  "career_span": {
    "Test": "2015-2021",
    "ODI": "2015-2025",
    "IPL": "2022-2025"
  }
}