{
  "id": "pprofile_4321",
  "type": "player_bio",
  "player": "Chris Woakes",
  "full_name": "Christopher Roger Woakes",
  "dob": "March 2, 1989",
  "role": "All-Rounder",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm fast medium",
  "teams": [
    "England",
    "England A",
    "England XI",
    "MCC",
    "Warwickshire",
    "Wellington Firebirds",
    "Royal Challengers Bengaluru",
    "Kolkata Knight Riders",
    "Punjab Kings",
    "Delhi Capitals",
    "England Under-19",
    "Sydney Thunder",
    "England Lions",
    "Birmingham Phoenix",
    "Welsh Fire",
    "Team Morgan",
    "Durban's Super Giants",
    "MI Emirates",
    "Sharjah Warriorz"
  ],
  "bio": "Born in the West Midlands region of England, Christopher Roger Woakes, or 'Chris Woakes' as people know him is an English International Cricketer. He is an all-rounder with bowling his strongest suit. He bowls right-arm fast-medium and is also a very handy batter. He was a very important part of the England squad that won the 2019 ICC World Championship. Woakes was always a talented kid and it was evident that he would make it to the top ever since the beginning. He made his debut for his county side Warwickshire against a West Indies 'A' side that was touring England. He bagged three wickets on his debut and has been a mainstay ever since. Two years later in 2008, his best came to the fore in the domestic circuit where he took 42 wickets at an average of 20.57. This form saw him called up to the preliminary squad for the 2009 ICC World T20 Championship. Later in the same year, playing for the England Lions, he was almost unplayable for a West Indies side containing the likes of Ramnaresh Sarwan, Shivnarine Chanderpaul, etc. He bagged figures of 6/43 in the first innings. However, Woakes is a very decent batter as well with good technique. The highlight of his batting career came when he smashed a ton along with Jonathon Trott playing against Hampshire as they forged a 222-run partnership for the 9th wicket. Woakes had to work hard to earn his international debut which came in 2011 when he was given the chance in a T20I against Australia. His ODI debut also came soon after against the same opponent. Just in his second match, he bagged his career-best figures of 6/45 against the Aussies in Brisbane. Chris made his Test debut in 2013 following an injury to Tim Bresnan in 'The Ashes' but he was unable to make an impact. He remained a peripheral figure of the England national setup due to their star-studded bowling attack having the likes of James Anderson or Stuart Broad to lead the attack. Another problem for him was his away performances. He was always good on English pitches and conditions but he struggled for form away from home a lot. However, the turning point came for him when England was facing Pakistan in a Test match at Lord's in 2016. He took 11 wickets in the match and also ground out batting performances in both innings. Woakes this time made a huge impression and from there on he hasn't looked back. Woakes was picked in the 2019 World Cup squad to lead the attack for the Three Lions and he did not disappoint. He delivered consistent bowling performances for England throughout the tournament and was also adjudged the 'Man of the Match' in their semi-final clash against Australia as they went on to lift the elusive Cup after defeating New Zealand in a thrilling final at Lord's. In 2022, Woakes picked up his 100th Test wicket in the second Test against West Indies while the following year he completed 150 wickets in ODIs in a match against Sri Lanka. His consistent performances earned him a place in the England squad for the 2021 T20 World Cup. He was also part of the 2022 T20 World Cup where he played a key role in lifting the trophy for his country. Woakes is one of 6 players to play in both the 2019 ODI and 2022 T20 World Cup winning squads. In 2023, he was recalled for the 3rd Ashes Test where he picked up 6 wickets and contributed with the bat to win the match. He finished the series with 19 wickets and was named England's Player of the Series. Woakes have also played in different T20 Leagues around the world like the Hundred, International League T20, and the Australian T20 League. In 2017, he played for Kolkata in the Indian Premier League and ended up with 17 wickets in 13 games. The following year he was picked up by Bangalore but didn't enjoy much success and was released. He made a return in 2021 for Delhi after pulling out of the previous season but couldn't replicate his form. Woakes was bought by Punjab ahead of the 2024 Indian Premier League but was released before the following season.",
  "nationality": "England",
  "career_span": {
    "Test": "2013-2025",
    "ODI": "2011-2023",
    "IPL": "2017-2021"
  }
}