{
  "id": "pprofile_67469",
  "type": "player_bio",
  "player": "Varun Chakaravarthy",
  "full_name": "Varun Chakaravarthy Vinod",
  "dob": "August 29, 1991",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Leg break googly",
  "teams": [
    "India",
    "Kolkata Knight Riders",
    "Punjab Kings",
    "Tamil Nadu",
    "Siechem Madurai Panthers",
    "Dindigul Dragons",
    "IDream Tiruppur Tamizhans",
    "Vijay CC",
    "Dindigul"
  ],
  "bio": "'Mystery' is a word that always brings a sense of excitement with it. In cricket too, mystery bowlers over the years have brought with them a sense of anticipation and thrill among the cricketing fraternity. The same gusto was seen in Indian cricketing circles when Varun Chakravarthy started making inroads in Indian cricket as a mystery spinner. Varun started his cricket journey as a wicketkeeper batter but left cricket to concentrate on his studies in college. He completed the Architecture degree and started working as a freelance Architect after that. During this time, Varun was playing tennis-ball cricket, and eventually, at the age of 25, he decided to quit his job to pursue a career as a professional cricketer. Chakravarthy then joined CromBest Cricket Club as a seam-bowling all-rounder, but a knee injury forced him to eventually become a spinner. The move turned out to be a masterstroke as he started making all the right noises as a mystery spinner in 2017-18 when he picked 31 wickets in seven games in a one-day competition for Jubilee Cricket Club. Playing in the fourth division of the Chennai League, Varun started working on his variations and slowly started moving up through the ranks of Tamil Nadu Cricket. He came into the spotlight during the 2018 Tamil Nadu T20 League as he played a major role in Madurai clinching the title that year. It turned out to be a breakthrough season for the young spinner as Varun got an opportunity to bowl as a net bowler for the Chennai and Kolkata franchises in the Indian Premier League. He finally caught the eyes of Tamil Nadu selectors and made his List A debut for Tamil Nadu in the 2018-19 Vijay Hazare Trophy. He was the leading wicket-taker for Tamil Nadu that season as he picked 22 wickets in 9 games. He also made his first-class debut against Hyderabad in the 2018-19 season of the Ranji Trophy. Ahead of the 2019 season of the Indian Premier League, Varun Chakravarthy was bought by Punjab, and he made his debut against Kolkata in the 2019 edition of the tournament. He had the worst possible start as he was hammered for 25 runs in his first over. Varun, though, was still rated highly and was selected by Kolkata for the 2020 edition of the IPL. He straightaway made an impact and picked 17 wickets in the tournament and was so impressive that he received his maiden India call-up for the Australia tour in the same year. He was later ruled out due to an injury but was selected again for the England series but was again left out due to fitness concerns. He finally made his T20I debut for India against Sri Lanka in 2021 and was later included in the Indian squad for the ICC Men’s T20 World Cup, 2021, on the back of another successful Indian Premier League season where he picked 18 wickets. Varun came into the marquee event with high hopes, but his performance was below par, and he went wicketless in the three games he played. India crashed out of the World Cup in the Super 12 stage, and Chakravarthy was also left out of the Indian squad. The 2022 season of the Indian Premier League also did not go according to the plans, as he picked up only 6 wickets in the 11 games he played. From 2023, it was as if the start of Varun 2.0, as the mystery spinner emerged as a completely different bowler and rediscovered himself. Even though Kolkata failed to make the playoffs that season, Varun stood out with 20 wickets in 14 games. He followed it up with another stellar campaign in 2024, claiming 21 wickets in Kolkata’s title-winning run. Back-to-back remarkable IPL seasons earned Varun a return to the Indian side in 2024 for the first time since 2021. In his comeback series against Bangladesh, it took him some time to hit his stride, but in South Africa and then against England, he had the batters dancing to his tunes. With 14 wickets at home against England, he picked up his first Player of the Series award at the international level. This paved the way for his ODI debut in the series that followed, and he was subsequently drafted into India's Champions Trophy squad as a late addition.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "2025-2025",
    "IPL": "2019-2025"
  }
}