{
  "id": "pprofile_65893",
  "type": "player_bio",
  "player": "Josh Inglis",
  "full_name": "Joshua Patrick Inglis",
  "dob": "March 4, 1995",
  "role": "Wicket-Keeper",
  "batting_style": "Right Handed",
  "bowling_style": "-",
  "teams": [
    "Australia",
    "Australia A",
    "Leicestershire",
    "Punjab Kings",
    "Western Australia",
    "Perth Scorchers",
    "National Performance Squad",
    "Cricket Australia XI",
    "Prime Ministers XI",
    "London Spirit",
    "Western Australia XI",
    "San Francisco Unicorns"
  ],
  "bio": "Josh Inglis, a name that has been making waves in the cricketing world, is quickly establishing himself as a formidable force in the Australian cricket team. Born in England but representing Australia, Inglis has shown remarkable prowess both behind the stumps and with the bat. His journey from a promising young cricketer to a key player in the national team is a testament to his dedication and skill. Inglis made his Test debut in January 2025 against Sri Lanka, marking the occasion with a century, a feat that only a few have achieved on their debut. His performance in the ODI format has been equally impressive, with a standout innings of 120 runs against England in the ICC Champions Trophy 2025. In T20Is, Inglis has already notched up two centuries, including a blistering 100 off just 43 balls against Scotland, showcasing his ability to dominate in the shortest format of the game. His batting style is characterized by a high strike rate, often exceeding 150 in T20s, and his ability to play aggressive cricket has made him a valuable asset in the middle order. Inglis's adaptability is evident in his performances across different formats, and his fielding skills are also noteworthy, reflecting his sharp reflexes and agility. Inglis's journey has not been without its challenges. Despite facing setbacks, such as losing his place as Australia's T20I wicket-keeper in 2020, he has consistently bounced back, proving his mettle with crucial performances. His leadership qualities were on display when he captained Australia in an ODI against Pakistan, further cementing his role as a future leader in the team. Inglis was named in the Australian squad for the 2025 Champions Trophy, and he proved his worth with a fantastic hundred, smashing 120 off just 86 balls against England to help the Aussies chase over 350. Even though they were knocked out by India in the semi-finals, he is a player to watch out for in the near future and especially in the Indian Premier League, where he will be representing Punjab.",
  "nationality": "Australia",
  "career_span": {
    "Test": "2025-2025",
    "ODI": "2022-2025",
    "IPL": "2025-2025"
  }
}