{
  "id": "pprofile_64724",
  "type": "player_bio",
  "player": "Jitesh Sharma",
  "full_name": "Jitesh Mohan Sharma",
  "dob": "October 22, 1993",
  "role": "Wicket Keeper",
  "batting_style": "Right Handed",
  "bowling_style": "-",
  "teams": [
    "India",
    "Central Zone",
    "Royal Challengers Bengaluru",
    "Punjab Kings",
    "Mumbai Indians",
    "Vidarbha",
    "VCA Red",
    "NECO Master Blaster"
  ],
  "bio": "Jitesh Sharma is a wicket-keeper batter who has grabbed the attention of both fans and selectors with some attacking strokeplay. Born on 22nd October 1993 in Amravati, situated in the Vidarbha region of Maharashtra, he made his mark early with a productive outing in the 2012-13 Cooch Behar Trophy. This paved his way into the Vidarbha senior side, and he soon made his domestic debut. The start of 2014 saw him play his first List A game against Rajasthan in the Vijay Hazare Trophy, and the following month he made his T20 debut against Uttar Pradesh in the Syed Mushtaq Ali Trophy. He made an instant impact in the shortest format of the game by scoring an attacking half-century in his first outing. For two seasons he continued to play limited-overs cricket and eventually made his first-class debut towards the end of 2015 against Odisha in the Ranji Trophy. However, he did not have a good red-ball tournament, and his performance that season made it evident that his forte was white-ball cricket. Jitesh ended the 2015-16 Syed Mushtaq Ali Trophy as the third-highest run-scorer in the tournament with 343 runs under his belt at a strike rate of 143.51, and it included one century along with two fifties. He was recruited by the Mumbai franchise for the 2016 Indian Premier League on the back of his domestic performances, but he did not play a single game. He continued to perform well in the domestic limited-overs competition, and his big break came when he was picked by the Punjab franchise for the 2022 Indian Premier League at his base price. His performances that year for Punjab were noticed, and he was retained by his side for the 2023 edition. He showcased his power-hitting skills for Punjab, scoring 309 runs in 14 games in the 2023 Indian Premier League season, and also for the national side ever since making his debut at the Asian Games in 2023. Jitesh could not replicate his stellar 2023 IPL performances in the 2024 season, leading to his release by Punjab ahead of the mega auction. However, Bengaluru saw potential in him and decided to invest, securing his services for the 2025 season.",
  "nationality": "India",
  "career_span": {
    "IPL": "2022-2025"
  }
}