{
  "id": "pprofile_70155",
  "type": "player_bio",
  "player": "Yash Dayal",
  "full_name": "Yash Dayal",
  "dob": "December 13, 1997",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Left-arm medium fast",
  "teams": [
    "India",
    "India A",
    "India B",
    "Rest of India",
    "Royal Challengers Bengaluru",
    "Uttar Pradesh",
    "Gujarat Titans",
    "Gaur Gorakhpur Lions",
    "Lucknow Falcons",
    "Team B"
  ],
  "bio": "Originating from Allahabad, Yash Dayal is a left-arm fast bowler. His cricketing journey ignited through his involvement in age-group cricket for Uttar Pradesh. In 2018, Dayal earned his stripes at the senior level when he made his debut in List A cricket for Uttar Pradesh. Shortly after, he swiftly transitioned into the first-class arena for the state team. February 2019 marked his debut in T20 cricket during the 2018-19 Syed Mushtaq Ali Trophy, facing off against Maharashtra. His prowess in the T20 format garnered significant attention from Indian Premier League franchises during the 2022 auction. Securing a spot with one of the two new entrants, Gujarat, for the 2022 season, Dayal showcased his talent by claiming 9 wickets across 11 matches, contributing to Gujarat's title victory. Retained for the 2023 edition, his journey took an unexpected turn during a match against Kolkata, where he found himself defending 28 runs in the final over. Despite his efforts, Rinku Singh's onslaught, smashing five consecutive sixes, led to a heart-breaking loss for Gujarat. Subsequently, Dayal's appearances were limited, concluding the tournament with only two wickets to his name. Ahead of the 2024 Indian Premier League season, Bengaluru secured Dayal's services after his release from Gujarat. Determined to leave the setbacks of the past season behind, the left-arm pacer made a resounding impact for Bengaluru. With 15 wickets to his name, Dayal finished the season as the joint-most wicket-taker for the side, playing a pivotal role in helping the side reach the playoffs, though Bengaluru could not go all the way. As a result, it came as no surprise when Bengaluru decided to retain the left-arm speedster for the 2025 season.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "",
    "IPL": "2022-2025"
  }
}