{
  "id": "pprofile_57792",
  "type": "player_bio",
  "player": "Kyle Mayers",
  "full_name": "Kyle Rico Mayers",
  "dob": "September 8, 1992",
  "role": "All-Rounder",
  "batting_style": "Left Handed",
  "bowling_style": "Right-arm medium",
  "teams": [
    "West Indies",
    "Barbados Pride",
    "Warwickshire",
    "West Indies A",
    "Windward Islands Volcanoes",
    "Combined Campuses and Colleges",
    "West Indies Under-19",
    "West Indies Cricket Presidents XI",
    "Rangpur Riders",
    "Barbados Royals",
    "Saint Lucia Kings",
    "St Kitts and Nevis Patriots",
    "Islamabad United",
    "West Indians",
    "Surrey Jaguars",
    "Team Abu Dhabi",
    "Kandy Falcons",
    "Fortune Barishal",
    "Lucknow Super Giants",
    "Clarke Road United",
    "Durban's Super Giants",
    "Abu Dhabi Knight Riders",
    "Guardians",
    "Seattle Orcas",
    "Chicago CC",
    "Nuwara Eliya Kings"
  ],
  "bio": "Kyle Mayers is an all-rounder hailing from Barbados. He is a left-hand batter who possesses excellent ability to bowl useful medium-pace bowling. Mayers began his professional cricket way back in 2011. He played his first List-A game for Combined Campuses and Colleges, and the following year, he played his first T20 game for them as well. However, he only came into the limelight when he was selected to play for Barbados in the Regional Super50 tournament in 2019-20. Mayers smashed a solid 113 while batting in the middle order against Leeward Islands and ended as one of the top run-scorers for Barbados in that season. Kyle Mayers was part of the Caribbean Premier League since 2013, but once more the season of 2020 was when he displayed his power-hitting abilities while playing for Barbados Tridents. Owing to his impressive performances, Mayers was handed his first opportunity to play for West Indies. In November 2020, he made his T20I debut against New Zealand. In the following month, Kyle represented West Indies in the 50-over format, and received his Test cap as well in February 2021 against Bangladesh. Kyle had a perfect start to his Test career as he notched up a double ton, making him the sixth player to smash a double century on debut. Since then, Mayers has been a regular member of West Indies' squad across all the formats.",
  "nationality": "West Indies",
  "career_span": {
    "Test": "2021-2023",
    "ODI": "2021-2023",
    "IPL": "2023-2023"
  }
}