{
  "id": "pprofile_57871",
  "type": "player_bio",
  "player": "Mark Wood",
  "full_name": "Mark Andrew Wood",
  "dob": "January 11, 1990",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm fast",
  "teams": [
    "England",
    "Durham",
    "England XI",
    "Chennai Super Kings",
    "England Lions",
    "North",
    "London Spirit",
    "Team Morgan",
    "Lucknow Super Giants",
    "Dubai Capitals"
  ],
  "bio": "Mark Andrew Wood, the English right-arm fast bowler, has been a vital cog in England's bowling machinery, known for his blistering pace and ability to deliver under pressure. Despite a career often interrupted by injuries, Wood has consistently bounced back, showcasing his resilience and determination. His journey from Durham to the international stage is a testament to his hard work and talent. Wood's ability to bowl consistently in the high 140s km/h makes him a formidable opponent, and his knack for picking crucial wickets has often turned matches in England's favor. Wood's career highlights include his pivotal role in England's 2019 World Cup triumph, where he was instrumental in the team's historic victory, taking 18 wickets. His Test debut came in 2015 against New Zealand, and he has since been a regular feature in England's Test setup, despite fitness challenges. In the 2023 Ashes series, Wood's fiery spell of 7 wickets in a match and handy runs with the bat earned him the Player of the Match award, highlighting his all-round capabilities. Wood's bowling style is characterized by his ability to generate pace and bounce, making him a potent threat on any surface. His adaptability to different pitch conditions and his skill in swinging the ball both ways have made him a valuable asset for England. With 119 Test wickets, including five five-wicket hauls, Wood has proven his mettle in the longest format of the game. His ODI record, with 77 wickets in 66 matches at an average of 39.46, may not stand out, but he has often proven to be a wicket-taking option when needed. In the T20 format, Wood has been a key player for England, with 50 wickets in 35 matches. His standout performance in the 2022 T20 World Cup, where he took 3/26 against Sri Lanka, was a highlight of the tournament. Wood's ability to dismiss top-order batsmen with his pace and accuracy has been a game-changer for England in crucial matches. Wood's IPL journey has seen him play for Chennai Super Kings and Lucknow Super Giants. In the 2023 IPL season, he picked up 11 wickets in just four matches, including a five-wicket haul against Delhi Capitals, before being pulled out by the ECB. His performances in franchise cricket have further cemented his reputation as a world-class fast bowler.",
  "nationality": "England",
  "career_span": {
    "Test": "2015-2024",
    "ODI": "2015-2025",
    "IPL": "2018-2023"
  }
}