{
  "id": "pprofile_65432",
  "type": "player_bio",
  "player": "Mahipal Lomror",
  "full_name": "Mahipal Krishan Lomror",
  "dob": "November 16, 1999",
  "role": "All Rounder",
  "batting_style": "Left Handed",
  "bowling_style": "Slow left-arm orthodox",
  "teams": [
    "Central Zone",
    "India Red",
    "Royal Challengers Bengaluru",
    "Delhi Capitals",
    "Rajasthan Royals",
    "India Under-19",
    "Rajasthan",
    "Gujarat Titans",
    "Shekhawati Soldiers Sikar"
  ],
  "bio": "Mahipal Lomror, hailing from Nagaur in Rajasthan, is an explosive all-rounder who initially specialized as a batter before adding left-arm spin to his arsenal. Inspired by the legendary Adam Gilchrist, Lomror's fearless approach to batting is evident in his game. He rose through the ranks representing Rajasthan at the Under-16 and Under-19 levels across different formats. Lomror made his mark on the national stage at a tender age of 16, featuring for India in the U-19 ICC Cricket World Cup 2016, where he showcased his talent. Delhi acquired him at the 2016 Indian Premier League auction, marking his entry into professional cricket. Subsequently, he debuted in first-class cricket for Rajasthan during the 2016-17 Ranji Trophy season. His versatility was further displayed as he made his T20 and List-A debuts for Rajasthan in 2017. During the 2017-18 Ranji Trophy season, Lomror emerged as one of the leading wicket-takers for Rajasthan, solidifying his all-round capabilities. After being released by Delhi, Lomror found a new home in Rajasthan at the 2018 Indian Premier League auction. Although opportunities were limited, he continued to showcase his potential. Bengaluru showed faith in him at the 2022 auction, providing him with a longer stint. The 2023 edition witnessed Lomror playing a more significant role for Bengaluru, featuring in the playing XI for 13 out of 14 games. In the 2023 domestic season, he displayed glimpses of promise for his state side Rajasthan. In the 2024 Ranji Trophy, Lomror showcased his exceptional batting skills, scoring a monumental 300 for Rajasthan against Uttarakhand. This remarkable feat earned him another opportunity with RCB later that year, where he managed to score 125 runs from 10 matches. Ahead of the 2025 IPL season, RCB released him, and during the bidding, both RCB and Rajasthan Royals vied for his services. However, it was Gujarat Titans who ultimately secured him for a staggering INR 1.70 crores.",
  "nationality": "India",
  "career_span": {
    "IPL": "2018-2024"
  }
}