{
  "id": "pprofile_68072",
  "type": "player_bio",
  "player": "Aaron Hardie",
  "full_name": "Aaron Mark Hardie",
  "dob": "January 7, 1999",
  "role": "All-Rounder",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm medium fast",
  "teams": [
    "Australia",
    "Australia A",
    "Surrey",
    "Punjab Kings",
    "Western Australia",
    "Australia Under-19",
    "Perth Scorchers",
    "Prime Ministers XI",
    "Western Australia XI",
    "Texas Super Kings"
  ],
  "bio": "Aaron Mark Hardie is an Australian international cricketer known for his contributions as a right-handed all-rounder who bowls right-arm medium-fast. Born in England, Hardie moved to Perth, Australia, where he developed his cricketing skills and rose through the ranks to represent the Australian national team in both ODI and T20I formats. In January 2018, Hardie was selected for Australia’s squad for the Under-19 Cricket World Cup but was ruled out of the tournament due to injury. Later that year, he made a significant impression while playing for the Cricket Australia XI against India in a four-day match at the Sydney Cricket Ground. In that game, he dismissed India’s captain Virat Kohli and ended with figures of four wickets for 50 runs, while also contributing 86 runs with the bat. This performance highlighted his potential as an impactful all-rounder. Hardie made his Twenty20 debut on 9 January 2019 for the Perth Scorchers in the Big Bash League, helping his team secure a six-wicket win. He followed this with his first-class debut for Western Australia in March 2019 during the Sheffield Shield season. In October of the same year, he played his first List A match for Western Australia in the Marsh One-Day Cup. In March 2020, Hardie achieved a milestone by scoring his maiden century in first-class cricket. Two years later, he played a pivotal role in the final of the 2021–22 Sheffield Shield season, where he scored an unbeaten 174, leading Western Australia to victory in the tournament. In June 2022, Hardie signed with Surrey to participate in the T20 Blast and County Championship in England. His international career gained momentum in August 2023 when he was called up to the Australian squad for both the T20I and ODI series against South Africa. He made his T20I debut on 30 August 2023 in the first match of the three-game series and followed it with his ODI debut on 9 September 2023 during the second match of the five-game series. Aaron Mark Hardie has established himself as a promising all-rounder in the cricketing world with consistent performances at both domestic and international levels. Hardie was picked up by Punjab for the 2025 IPL season. He was also selected in the Australia squad for the 2025 Champions Trophy. As he continues to grow and refine his game, he is poised to play an integral role in shaping the future of Australian cricket.",
  "nationality": "Australia",
  "career_span": {
    "Test": "",
    "ODI": "2023-2025",
    "IPL": ""
  }
}