{
  "id": "pprofile_57028",
  "type": "player_bio",
  "player": "Sean Abbott",
  "full_name": "Sean Anthony Abbott",
  "dob": "February 29, 1992",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm fast medium",
  "teams": [
    "Australia",
    "Australia A",
    "Derbyshire",
    "Surrey",
    "Royal Challengers Bengaluru",
    "New South Wales",
    "Australia Under-19",
    "Australian XI",
    "Sydney Sixers",
    "Sydney Thunder",
    "Sunrisers Hyderabad",
    "National Performance Squad",
    "Quetta Gladiators",
    "Prime Ministers XI",
    "Montreal Tigers",
    "Birmingham Phoenix",
    "Manchester Originals"
  ],
  "bio": "Sean Abbott, an accomplished Australian cricketer, hails from Windsor, New South Wales. His journey into professional cricket began in the local leagues, playing for Baulkham Hills Cricket Club, before advancing to grade cricket with Parramatta District. Completing his schooling at Gilroy College in Castle Hill, Abbott's talents were clear from an early age, and he quickly established himself as a promising all-rounder. A right-handed batter and bowler, Abbott’s career would ultimately take him to the international stage, representing Australia in white-ball cricket. He was part of the Australian team that triumphed in the 2023 Cricket World Cup. Abbott's introduction to professional cricket came in October 2010 when he made his List A debut for New South Wales in the Ryobi One-Day Cup against Western Australia. Although he didn’t get the chance to bat or bowl in his first outing, it was the start of a long and steady rise. His first-class debut came a year later, when he faced South Australia at the Adelaide Oval, and it marked a significant milestone in his career. Abbott’s performances in Sydney Grade Cricket for Parramatta and Sydney University were also noteworthy, but it was his time with the Sydney Thunder in the Big Bash League during the 2011–12 and 2012–13 seasons that gave him national recognition. His move to the Sydney Sixers in 2013–14 saw his career soar further, as he played an instrumental role in the team’s success. Abbott’s most remarkable BBL performance came during the 2016–17 season when he took 20 wickets in 10 games, earning him the Player of the Tournament award alongside his teammate Daniel Hughes. However, Abbott's career was marked by an event that would alter his life and his outlook on the game. During a Sheffield Shield match in November 2014, a bouncer he bowled struck Phillip Hughes on the neck, leading to Hughes' tragic passing two days later. The incident left the cricket world in shock and deeply affected Abbott. Despite the immense emotional toll, he displayed immense strength and resilience by returning to training shortly before Hughes' funeral. Remarkably, Abbott made his comeback to the field just weeks later, taking 6/14 in a Sheffield Shield match against Queensland, a performance that underscored his unwavering determination. This display of resilience led to Abbott receiving the prestigious Bradman Young Cricketer of the Year award in 2015, and his consistent performances led to his selection by the Bengaluru franchise for the 2015 IPL season. Abbott’s continued excellence in domestic cricket cemented his position as one of Australia’s most dependable cricketers. He was pivotal in New South Wales' victory in the 2017–18 JLT One-Day Cup, taking the most wickets for the team. His performances in the 2019–20 Marsh One-Day Cup earned him a spot on the list of players to watch, and in November 2020, he celebrated a personal milestone by scoring his maiden first-class century during the Sheffield Shield season. This achievement showcased his all-around talent and further strengthened his reputation. Abbott's international career, which began with his T20I debut for Australia in 2014, saw significant development. In 2019, after a five-year absence from the national team, Abbott made a stellar return to the ODI squad, marking his comeback with impressive figures of 2/14 against Pakistan. His return to international cricket marked the beginning of a new chapter in his career, and by 2020, Abbott was included in Australia’s squad for a series against England. His consistency in both domestic and international formats earned him a place in several important squads over the following years. In 2022, Abbott was selected for the ODI series against New Zealand and Zimbabwe and also played in the T20I series against India. His form continued to rise, and in the 2023 World Cup, Abbott scored his maiden half-century in an ODI, contributing 54 runs off 36 balls against India. He also made his World Cup debut against Bangladesh, recording figures of 2/61 in a crucial victory. Through every phase of his career, Sean Abbott has displayed exceptional skill, resilience, and dedication to the sport. From rising through the ranks of domestic cricket to representing Australia on the global stage, his journey has been one of triumph over adversity. Abbott’s ability to overcome personal challenges and return stronger than ever has solidified his place as one of Australia’s most respected cricketers. As he continues to represent his country on the international stage, his legacy as a committed and versatile all-rounder is only growing.",
  "nationality": "Australia",
  "career_span": {
    "Test": "",
    "ODI": "2014-2025",
    "IPL": "2015-2022"
  }
}