{
  "id": "pprofile_56961",
  "type": "player_bio",
  "player": "Gulbadin Naib",
  "full_name": "Gulbadin Naib",
  "dob": "June 4, 1991",
  "role": "All-Rounder",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm medium fast",
  "teams": [
    "Delhi Capitals",
    "Afghanistan",
    "Afghan Cheetas",
    "Sylhet Strikers",
    "Sheikh Jamal Dhanmondi Club",
    "Dhaka Capitals",
    "Afghanistan Emerging",
    "Mis-e-Ainak Region",
    "Amo Region",
    "Boost Region",
    "Band-e-Amir Dragons",
    "Boost Defenders",
    "Mis-e-Ainak Knights",
    "Bangla Tigers",
    "Pakhtoons",
    "Balkh Legends",
    "Delhi Bulls",
    "World Legends 11",
    "Pamir Legends",
    "Dubai Capitals",
    "Seattle Orcas",
    "Cape Town Samp Army",
    "Mahipar Stars",
    "Ajman Bolts"
  ],
  "bio": "Gulbadin Naib, a name synonymous with Afghan cricket, has been a pivotal figure in the rise of Afghanistan on the international stage. Known for his all-round capabilities, Naib has been a crucial asset for his team, both with the bat and the ball. His journey began in the 2008 World Cricket League Division Five, where he showcased his potential against Japan. Over the years, Naib has accumulated impressive stats, including 1,314 runs in ODIs with a batting average of 20.21 and 73 wickets with a bowling average of 35.86. His standout performance came in 2019 against Ireland, where he took 6 wickets for 43 runs, marking the third-best figures by an Afghan bowler in ODIs. Naib's leadership qualities came to the fore when he was appointed as Afghanistan's ODI captain in 2019. Although his tenure was brief, he led the team with passion and determination. His ability to inspire his teammates and lead by example has been acknowledged by many in the cricketing fraternity. Naib's performance in the 2024 ICC T20 World Cup was notable, where he took 4 wickets for 20 runs against Australia, showcasing his knack for delivering in high-pressure situations. In the IPL, Naib has played for Delhi Capitals, where he made a mark with his all-round performances. His stint in the IPL was a small one and he wasn't able to make much impact but showed glimpses of his talent. Naib's ability to adapt to different formats and conditions has been a key factor in his success. His recent performances in the International League T20, where he scored 78 runs against Desert Vipers, highlight his continued relevance in the T20 format. Looking ahead, Naib faces the challenge of maintaining his form and fitness as Afghanistan prepares for the ICC Champions Trophy 2025. His experience and leadership will be crucial as Afghanistan aims to make a mark on the global stage. With his all-round abilities and strategic acumen, Naib is expected to play a pivotal role in Afghanistan's campaign. Gulbadin Naib's journey is a testament to his resilience and dedication to the sport. As he continues to represent Afghanistan on the international stage, his contributions both on and off the field remain invaluable to the growth of cricket in the country.",
  "nationality": "Afghanistan",
  "career_span": {
    "Test": "",
    "ODI": "2011-2025",
    "IPL": "2024-2024"
  }
}