{
  "id": "pprofile_63715",
  "type": "player_bio",
  "player": "Abhinav Manohar",
  "full_name": "Abhinav Manohar Sadarangani",
  "dob": "September 16, 1994",
  "role": "Batsman",
  "batting_style": "Right Handed",
  "bowling_style": "Leg break googly",
  "teams": [
    "Karnataka",
    "Sunrisers Hyderabad",
    "Southern Champs",
    "Mangalore United",
    "Belagavi Panthers",
    "Shivamogga Lions",
    "Bijapur Bulls",
    "Ballari Tuskers",
    "Hubli Tigers",
    "Gujarat Titans"
  ],
  "bio": "Abhinav Manohar is a hard-hitting middle-order batter from Karnataka. His breakthrough came in the 2021–22 Syed Mushtaq Ali Trophy, where he played a stunning knock of 70 not out in his debut T20 match. It was clear from the start that he had a special talent for big-hitting. Manohar’s ability to clear boundaries with ease made him a valuable asset in limited-overs cricket. In 2022, Gujarat saw his potential and bought him for ₹2.60 crore in the Indian T20 League auction. Though he played limited matches over three seasons, his reputation as a powerful middle-order hitter kept growing. He didn’t always get enough time at the crease, but whenever he did, he showed glimpses of his attacking game. His performances in domestic cricket proved why teams were still interested in him. In the 2024 Maharaja T20 Trophy, he scored 507 runs at a strike rate of 196.51. The most eye-catching part of his game was his ability to hit sixes, he smashed 52 sixes in just 10 matches, more than any other player in the tournament. His incredible six-hitting ability made IPL teams sit up and take notice once again. When the Indian Premier League 2025 auction arrived, there was a lot of excitement around Manohar. His name sparked an intense bidding war, with multiple teams fighting to get him. Eventually, Hyderabad won the battle, buying him for ₹3.20 crore. This made him one of the most expensive uncapped players in the auction. SRH saw in him a potential game-changer who could provide firepower in the middle order.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "",
    "IPL": "2022-2025"
  }
}