{
  "id": "pprofile_64219",
  "type": "player_bio",
  "player": "Aiden Markram",
  "full_name": "Aiden Kyle Markram",
  "dob": "October 4, 1994",
  "role": "All-Rounder",
  "batting_style": "Right Handed",
  "bowling_style": "Off break",
  "teams": [
    "South Africa",
    "Durham",
    "Hampshire",
    "Northerns",
    "South Africa A",
    "South African Invitation XI",
    "Titans",
    "Punjab Kings",
    "South Africa Under-19",
    "Sunrisers Hyderabad",
    "Nelson Mandela Bay Stars",
    "Paarl Rocks",
    "AB’s Eagles",
    "Lucknow Super Giants",
    "Sunrisers Eastern Cape",
    "Texas Super Kings"
  ],
  "bio": "Aiden Markram can introduce himself as the first South African captain to lift the World Cup. He achieved this feat by leading the U-19 team in a successful campaign in 2014. Markram began his First-class career in 2014 by playing for Northerns against South Western Districts. He was also a part of the Northerns team that lifted the Africa Cup T20 in 2015. In May 2017, Aiden was awarded as the Domestic Newcomer of the Year by Cricket South Africa. Seeing Markram's talent, he was drafted in South Africa's Test team and he made his debut in 2017 against Bangladesh. Aiden had a fantastic start to his Test career, scoring 97 in the first Test and then getting his maiden Test ton in the second. Soon, Markram was included in the ODI side as well and he scored a half-century in his very first outing in the South African colours. In February of 2018 when India was touring South Africa, the regular skipper, Faf du Plessis, suffered a finger injury and Aiden was given the charge of the team in his absence ahead of Quinton de Kock, JP Duminy and David Miller. He was 23 years old at that time and became the second youngest player to lead South Africa after Graeme Smith. An aggressive batter by nature, Markram was seen as the replacement for AB de Villiers and he has done justice to his selection. His classic batting display in all formats has forced the cricket community to take note of him and with age on his side, he can be the next big thing in South African cricket. In the last few years, Markram has become a mainstay of the South African national side in all three formats of the game and has been a prolific run-scorer wherever he has played. He also had a stellar 2022 season and was named as the captain of the Hyderabad franchise for the 2023 Indian Premier League season after having captained the sister team in the inaugural edition of SA20, where he led the side to the trophy. However, Hyderabad had a slim outing in the 2023 season and Markram himself struggled with the bat. He was able to get back into form via international cricket and had a good outing with the national team as South Africa reached the semi-final of the ICC Men's Cricket World Cup in 2023. He also led Sunrisers Eastern Cape to back-to-back titles in the SA20 but unfortunately, he was stripped of captaincy by Hyderabad due to the arrival of Pat Cummins. In May 2024, Markram was named captain of South Africa's squad for the 2024 ICC Men's T20 World Cup. While he had a relatively quiet tournament with the bat, he etched his name in history by becoming the first-ever Proteas captain to lead the team to the final of a Men's T20 World Cup. South Africa’s spirited campaign brought them within touching distance of glory, but their dream was shattered in the final as they fell short against a dominant Indian side.",
  "nationality": "South Africa",
  "career_span": {
    "Test": "2017-2025",
    "ODI": "2017-2025",
    "IPL": "2021-2025"
  }
}