{
  "id": "pprofile_66158",
  "type": "player_bio",
  "player": "Nuwan Thushara",
  "full_name": "Ilandari Dewage Nuwan Thushara",
  "dob": "August 6, 1994",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm medium fast",
  "teams": [
    "Sri Lanka",
    "Badureliya Sports Club",
    "Colombo Cricket Club",
    "Sri Lanka Emerging",
    "Sri Lanka A",
    "Sinhalese Sports Club",
    "Royal Challengers Bengaluru",
    "Mumbai Indians",
    "St Kitts and Nevis Patriots",
    "Colombo",
    "Quetta Gladiators",
    "Dambulla",
    "Deccan Gladiators",
    "Dambulla Sixers",
    "Galle Marvels",
    "Jaffna Kings",
    "Fortune Barishal",
    "SLC Blues",
    "SLC Greens",
    "Chennai Brave Jaguars",
    "MI Cape Town",
    "Dubai Capitals",
    "Lumbini All Stars",
    "Jaffna Titans"
  ],
  "bio": "Nuwan Thushara, often compared to Lasith Malinga for his slingy bowling action, is a Sri Lankan fast bowler renowned for his sharp pace, deceptive variations, and ability to deliver deadly yorkers. His consistent performances in domestic and franchise T20 leagues have made him a sought-after asset in the shortest format of the game. Thushara made his T20 debut in 2016, but it was in 2022 that he truly broke through, earning his maiden call-up to Sri Lanka’s T20I squad. He quickly made an impact on the international stage, particularly excelling in death bowling. His strong performances in the Lanka Premier League led to opportunities in global T20 competitions, including the Abu Dhabi T10 League, where he further sharpened his skills. Since making his T20I debut against Australia in 2022, one of the standout moments of Thushara's career came in 2024 when he claimed a five-wicket haul, including a hat-trick, against Bangladesh. His impressive form earned him an IPL contract with Mumbai for the 2024 season, where he made a decent impact and gained valuable experience alongside elite pacers. Despite Sri Lanka's early exit in the 2024 T20 World Cup, Thushara was a rare bright spot in the bowling department. Released by Mumbai ahead of the 2025 IPL auction, he found a new home with Bengaluru, who secured his services for INR 1.60 crore.",
  "nationality": "Sri Lanka",
  "career_span": {
    "Test": "",
    "ODI": "",
    "IPL": "2024-2025"
  }
}