{
  "id": "pprofile_48816",
  "type": "player_bio",
  "player": "Chris Morris",
  "full_name": "Christopher Henry Morris",
  "dob": "April 30, 1987",
  "role": "All Rounder",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm fast medium",
  "teams": [
    "South Africa",
    "Hampshire",
    "North West Dragons",
    "South Africa A",
    "South African Invitation XI",
    "Surrey",
    "Titans",
    "Royal Challengers Bengaluru",
    "Chennai Super Kings",
    "Delhi Capitals",
    "Rajasthan Royals",
    "Mumbai Indians",
    "DP World Lions",
    "Sydney Thunder",
    "Barbados Royals",
    "St Kitts and Nevis Patriots",
    "Durban Qalandars",
    "Nelson Mandela Bay Giants",
    "Team Abu Dhabi",
    "KG’s Kingfishers",
    "South Africa Champions"
  ],
  "bio": "A talented all-rounder from Pretoria, Chris Morris plays for the Lions in South Africa's domestic setup. He gave standout performances in the 2012 domestic league in South Africa, fetching 21 wickets in 12 games, and his strike-rate in the lower order with the bat was around 200. That prompted the selectors to name him in the 15-man squad for South Africa's unofficial tri-series in Zimbabwe, which included Bangladesh as well. Morris’s role as the spearhead of the Lions attack became an important development for the team and in 2012; he was named in their T20 squad for the Champions League T20 to be held in their home country. Later that year, he was called up to the T20I squad that resulted in his international debut against New Zealand. Morris had a fruitful debut as he picked up 2 wickets in his maiden outing. The following year, he was one of the most talked-about players in the IPL auction. Morris was bought by the Chennai Super Kings for the tournament's sixth season. He played a vital role for them as the team reached the final. Morris was one of the biggest buys in the Indian T20 League as he became a part of Delhi in 2016. The South African lived up to the billing as he finished as the leading wicket-taker for them. The international career for Morris has not progressed the way he would have liked to. Injuries have hampered him but Chris continued to work hard. He nearly missed out on the 2019 World Cup squad but the injury to Anrich Nortje meant that he was included. During the auction for the 13th edition of the Indian T20 League, Morris was snapped by Bangalore for INR 10 crore and in the next edition, he became the costliest player in the history of the League as Rajasthan bought him for a whopping 16.25 cr INR.",
  "nationality": "South Africa",
  "career_span": {
    "Test": "2016-2017",
    "ODI": "2013-2019",
    "IPL": "2013-2021"
  }
}