{
  "id": "pprofile_9844",
  "type": "player_bio",
  "player": "Yuzvendra Chahal",
  "full_name": "Yuzvendra Singh Chahal",
  "dob": "July 23, 1990",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Leg break googly",
  "teams": [
    "India",
    "India A",
    "Kent",
    "Northamptonshire",
    "North Zone",
    "Royal Challengers Bengaluru",
    "Punjab Kings",
    "Rajasthan Royals",
    "Mumbai Indians",
    "Haryana"
  ],
  "bio": "The mind of a chess player and the skill of a leg spinner - That's a dangerous combination that Yuzvendra Chahal possesses. Before taking cricket as the full-time profession, Chahal used to represent India internationally in chess at youth levels. Chahal started playing for Haryana from a very young age before going on to represent them in the domestic circuit. His exploits in the domestic circuit earned him a contract from the Mumbai franchise for the 2011 edition of the Indian Premier League. In three years with the franchise, Chahal only played in one game in the competition and his best moment came during the 2011 Champions League T20 final against Bengaluru as he picked up 2 for 9 in 3 overs, helping Mumbai win the trophy. In the 2014 auction ahead of the Indian Premier League, Chahal was bought by the Bengaluru franchise for his base price of INR 10 lakhs. Chahal would stay with the franchise till the 2021 season and would go on to become one of the premier spinners in the tournament that also helped in earning a spot in the national team in 2016. He was released by the franchise ahead of the 2022 mega auction in February and was bought by the Rajasthan franchise. He formed a potent alliance with Ravichandran Ashwin in that edition and also picked up a hat-trick in one of the games. Chahal’s first taste of international cricket came when he was named in the 14-man squad to tour Zimbabwe in 2016. He made his international debut in an ODI match against Zimbabwe at the Harare Sports Club on June 11, 2016. In the second match, Chahal took three wickets for just 25 runs and led his side to victory. That earned him his first Player of the Match award in international cricket. On the same tour, Chahal made his debut in the shortest format of the game as well. Soon Chahal started to settle down in his role in the national team, and then came a big moment for him when he became the first bowler for India to take a five-wicket haul in T20Is, ending with figures of 6/25 against England. Later on, Chahal was named in India's squad for the 2019 Cricket World Cup. He ended his World Cup campaign with 12 wickets. In the last month of 2020, Chahal booked his name in the history books when he replaced Ravindra Jadeja as a concussion substitute in a T20I game against Australia and went on to win the Player of the Match award - the first concussion substitute to achieve this feat in an international cricket fixture. Like most cricket players, Chahal also experienced a dip in form and was left out of the Indian squad for the 2021 T20 World Cup. In 2022, Chahal turned things around after joining Rajasthan in the IPL. He pikced up a hat-trick and a five-wicket haul against Kolkata and his performances earned him a call up to the Indian squad for the T20 World Cup. In 2024, he became the first player in IPL history to achieve 200 wickets and was once again named in the T20 World Cup squad where India lifted the title. Chahal was bought for a whopping INR 18 crore by Punjab, where he will be a key figure to help the team achieve success.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "2016-2023",
    "IPL": "2013-2025"
  }
}