{
  "id": "pprofile_5221",
  "type": "player_bio",
  "player": "Umesh Yadav",
  "full_name": "Umeshkumar Tilak Yadav",
  "dob": "October 25, 1987",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm fast",
  "teams": [
    "India",
    "Central Zone",
    "Essex",
    "India A",
    "India B",
    "India Blue",
    "Indian Board Presidents XI",
    "India Red",
    "Rest of India",
    "Royal Challengers Bengaluru",
    "Kolkata Knight Riders",
    "Delhi Capitals",
    "Middlesex",
    "Vidarbha",
    "Indians",
    "Gujarat Titans"
  ],
  "bio": "A naturally well-built right-arm pacer, Umesh Yadav had to toil hard to realize his dreams of playing cricket for the Indian national team. Born on 25th October 1987 in Nagpur in the state of Maharashtra, Umesh initially applied to join the army and even tried to become a police officer. However, after his failed attempts to join the services, he tried his hand at cricket and after a long grind began to taste some well-deserved success. Umesh went to the non-glamourous Vidarbha team to start his professional journey and made his Ranji debut in 2008 where he took a four-fer and finished the season claiming 20 wickets at an average of 14.60. He impressed everyone with his ability to bowl consistently at 140 clicks and he could get the ball to move both ways. He went on to make his List A and T20 debut for Vidarbha in February and October 2009 respectively. His impressive show in the domestic circuit earned him a spot in the Delhi squad for the 2010 Indian Premier League. The right-arm speedster made his international debut while playing an ODI against Zimbabwe and although he failed to impress, was named in the squad for the following series against South Africa. In 2011, Umesh received his Test cap against West Indies and he immediately left a mark taking 9 wickets in his first two matches. Courtesy of some notable showing, he was selected in India’s Test squad for their tour to Australia in December 2011 where he picked 14 wickets in an otherwise hapless series and proved to be a ray of light through the darkness for the depleted Indian pace bowling unit. After being out of cricket for most of 2012 due to injury, Umesh Yadav was back into the international fold for the ICC Champions Trophy in 2013 on English shores. He was a delight to watch in England as he used the swing and pacy conditions to a great effect but the bouts of inconsistency didn't help his case for a permanent spot in the playing XI. He is a rhythm bowler who can be lethal when he finds it and his performances in Australia and New Zealand during the 2015 edition of the World Cup were one of his best. He extracted pace and bounce off the tracks and though India failed to retain their title, Umesh ended the competition as India's best bowler with 18 wickets which was the third most overall. Post the World Cup, he found his chances were limited and soon faded out of the national reckoning in white-ball cricket. He continued to ply his trade domestically and he was a steady performer in the Indian Premier League. After his stint with the Delhi franchise in 2013, Umesh was bought by the Kolkata side and was their frontline bowler till 2017. He was then roped in by the Bengaluru team ahead of the 2018 edition and had a stellar first season with them claiming 20 wickets. After three seasons in Bangalore, Umesh went back to Delhi where his Indian Premier League journey began but did not play a single game that season and was released ahead of the 2022 mega auction. This allowed the Kolkata franchise to buy him for INR 2 crore and he proved his worth by claiming 16 wickets. His performance enabled Umesh to make a comeback into white-ball cricket in the T20I series against Australia. While Umesh missed out on the 2022 T20 World Cup, he remained a key part of India’s Test pace attack in Jasprit Bumrah’s absence and featured in the 2023 World Test Championship final against Australia. However, his IPL 2023 stint with Kolkata was underwhelming across eight games before being released. Picked up by Gujarat for the 2024 season, Yadav endured another quiet campaign. Later that year, he sustained a leg injury during a Syed Mushtaq Ali Trophy game, which led to surgery. With doubts over his fitness and recovery timeline, he went unsold at the 2025 IPL auction.",
  "nationality": "India",
  "career_span": {
    "Test": "2011-2023",
    "ODI": "2010-2018",
    "IPL": "2010-2024"
  }
}