{
  "id": "pprofile_124649",
  "type": "player_bio",
  "player": "Madhav Tiwari",
  "full_name": "Madhav Tiwari",
  "dob": "September 28, 2003",
  "role": "All Rounder",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm medium fast",
  "teams": [
    "Delhi Capitals",
    "Bhopal Leopards"
  ],
  "bio": "Madhav Tiwari’s journey from a small village in Mauganj, Madhya Pradesh, to the Indian Premier League (IPL) is a story of dedication, hard work, and passion for cricket. He is an all-rounder who bats right-handed and bowls medium-fast. Madhav started playing cricket at the young age of eight. His talent was first recognized by former Ranji player Kushal Chourey, who encouraged him to take the game seriously. Under the guidance of Amay Khurasiya’s Cricket Academy, Madhav polished his skills and soon made his mark in age-group cricket. His rise in cricket was swift. He played for Indore Division’s Under-15 and Under-18 teams, where he impressed everyone with his all-round abilities. As the captain of the Under-18 team, he led from the front, scoring a double century in a crucial match, helping his team lift the trophy. In the 2021-22 season, Madhav was the highest wicket-taker in the Senior Division MK Bhaya Trophy, proving his skills as a fast-bowling all-rounder. Madhav continued to shine in domestic tournaments. In 2024, he played for the Bhopal Leopards in the Madhya Pradesh T20 League, where he took three wickets and scored 72 runs while batting in the lower order. His ability to bowl crucial overs and finish innings with the bat made him a valuable asset. One of his most memorable performances came when he took a hat-trick against Rewa Division, finishing with six wickets in a single match. His consistent performances didn’t go unnoticed. In the IPL 2025 Mega Auction, Madhav entered with a base price of 30 lakh. The MI and DC both showed interest in the young all-rounder, but DC secured him for 40 lakh after a brief bidding war. At this young age, Madhav is one of the most exciting uncapped players in the IPL. He brings balance to the Delhi Capitals squad with his ability to bowl at a good pace and contribute with the bat at number 6 or 7. Under the mentorship of experienced players and coaches, Madhav has the opportunity to develop into a match-winner for his team.",
  "nationality": "India",
  "career_span": {}
}