{
  "id": "pprofile_67648",
  "type": "player_bio",
  "player": "Manoj Bhandage",
  "full_name": "Manoj Shivaramsa Bhandage",
  "dob": "October 5, 1998",
  "role": "All-Rounder",
  "batting_style": "Left Handed",
  "bowling_style": "Right-arm medium fast",
  "teams": [
    "Royal Challengers Bengaluru",
    "Karnataka",
    "Mysore Warriors",
    "Bijapur Bulls",
    "Bengaluru Blasters",
    "Gulbarga Mystics"
  ],
  "bio": "Manoj Bhandage, a promising left-handed batting all-rounder, has emerged as one of Karnataka's bright talents in recent years. His journey began in Raichur, where he honed his skills amidst the lively atmosphere of tennis ball cricket. Transitioning to Bengaluru, Bhandage focused on refining his abilities, particularly his prowess in six-hitting, during the early stages of his career. Bhandage first garnered attention in the cricketing arena during the Karnataka Premier League in 2018, where his stellar performances for Bengaluru Blasters caught the eye. His all-round skill set earned him a spot in Karnataka's T20 squad during the 2018-19 Syed Mushtaq Ali Trophy. Despite facing inconsistency early in his career, Bhandage's fortunes took a significant turn during the 2022 edition of the Maharaja T20 Trophy. With 162 runs from 8 games at an SR of 167.01 and 10 wickets, he emerged as a linchpin for Gulbarga Mystics on their path to clinching the title. His breakthrough continued as he made his List A debut for Karnataka later in 2022 during the Vijay Hazare Trophy. In 2023, Bengaluru recognised Bhandage's potential and acquired his services for the 16th edition of the Indian Premier League. Unfortunately, he warmed the bench the entire season, but it did not hinder his confidence, and the talent was there for everyone to see at the Maharaja T20 Trophy later in the year. He set the stage alight for the Mysore Warriors, scoring 164 runs from 9 matches at a blistering SR of 192.94. Bhandage's upward trajectory continued during the 2023 Vijay Hazare Trophy, where he delivered under pressure in the semi-final, scoring a crucial 63 off 39 balls to rescue his team from a precarious position. Recognised for his explosive batting and useful medium pace, Bengaluru retained him for the 2024 IPL season, though he did not get a game. Despite the setback, Bhandage continued to shine in domestic competitions, enjoying yet another stellar Maharaja T20 Trophy season in 2024, where he amassed 292 runs and picked up 8 wickets, playing a vital role in Mysuru Warriors’ title triumph. However, he was released by Bengaluru after the 2024 IPL, only for the franchise to buy him back at INR 30 lakhs in the 2025 auction, showing faith in his potential.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "",
    "IPL": "2025-2025"
  }
}