{
  "id": "pprofile_4945",
  "type": "player_bio",
  "player": "Imran Tahir",
  "full_name": "Mohammad Imran Tahir",
  "dob": "March 27, 1979",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Leg break googly",
  "teams": [
    "South Africa",
    "Derbyshire",
    "Dolphins",
    "Durham",
    "Border",
    "Hampshire",
    "Lahore City",
    "Lahore Blues",
    "Lahore Whites",
    "Lahore Lions",
    "Lahore Ravi",
    "Nottinghamshire",
    "Pakistan A",
    "Pakistan International Airlines",
    "REDCO",
    "South Africa A",
    "South African Invitation XI",
    "Sui Gas Corporation",
    "Staffordshire",
    "Surrey",
    "Titans",
    "Water and Power Development Authority",
    "Warwickshire",
    "Yorkshire",
    "Chennai Super Kings",
    "Delhi Capitals",
    "Middlesex",
    "Sialkot",
    "Pakistan Under-19",
    "DP World Lions",
    "Melbourne Renegades",
    "Sylhet Strikers",
    "Rangpur Riders",
    "Guyana Amazon Warriors",
    "Rising Pune Supergiant",
    "Karachi Kings",
    "Nelson Mandela Bay Stars",
    "World XI",
    "Multan Sultans",
    "Nelson Mandela Bay Giants",
    "Northern Warriors",
    "Amsterdam Knights",
    "Deccan Gladiators",
    "Birmingham Phoenix",
    "Manchester Originals",
    "Dambulla Sixers",
    "Chennai Brave Jaguars",
    "Interglobe Marine",
    "World Giants",
    "Manipal Tigers",
    "Joburg Super Kings",
    "MI Emirates",
    "Texas Super Kings",
    "Rajasthan Kings",
    "South Africa Champions",
    "Atlanta Kings CC",
    "UP Brij Stars"
  ],
  "bio": "Since his first-class debut in 1996-97, Imran Tahir has constantly been on the move. Starting with Lahore in Pakistan, to Titans in South Africa, he also went on to play for the English counties of Middlesex, Yorkshire, Warwickshire, Staffordshire and Hampshire. Throughout his career, Tahir, a leg break bowler, made sporadic appearances for each of these teams which alone suggested that he failed to stick to one place for a longer time and did not live up to his own potential. However, his first-class record was impressive and that earned him a call-up to South Africa's Test squad for their home series against England in 2010. But, on the same day, the decision to include him in the side was overturned as it was found that Tahir was not eligible to play for South Africa at that point of time. The Pakistan-born Tahir, however, continued to impress at the domestic level for Dolphins. He was finally granted South African citizenship in 2011, before being picked for the ODIs against India, albeit he did not play a single game. Tahir made his ODI debut against West Indies in the 2011 ICC Cricket World Cup and immediately shot to fame with his crafty leg-spin which helped him conjure figures of 4 for 41. The juggernaut continued as he scalped 14 wickets from five matches before a thumb fracture ruled him out of the tournament. However, a Test debut came later in the year against Australia, and he had a decent start to it before he endured one of the worst phases of his cricketing career in Adelaide. He was taken to the cleaners by the Australian batsmen and ended up with the worst bowling figures in the history of Test cricket - 0/260. He was dropped after that and was replaced by Robin Peterson. Nearly a year later, a determined Tahir made his comeback in a grand manner with his maiden Test five-wicket haul against Pakistan in Dubai. He ended up with eight wickets in the match and helped South Africa level the two-match series 1-1. Fame was, however, short-lived as Tahir couldn't trouble the touring Indians even a wee bit and was attacked by them in the first Test in Johannesburg. Imran Tahir proved his credentials in the 2015 ICC World Cup. In a tournament believed to be for the pacers, he ended up with 15 scalps at an average of 21.53. Having known to turn his googly more than his leg spin, Tahir can become an even better bowler if he adds this one dimension to his style of bowling. More recently though, Tahir has found a new love for the limited-over formats of the game. He has been terrific in the shortest version for the national side as well as his franchise in various T20 Leagues. In 2018, he was selected in the Chennai team for the Indian T20 League and was a massive performer for them in the two editions in 2018 and 2019, firstly as champions and then as runners-up respectively. He continued to remain part of the Yellow brigade. The leggie represented South Africa in the 2019 World Cup and at the age of 40, he was the oldest cricketer to play a WC match for the Saffas. Tahir also bowled the opening over of the showpiece event to become the first spinner to do so in a World Cup match. Imran announced his retirement from ODIs after the tournament but kept his ambitions high of playing for South Africa in the next T20 World Cup. Imran Tahir will always be one of the premium spinners that South Africa has produced. He is not getting any younger but his enthusiasm for the game is unparalleled. The day he leaves cricket, his celebration of running from one end to the other end of the ground will be really missed.",
  "nationality": "South Africa",
  "career_span": {
    "Test": "2011-2015",
    "ODI": "2011-2019",
    "IPL": "2014-2021"
  }
}