{
  "id": "pprofile_11933",
  "type": "player_bio",
  "player": "Adam Milne",
  "full_name": "Adam Fraser Milne",
  "dob": "April 13, 1992",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm fast",
  "teams": [
    "New Zealand",
    "Kent",
    "North Island",
    "New Zealand A",
    "Wellington Firebirds",
    "Royal Challengers Bengaluru",
    "Chennai Super Kings",
    "Mumbai Indians",
    "Melbourne Stars",
    "Sydney Thunder",
    "Central Stags",
    "Karachi Kings",
    "New Zealanders",
    "Team Abu Dhabi",
    "Birmingham Phoenix",
    "Sunrisers Eastern Cape",
    "Sharjah Warriorz",
    "Texas Super Kings",
    "Washington Freedom",
    "Joburg Bangla Tigers"
  ],
  "bio": "‘Meteoric’ is the word which aptly sums Adam Milne’s rise to the national side. At 17, the speedster was busy opening the bowling for his school team before earning an unexpected call-up from the Central Districts as Michael Mason’s replacement, who in turn had been called up for national duty for the Kiwis. The Palmerston North-born player impressed on his first-class debut in 2010 against Canterbury, scalping his maiden wicket in only his second ball and finished off the innings with figures of 4-52. His initial performances amazed his club who decided to look beyond his inexperience and included him for the 2010 Champions League T20 held in South Africa. He played two games in the tournament and impressed with his sheer pace. Cricket pundits touted him as the fastest New Zealand bowler after Shane Bond. He clocked speeds in the range of 145-150 kph consistently. His raw talent earned him a place in New Zealand’s squad for the T20I series against Pakistan, where he made his debut. However, he didn't have a good start and after that, injuries disrupted his first-class career. Milne once again came into the limelight when he was selected in New Zealand's squad for the 2012 World Twenty20 in Sri Lanka. But, he kept on suffering from injuries and that led the selectors to adopt a cautious approach regarding him. That limited his first-class exposure. He only got a few games on and off for his national side but again grabbed attention during the series against Pakistan in UAE in December 2014, where he troubled the battters and hurried them constantly. That caught the fancy of the selectors again as he got named in the squad for the 2015 World Cup. He was the third frontline pacer and fulfilled his duty till the quarter-final. Luck once again did not favour him as his campaign ended due to another injury before the semi-final. Adam Milne was picked in the Indian Premier League auction by Bengaluru in 2015 but missed the tournament due to fitness issues. He was retained by them in the year 2016 but only got one game. Hamstring, side and elbow injuries kept him away from cricket for a year after which he returned to play for his franchise. The 2017 season saw him play four matches but he didn't make any kind of substantial impact. After that, he featured for the Kiwis in the 2017 ICC Champions Trophy and fared decently but there was no noteworthy performance.",
  "nationality": "New Zealand",
  "career_span": {
    "Test": "",
    "ODI": "2012-2024",
    "IPL": "2016-2022"
  }
}