{
  "id": "pprofile_60122",
  "type": "player_bio",
  "player": "KL Rahul",
  "full_name": "Rahul Kannaur Lokesh",
  "dob": "April 18, 1992",
  "role": "Wicket Keeper",
  "batting_style": "Right Handed",
  "bowling_style": "-",
  "teams": [
    "India",
    "Asia XI",
    "India A",
    "Indian Board Presidents XI",
    "South Zone",
    "Royal Challengers Bengaluru",
    "Punjab Kings",
    "Delhi Capitals",
    "India Under-19",
    "Karnataka",
    "Sunrisers Hyderabad",
    "Southern Champs",
    "India Under-23",
    "Ballari Tuskers",
    "Hubli Tigers",
    "Bangalore Brigadiers",
    "Indians",
    "Lucknow Super Giants",
    "Team A"
  ],
  "bio": "For people, pleasure is something of a personal topic. They don't really wish to discuss it openly, but we don't have that difficulty. We can talk about it openly since our first love is cricket, and watching KL Rahul bat makes us flutter like a flag in windy weather. Yes, that's our dirty pleasure of life. Born in Karnataka, the land of Rahul Dravid, this lad took to cricket like fish to water. He started early in college, and seeing his inclination toward the game, his parents backed him. He didn't disappoint either. With his hard work and dedication, Rahul got into the Under-19 squad, and from there to the Karnataka Ranji team. This happened in 2010-11, but the dream run didn't last long as he was dropped only to come back better and hungrier after a couple of years. In his comeback stint, he propelled Karnataka to the trophy while becoming one of the most prolific run-scorers in the team. Seeing his calibre, hunger, and technique for the longest format, selectors took him to Australia for his first big test in 2014 after he made double hundreds for lunch in the domestic season. He faltered in his first-ever Boxing Day Test in Melbourne, however, the desire and the trust shown by the management urged him forward. Then the Indian entourage moved to Sydney, and in came the first of the many majestic displays of batting one could witness. Lokesh not only batted for 262 balls to prove his mantle, technique, and agility but also scored his maiden hundred in the process. At just 23, he had a Test ton that too in Australia. Not many can pride themselves on such a feat. In the same year, he went to Sri Lanka and scored another gritty hundred in Colombo. Well, he opened the doors for his arrival in international cricket with a robust kick, but his inconsistency didn't help much. Just the next year, he scored a lucky, or rather we should say, unlucky 199 against England. After that, a spell of consistent 60s and 70s followed. He shares his name with the legendary Rahul Dravid and has the compact, easy-to-the-eyes technique to match him. His Indian Premier League career has been a story in itself. He has travelled up and down India, playing for several different teams and making decent runs but never getting to the level where he could be seen as a match-winner by himself. After playing for the Bengaluru-based franchise for a few seasons, the Punjab-based team bought him in an aggressive auction in 2018. He reciprocated the faith by lighting up the league with the fastest 50 in the league that year. Even after that, he showed that he belonged on the elite list with a flurry of impressive innings and should be in there sooner than later. Rahul took his T20I form to the United Kingdom in his back pocket, scoring a blistering 101 against England. His stroke play left the crowd in awe of his class. With India’s opening batters set in the ICC Cricket World Cup in 2019, KL Rahul was asked to bat at number 4. Eventually, after Dhawan was ruled out due to injury, it was Rahul who then opened alongside Rohit Sharma. He did everything with ease. For the 2020 edition of the IPL, Rahul was named captain of Punjab, and he led by example, scoring 670 runs and finishing as the highest run-scorer. After the 2021 season, he parted ways with Punjab and joined Lucknow for the 2022 season for INR 17 crores and was the one at the helm. He led his team to the playoffs and once again scored over 600 runs. An unfortunate accident for Rishabh Pant in December 2022 sidelined him for an extended period, leading to Rahul being entrusted with wicketkeeping duties in the ODI side. He embraced the role with aplomb, particularly during the 2023 World Cup. The added responsibility did not weigh him down, but he thrived, playing a crucial role in India's journey to the final of the showpiece event at home. Just like his namesake, Rahul Dravid, KL is the epitome of a team player, always ready to take on any role his team requires. That moment came once again in 2024 during the marquee Border-Gavaskar Trophy, where, in Rohit Sharma's absence, Rahul was called upon to open the innings. He delivered when it mattered, providing much-needed stability at the top of the order, and stood out, particularly during India's memorable win in the first Test at Perth. On the Indian Premier League front, 2024 saw him part ways with Lucknow, and Delhi snapped him up at the auction for the 2025 edition.",
  "nationality": "India",
  "career_span": {
    "Test": "2014-2025",
    "ODI": "2016-2025",
    "IPL": "2013-2025"
  }
}