{
  "id": "pprofile_10172",
  "type": "player_bio",
  "player": "James Neesham",
  "full_name": "James Douglas Sheahan Neesham",
  "dob": "September 17, 1990",
  "role": "All-Rounder",
  "batting_style": "Left Handed",
  "bowling_style": "Right-arm medium fast",
  "teams": [
    "New Zealand",
    "Auckland Aces",
    "Derbyshire",
    "Durham",
    "Essex",
    "Kent",
    "Leicestershire",
    "Northamptonshire",
    "North Island",
    "New Zealand A",
    "Wellington Firebirds",
    "Kolkata Knight Riders",
    "Punjab Kings",
    "Delhi Capitals",
    "Rajasthan Royals",
    "Mumbai Indians",
    "Otago Volts",
    "New Zealand Under-19",
    "Hobart Hurricanes",
    "Rangpur Riders",
    "New Zealand XI",
    "Guyana Amazon Warriors",
    "Trinbago Knight Riders",
    "Islamabad United",
    "Peshawar Zalmi",
    "Surrey Jaguars",
    "Northern Warriors",
    "Pollard XI",
    "London Spirit",
    "Oval Invincibles",
    "Welsh Fire",
    "Jaffna Kings",
    "Pretoria Capitals",
    "Bangla Tigers Mississauga",
    "Harare Bolts",
    "Atlanta Kings CC",
    "Ajman Bolts",
    "Janakpur Bolts"
  ],
  "bio": "The Under-19 World Cup has produced some fantastic talents for so many of the countries all around the world. The Kiwis too, got a gem in the form of James Neesham who was first noticed due to the U-19 World Cup in 2010 as a promising all-rounder. It took two years but Neesham made his ODI debut against South Africa towards the end of 2012 and consequently made his T20I debut against the same opponents in January 2013. Before making his debut for the Black Caps, Neesham played for Auckland in domestic cricket, then shifted to Otago and he was the shining light for them in the 50-over format. He performed brilliantly in the 2013 Champions League for the Otago Volts, helping them to many wins in the early stages of the tournament. All these performances pushed Neesham and earned him his first Test cap against India in February 2014. Neesham missed out on the 15-man squad for the ICC 2015 World Cup as Grant Elliot was picked over him. He continued to be a part of the ODI side for the next two seasons but was dropped after the 2017 ICC Champions Trophy. He looked like he had decided that he wanted to retire but he was talked out of it and he made a comeback to the domestic scene in 2018 which ultimately earned him an international recall to face Sri Lanka. The selectors decided to stick with him and included him in the squad for the ICC 2019 World Cup. This was a decision that almost won the Kiwis the World Cup as Neesham was absolutely wonderful in the tournament with the bat and the ball, especially in the final against England where he sent three English batters back to the hut, while also producing the final ball run-out to tie the scores after 50 overs. He was also entrusted with the bat in the Super Over that followed and he scored 13 runs off 5 balls including a massive six off Jofra Archer. It's a shame that he could not cross the line and deliver the trophy for the Kiwis but New Zealand were massively pleased with his performance in this tournament. Talking about his involvement in domestic tournaments over the world, he was part of the 2014 Caribbean Premier League playing for the Guyana Amazon Warriors. He also represented Derbyshire in the 2016 English T20 Blast. The next year, he shifted his base to play for Kent in the same tourney. Neesham began his Indian Premier League career with Delhi. Subsequently, he was picked up by the Kolkata franchise but he did not take part in a single game due to injury and was dropped from the squad from the next season. As a result, the Punjab team picked him in the 2020 auction for INR 50 lakhs.",
  "nationality": "New Zealand",
  "career_span": {
    "Test": "2014-2017",
    "ODI": "2013-2023",
    "IPL": "2014-2022"
  }
}