{
  "id": "pprofile_10116",
  "type": "player_bio",
  "player": "Sandeep Sharma",
  "full_name": "Sandeep Sharma",
  "dob": "May 18, 1993",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm medium",
  "teams": [
    "India",
    "India A",
    "India B",
    "India Green",
    "North Zone",
    "Punjab Kings",
    "Rajasthan Royals",
    "India Under-19",
    "Punjab",
    "Sunrisers Hyderabad",
    "India Under-23",
    "Chandigarh",
    "BPCL",
    "Plaza Zone",
    "Leisure Zone",
    "Manohar Mavericks"
  ],
  "bio": "Hailing from Punjab, Sandeep Sharma is a right-arm medium pacer who was part of India's Under-19 World Cup-winning squad in 2012. He was the joint highest wicket taker for India in the tournament with 12 wickets in six matches. Sandeep plies his trade for Punjab in the domestic circuit. Sandeep came up with impressive performances in the Quadrangular U-19 series in Australia, becoming the highest wicket-taker in the series, with eight wickets from four games. In 2013, he was signed by Punjab for the Indian Premier League's sixth edition and was bought back in the 2014 auction as well. His first game for the franchise was memorable as he ripped through the Hyderabad batting with three wickets. After a good season with the franchise, Sandeep also managed to earn his India cap, but he failed to impress on the tour of Zimbabwe. After a successful stint with Punjab from 2013 to 2017, Sandeep became a hot commodity at the 2018 IPL auction. Hyderabad secured his services for a hefty INR 3 crore, making him one of the most expensive buys of the season. While he maintained his reputation for being economical, he couldn't quite have the breakthrough season he had hoped for. His four-year tenure with Hyderabad ended, and he returned to Punjab via the 2022 auction. However, opportunities were scarce that season. On the domestic front, Sharma switched from Punjab to Chandigarh ahead of the 2021-22 season, hoping for more game time. Unfortunately, his dip in form led to him going unsold at the 2023 IPL auction. As fate would have it, Rajasthan brought him in as a late injury replacement. Sharma capitalised on his chances, impressing in the 2023 season, and further improved his performances the following year. His resurgence saw Rajasthan retain him for the 2025 edition of the tournament.",
  "nationality": "India",
  "career_span": {
    "IPL": "2013-2025"
  }
}