{
  "id": "pprofile_45853",
  "type": "player_bio",
  "player": "David Wiese",
  "full_name": "David Wiese",
  "dob": "May 18, 1985",
  "role": "All-Rounder",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm medium fast",
  "teams": [
    "South Africa",
    "Namibia",
    "Border",
    "South Africa A",
    "South African Invitation XI",
    "Titans",
    "Yorkshire",
    "Royal Challengers Bengaluru",
    "Kolkata Knight Riders",
    "Sussex",
    "South Africa Emerging",
    "Barbados Royals",
    "Saint Lucia Kings",
    "Guyana Amazon Warriors",
    "Comilla Victorians",
    "Karachi Kings",
    "Lahore Qalandars",
    "Khulna Tigers",
    "Benoni Zalmi",
    "Bangla Tigers",
    "Tshwane Spartans",
    "Paarl Rocks",
    "Deccan Gladiators",
    "London Spirit",
    "Northern Superchargers",
    "Colombo Strikers",
    "Namibia A",
    "Richelieu Eagles",
    "Joburg Super Kings",
    "Gulf Giants",
    "MI New York",
    "Bangla Tigers Mississauga",
    "Jaffna Titans"
  ],
  "bio": "David Wiese is a right-handed batting all-rounder representing Namibia. Hailing from Roodepoort, South Africa, Wiese began his professional career in South Africa when he made his first-class debut for Easterns during the 2005-06 SAA Provincial Challenge. In October 2005, he made his List A debut for Easterns in the 2005-06 SAA Provincial Cup and three years later, in 2008, he made his T20 debut for the Titans in the domestic competition. After grinding for years in the South African domestic circuit, Wiese made his T20I debut in 2013 against Sri Lanka. In 2015, he made his ODI debut for South Africa during the home series against New Zealand. Wiese then opted for the Kolpak route and started playing county cricket in England. In 2021, Wiese became eligible to represent Namibia since his father was born in that country. He represented Namibia in the 2021 T20 World Cup and played a key role in helping them qualify for the Super 12 stage. Wiese has plied his trade in several franchise leagues across the globe, notably the Indian T20 League, Pakistan Super League, Caribbean Premier League, and The Hundred. He will return to the Indian T20 League after seven years for the 2023 edition after the Kolkata franchise bought him at his base price in the auction. David Wiese bats in the lower order for Namibia and performs the finisher role with aplomb. He is astute with his change-of-pace deliveries and makes significant contributions with the ball as well.",
  "nationality": "Namibia",
  "career_span": {
    "Test": "",
    "ODI": "2015-2022",
    "IPL": "2015-2023"
  }
}