{
  "id": "pprofile_89183",
  "type": "player_bio",
  "player": "Shaik Rasheed",
  "full_name": "Shaik Rasheed",
  "dob": "September 24, 2004",
  "role": "Batsman",
  "batting_style": "Right Handed",
  "bowling_style": "Leg break",
  "teams": [
    "India A",
    "South Zone",
    "Chennai Super Kings",
    "India Under-19",
    "Andhra",
    "India A Under-19",
    "India D Under-19",
    "Coastal Riders",
    "Rayalaseema Kings",
    "Royals of Rayalaseema"
  ],
  "bio": "Shaik Rasheed, a promising young talent from Guntur, Andhra Pradesh, has been making waves in the cricketing world with his exceptional batting skills. Born on September 24, 2004, Rasheed's journey to cricketing prominence is a testament to his dedication and perseverance. Despite facing financial hardships, his father supported his cricketing dreams, often traveling long distances to ensure Rasheed received quality coaching. This commitment bore fruit when Rasheed was selected for state age-group teams, quickly establishing himself as a prolific run-scorer for Andhra Pradesh. Rasheed's breakthrough came when he was appointed vice-captain of the India Under-19 team for the 2022 ICC Under-19 World Cup. His standout performance in the semi-final against Australia, where he scored a crucial 94 runs, showcased his potential on the international stage. In domestic cricket, Rasheed emerged as the top run-scorer for Maharashtra during the 2018-19 Syed Mushtaq Ali Trophy league stage, further cementing his reputation as a formidable batter. In the 2024/25 Ranji Trophy, Rasheed's performances have been nothing short of spectacular. He scored a magnificent 203 against Hyderabad, demonstrating his ability to play long innings. His first-class career boasts an impressive average, with two centuries and seven fifties in just 19 matches. His highest score of 203 came off 372 balls, highlighting his patience and skill at the crease. Rasheed's prowess is not limited to the longer format. In the Syed Mushtaq Ali Trophy, he has shown his ability to adapt to the shorter format, scoring a century against Arunachal Pradesh with a blistering 100 off 54 balls. His T20 career features an average of 29.33 and a strike rate of 127.07, with one century and one fifty to his name. Rasheed's talent caught the attention of the Chennai Super Kings, who acquired him at the base price of INR 20 lakhs in the IPL auction of 2024. Under the mentorship of MS Dhoni and coach Stephen Fleming, Rasheed is poised for significant growth in the IPL 2025 as well, where he will have the opportunity to hone his skills alongside some of the best in the business.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "",
    "IPL": "2023-2025"
  }
}