{
  "id": "pprofile_68027",
  "type": "player_bio",
  "player": "Rahmanullah Gurbaz",
  "full_name": "Rahmanullah Gurbaz",
  "dob": "November 28, 2001",
  "role": "Wicket-Keeper",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm medium",
  "teams": [
    "Leicestershire",
    "Kolkata Knight Riders",
    "Afghanistan Under-19",
    "Afghanistan",
    "Rangpur Riders",
    "Barbados Royals",
    "Guyana Amazon Warriors",
    "St Kitts and Nevis Patriots",
    "Islamabad United",
    "Khulna Tigers",
    "Afghanistan A",
    "Mis-e-Ainak Region",
    "Kabul Eagles",
    "Mis-e-Ainak Knights",
    "Speen Ghar Tigers",
    "Multan Sultans",
    "Kabul Region",
    "Paktia Panthers",
    "Kathmandu Kings XI",
    "Delhi Bulls",
    "Colombo Strikers",
    "Jaffna Kings",
    "Kandy Falcons",
    "Fortune Barishal",
    "Gujarat Titans",
    "New York Strikers",
    "Pretoria Capitals",
    "Desert Vipers",
    "Dubai Capitals",
    "Gulf Giants",
    "Sharjah Warriorz",
    "Bangla Tigers Mississauga",
    "Cape Town Samp Army",
    "UP Nawabs"
  ],
  "bio": "Rahmanullah Gurbaz is a dynamic right-handed wicketkeeper-batter who proudly represents Afghanistan on the international stage. His professional career kicked off in 2017 when he made his List A debut for Afghanistan A during a tour of Zimbabwe. That same year, during the 2017-18 Shpageeza Cricket League season, he marked his T20 debut with Mis Ainak Knights against Band-E-Amir Dragons. His performances earned him a spot in the Afghanistan Under-19 squad for the 2018 ICC Under-19 World Cup, where he impressively scored 134 runs across five innings. After the Under-19 World Cup, Gurbaz made his first-class debut for Mis Ainak Region against Boost Region in the Alokozay Ahmad Shah Abdali 4-day Tournament. His consistent performances for both the Under-19 and Under-23 teams caught the attention of Afghan selectors, earning him a place in the senior squad for the T20I tri-series against Bangladesh and Zimbabwe. He made his T20I debut against Zimbabwe and, just a couple of years later, made his ODI debut against Ireland in 2021. Gurbaz’s skills have also shone in various franchise leagues around the world, including the Bangladesh Premier League, Pakistan Super League, and Lanka Premier League. In the 2022 Indian Premier League, he was brought in as a replacement for Jason Roy by the Gujarat franchise but didn't get an opportunity to play during their title-winning season. However, ahead of the 2023 IPL auction, he was transferred to the Kolkata franchise, where he has remained a key player into 2024 winning the title that season. He was picked up in the auction by Kolkata again for the 2025 season On the international stage, Gurbaz had a notable run with Afghanistan during the 2023 ICC Men’s World Cup. He is one of the first names for the national team and was a part of the 2024 T20 World Cup and 2025 Champions Trophy. While his talent is clear, his consistency remains an area for growth as he continues to establish himself as one of Afghanistan’s key players.",
  "nationality": "Afghanistan",
  "career_span": {
    "Test": "2024-2024",
    "ODI": "2021-2025",
    "IPL": "2023-2025"
  }
}