{
  "id": "pprofile_63649",
  "type": "player_bio",
  "player": "Nitish Rana",
  "full_name": "Nitish Rana",
  "dob": "December 27, 1993",
  "role": "Batsman",
  "batting_style": "Left Handed",
  "bowling_style": "Off break",
  "teams": [
    "India",
    "India A",
    "India B",
    "India Red",
    "North Zone",
    "Kolkata Knight Riders",
    "Rajasthan Royals",
    "Mumbai Indians",
    "Delhi",
    "Uttar Pradesh",
    "India Under-23",
    "Noida Kings",
    "West Delhi Lions"
  ],
  "bio": "India has always had a plethora of right-handed batters, but in recent times there have been quite a few left-handed batters like Rishabh Pant, Ishan Kishan, and Nitish Rana who have made a mark on the big stage. Nitish Rana has been mostly seen in the role of an accumulator in the middle order to take on the spinners, but the southpaw has often stepped on the gas when his team needed acceleration. Born on 27th December 1993 and hailing from Delhi, Rana started his professional career in 2013 when he made his List A debut for Delhi against Assam during the 2012-13 Vijay Hazare Trophy. Later in March 2013, he made his T20 debut for Delhi against Vidarbha in the 2012-13 Syed Mushtaq Ali Trophy. A couple of years later, in 2015, he made his first-class debut for Delhi against Vidarbha in the 2015-16 Ranji Trophy season. In his debut first-class season, he amassed 557 runs to end as Delhi’s top run scorer. In 2016, Rana made his Indian Premier League debut but had limited opportunities in that season. He had a breakout season in the 2017 Indian Premier League, scoring 333 runs and playing a key role in the Mumbai franchise's title-winning campaign. However, he was released by the Mumbai franchise ahead of the 2018 Indian Premier League auction. The Kolkata franchise showed faith in him and acquired his services for the 2018 season. With a strike rate of over 146 in the 2019 edition and an average of 34.40, Nitish was often touted as one of the most reliable players in the Kolkata line-up. Even though he mostly played in the middle order, Nitish didn’t disappoint when he was asked to open the innings against the Hyderabad franchise that season during a daunting 182-run chase, and his quickfire 68 off 47 balls set the tone for his side. Rana eventually made his India debut during the tour of Sri Lanka in 2021. He made his ODI and T20I debuts for India in that series. He was released ahead of the 2022 mega auction but re-signed for INR 8 crore, scoring 361 runs at a strike rate of 143.82. Retained by the Kolkata franchise, Rana was entrusted with the captaincy for the 2023 IPL season in Shreyas Iyer's absence. While Kolkata fell short of a playoff berth, Rana led from the front, handling the added responsibility well and finishing as the team's second-highest run-scorer for the season. With Iyer returning to lead the side in 2024, Rana's campaign was marred by a finger injury, which sidelined him for 10 consecutive games. He managed only a couple of appearances in what turned out to be a title-winning season for Kolkata. Ahead of the 2025 auction, Kolkata decided to release him, and Rajasthan secured his services for INR 4.20 crore.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "2021-2021",
    "IPL": "2016-2025"
  }
}