{
  "id": "pprofile_90635",
  "type": "player_bio",
  "player": "T Vijay",
  "full_name": "Tripurana Vijay",
  "dob": "September 5, 2001",
  "role": "All-Rounder",
  "batting_style": "Right Handed",
  "bowling_style": "Off break",
  "teams": [
    "South Zone",
    "Delhi Capitals",
    "Andhra",
    "Coastal Riders",
    "Godavari Titans",
    "Simhadri Vizag Lions"
  ],
  "bio": "Tripurana Vijay, a promising all-rounder from India, has been making waves in domestic cricket with his dual capabilities of batting and bowling. Born in 2001, Vijay has shown immense potential in the domestic circuit, particularly in the Ranji Trophy and the Syed Mushtaq Ali Trophy. His right-handed batting style, combined with his off-spin bowling, makes him a versatile player on the field. In the Ranji Trophy 2024/25 season, Vijay delivered a standout performance against Rajasthan, taking 10 wickets for 84 runs, including two five-wicket hauls, showcasing his ability to turn matches with the ball. Vijay's batting prowess, though still developing, has shown glimpses of brilliance. His highest score in the Ranji Trophy is 36 against Gujarat, and he has accumulated 173 runs in nine matches, with an average of 12.35. His bowling, however, has been his primary strength, with 28 wickets in the same number of matches at an average of 29.82. His best bowling figures of 5/22 against Rajasthan highlight his potential as a match-winner. In the shorter formats, Vijay has been equally impressive. In the Syed Mushtaq Ali Trophy, he has taken 12 wickets in eight matches, with an economy rate of 6.00, and his best figures of 4/8 against Nagaland underline his ability to deliver under pressure. His batting in T20s has been modest, but his strike rate suggests a player capable of quick scoring. Vijay's journey in the IPL is yet to begin, but he was roped in by Delhi during the auction for the 2025 season and his performances in domestic T20 leagues like the Andhra Premier League have been noteworthy. Playing for Godavari Titans, he has scored 132 runs in 23 matches, with a strike rate of 148.31, and taken 19 wickets, demonstrating his all-round capabilities. As Vijay continues to hone his skills, the cricketing fraternity is keenly watching his progress. His ability to contribute with both bat and ball makes him a valuable asset for any team. With the potential to break into the national team, Vijay's future in Indian cricket looks promising. Looking ahead, Vijay's focus will be on maintaining consistency and improving his batting average. His upcoming challenges include the continuation of the Ranji Trophy and potential opportunities in the IPL, where he aims to make a mark. As he continues to develop, his performances will be crucial in determining his path to international cricket.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "",
    "IPL": ""
  }
}