{
  "id": "pprofile_69915",
  "type": "player_bio",
  "player": "Vidwath Kaverappa",
  "full_name": "Vidwath Kaverappa",
  "dob": "February 25, 1999",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm fast medium",
  "teams": [
    "India A",
    "Rest of India",
    "South Zone",
    "Punjab Kings",
    "Karnataka",
    "Hyderabad",
    "Shivamogga Lions",
    "Hubli Tigers",
    "Gulbarga Mystics",
    "Team A",
    "India D"
  ],
  "bio": "India was always known for producing an abundance of spin bowlers but in recent times there has been an influx of genuinely fast swing bowlers and Vidhwath Kaverappa is one such young bowler making an impact in the domestic circuit. Born on 25th February 1999 in the Coorg district of Karnataka, Vidhwath played other sports growing up like basketball and football along with representing Karnataka at the Nationals for handball. He took an interest in cricket at the age of 10 and after high school, moved to Bengaluru to play club cricket under the tutelage of Samuel Jayaraj Muthu. He soon made his transition into the Karnataka U19 side but thereafter played lots of club-level cricket as he continued to improve his skills. He was finally called up to the Karnataka senior side early in 2022 and made his first-class debut against Puducherry in the Ranji Trophy claiming his maiden domestic wicket. He played T20 cricket in Karnataka’s franchise league and took a liking to the shortest format as he ended the tournament as the joint-leading wicket-taker with 17 wickets in 13 games. This prompted his inclusion into the Karnataka side for the 2022 Syed Mushtaq Ali Trophy and he made his T20 debut against Maharashtra where he claimed 3 wickets for 19 runs in his four overs. Although his side was knocked out in the quarter-finals, Vidhwath had a remarkable tournament as he was the second-highest wicket-taker with 18 wickets in 8 games and had an economy rate of 6.36. He also managed to claim his maiden domestic five-wicket haul against Jammu and Kashmir and his match figures of 5 for 11 were the best by a Karnataka bowler in the competition. He made his List A debut after the T20 competition ended against Meghalaya in the Vijay Hazare Trophy and his big break arrived when he was picked by the Punjab franchise at his base price for the 2023 Indian Premier League. He celebrated his selection to play in India's premier T20 competition by claiming his maiden first-class five-wicket haul against Chhattisgarh at the start of 2023. However, unfortunately, he couldn't get any games in that season. He worked hard to improve his skills and enjoyed an excellent domestic season. He was key for Karnataka in their run till the quarter-finals in the Ranji Trophy with 25 wickets in 5 matches. Kaverappa was the leading wicket-taker for South Zone in their triumph in the Deodar Trophy 2023 while he won the player of the tournament in the Duleep Trophy 2023 where in the final he took an incredible 8-wicket haul. His exceptional performances made Punjab retain and will be eager to make his mark in the biggest franchise league in the world. There have been several fast bowlers who have been propelled to the national side courtesy of their performances in T20 competitions and Vidhwath can be the next pacer to make his mark.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "",
    "IPL": "2024-2024"
  }
}