{
  "id": "pprofile_66516",
  "type": "player_bio",
  "player": "Xavier Bartlett",
  "full_name": "Xavier Colin Bartlett",
  "dob": "December 17, 1998",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm fast medium",
  "teams": [
    "Australia",
    "Queensland",
    "Australia A",
    "Kent",
    "Punjab Kings",
    "Australia Under-19",
    "Brisbane Heat",
    "National Performance Squad",
    "Cricket Australia XI",
    "San Francisco Unicorns",
    "Gold Coast"
  ],
  "bio": "Xavier Colin Bartlett, an Australian international cricketer, represents the national team in both One Day Internationals and Twenty20 Internationals. Known for his right-arm fast-medium bowling, Bartlett plays for Queensland, the Brisbane Heat, and Punjab. He has established himself as a key figure in Australia's domestic and international cricket scene, showcasing his talent in multiple formats. Born in Adelaide, South Australia, Bartlett moved with his family to the Gold Coast, Queensland, at the age of seven. He began his cricket journey playing for the Surfers Paradise club and made his debut for the Gold Coast Dolphins in the first grade at just 17 years old in November 2015. His early promise was evident as he represented The Southport School in the First XI cricket team during 2015 and 2016, earning accolades like the Westcott Family Trophy for First XI Bowler of the Year. His professional career began in earnest with his debut for the Australian National Performance Squad in a List A match against India A in August 2016. Bartlett made his first-class debut for Queensland in the 2019–20 Sheffield Shield season and his T20 debut for the Brisbane Heat in the 2020–21 Big Bash League. In just his second BBL match, he impressed by taking three wickets against the Adelaide Strikers. Bartlett’s form continued to rise, and during the 2023–24 BBL season, he emerged as the tournament’s top wicket-taker, with 20 wickets. In February 2024, Bartlett joined Kent County Cricket Club for the County Championship and the group stage of the Vitality Blast T20 tournament. His international breakthrough came in January 2024 when he was called up to the Australian ODI squad as a replacement for Jhye Richardson, who was injured. Bartlett made an immediate impact on debut, taking 4/17 and earning the Player of the Match award. These figures were the second-best ever recorded by an Australian debutant in ODIs. Bartlett continued to impress in the series, taking 4/21 in the third match and winning his second Player of the Match award, earning him the Player of the Series accolade. He made his T20I debut in February 2024 against the West Indies at Perth Stadium, again as a replacement for the injured Josh Hazlewood. Bartlett marked his T20I debut with a strong performance, claiming two wickets. All this then led to him being picked up by Punjab for the 2025 IPL season adding another feahter to his cap. His rapid rise through domestic cricket, combined with his performances at the international level, marks Bartlett as one of the promising fast bowlers in Australian cricket, with a bright future ahead.",
  "nationality": "Australia",
  "career_span": {
    "Test": "",
    "ODI": "2024-2024",
    "IPL": "2025-2025"
  }
}