{
  "id": "pprofile_41229",
  "type": "player_bio",
  "player": "Rahul Tripathi",
  "full_name": "Rahul Ajay Tripathi",
  "dob": "March 2, 1991",
  "role": "Batsman",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm medium",
  "teams": [
    "India",
    "India A",
    "West Zone",
    "Kolkata Knight Riders",
    "Chennai Super Kings",
    "Rajasthan Royals",
    "Goa",
    "Maharashtra",
    "Sunrisers Hyderabad",
    "Rising Pune Supergiant",
    "BPCL",
    "Eagle Nashik Titans",
    "Kolhapur Tuskers"
  ],
  "bio": "Rahul Tripathi is a flamboyant right-handed batter with almost all the shots in the book one can ask for. His ability to keep the game moving and be busy at the crease is one aspect that makes him stand out. Another aspect is his flexibility as a player. He can bat at any position and can play the waiting game as well as press the accelerator when needed. Along with all this add to his CV, his brilliant fielding, and there you are with a complete package. Born in an army family, Rahul had discipline in his blood and that surely has played a big part in his cricketing journey so far. He started playing cricket professionally in the Deccan Gymkhana, Pune and slowly started making his name. He played for Maharashtra at the U-15 level and had a fruitful stint at the U-19 level as well and that brought him into the senior Maharashtra side. He made his List A debut for Maharashtra in 2010 against Baroda while his first-class debut came against the same opponent two years later. However, his performances were modest for his state side. There was something about Rahul Tripathi that caught the eyes of the Pune franchise and he made his debut for them against Delhi in the 2017 edition of the Indian Premier League. The youngster grabbed the opportunity with both hands playing a crucial role at the top of the order in their journey to the final that year. That season brought him into the limelight and gave him much-needed confidence in his game. The breakthrough season in the Indian Premier League translated into performances for his state side as well and he was the leading run-scorer for Maharashtra in the 2018-19 Ranji Trophy. He then went on to play for Rajasthan, Kolkata and Hyderabad in the Indian Premier League. His performances for Kolkata and Hyderabad especially grabbed a lot of eyeballs. Finally, after a stupendous performance with the bat in the 2022 season of the Indian Premier League where he scored 413 runs for Hyderabad at the strike rate of 158.24, he was drafted into the Indian T20I squad for the tour of Ireland and was also subsequently included in the ODI squad for the tour of Zimbabwe in 2022. Finally, in December 2022, Tripathi earned his first selection to India's T20I squad for the series against Sri Lanka. He made his T20I debut for India on January 5, 2023, facing Sri Lanka at the age of 31.Despite limited opportunities with the national team, Tripathi continued to develop his skills in domestic cricket. Though absent from international competition for an extended period, he maintained consistent performance in the IPL. In 2023, he scored 273 runs at a somewhat disappointing average of 22.75, but Sunrisers Hyderabad maintained their confidence in him. In 2024, Rahul played just six matches, contributing 165 runs. Before the 2025 season, SRH released him ahead of the IPL mega auction. His technically proficient batting attracted interest from multiple franchises, including KKR and CSK, with Chennai Super Kings ultimately securing his services for INR 3.4 crores. While this marks a new chapter for Tripathi, it's somewhat of a homecoming, as he previously played under MS Dhoni and coach Stephen Fleming for Rising Pune Supergiant (now defunct) during the 2016-17 seasons. His versatility to bat in various positions enhances his team's batting depth options.",
  "nationality": "India",
  "career_span": {
    "IPL": "2017-2025"
  }
}