{
  "id": "pprofile_100353",
  "type": "player_bio",
  "player": "Naman Dhir",
  "full_name": "Naman Dhir",
  "dob": "December 31, 1999",
  "role": "All-Rounder",
  "batting_style": "Right Handed",
  "bowling_style": "Off break",
  "teams": [
    "Mumbai Indians",
    "Punjab",
    "BLV Blasters"
  ],
  "bio": "Naman Dhir, a promising young all-rounder from India, has been making waves in domestic cricket with his impressive performances. Known for his right-handed batting and off-break bowling, Dhir has shown a knack for contributing significantly with both bat and ball. In the 2023 domestic season, he caught the attention of cricket enthusiasts by scoring two centuries in first-class cricket, including a notable 134 against Saurashtra. His ability to finish innings with a flourish was instrumental in Punjab's maiden Syed Mushtaq Ali Trophy win. Dhir's journey in the Indian Premier League began with the Mumbai franchise, where he was picked up for the 2024 season. His IPL debut saw him scoring a quickfire 62 against Lucknow, showcasing his potential to perform on the big stage. In the 2024 IPL season, he accumulated 140 runs with a strike rate of 177.21, including a half-century, and took five wickets, highlighting his all-round capabilities. In the domestic circuit, Dhir has been a consistent performer for Punjab. In the Ranji Trophy, he has amassed over 600 runs at an average of BOVE 25, with two centuries to his name. His bowling has been equally effective, with over 11 wickets, demonstrating his ability to make crucial breakthroughs. Similarly in the Vijay Hazare Trophy, he has continued to impress with consistent performances with both bat and the ball. Dhir's performances have not gone unnoticed, with cricket analysts praising his potential. His ability to adapt to different formats and conditions makes him a valuable asset for any team. As he continues to develop his skills, Dhir is poised to become a key player for India in the future.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "",
    "IPL": "2024-2025"
  }
}