{
  "id": "pprofile_65285",
  "type": "player_bio",
  "player": "Odean Smith",
  "full_name": "Odean Fabian Smith",
  "dob": "November 1, 1996",
  "role": "All-Rounder",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm fast medium",
  "teams": [
    "West Indies",
    "Jamaica Scorpions",
    "West Indies A",
    "West Indies B",
    "Punjab Kings",
    "Trinidad & Tobago Red Force",
    "West Indies Under-19",
    "Hobart Hurricanes",
    "Saint Lucia Kings",
    "Guyana Amazon Warriors",
    "Jamaica Tallawahs",
    "St Kitts and Nevis Patriots",
    "Quetta Gladiators",
    "Multan Sultans",
    "Deccan Gladiators",
    "Dambulla Sixers",
    "Surrey Royals",
    "Gujarat Titans",
    "New York Strikers",
    "MI Cape Town",
    "MI Emirates",
    "Bangla Tigers Mississauga",
    "Joburg Bangla Tigers",
    "Clarion County Eagles",
    "Antigua & Barbuda Falcons",
    "UP Nawabs"
  ],
  "bio": "Odean Smith is a hard-hitting seam bowling all-rounder from Jamaica who has all the ingredients of a typical West Indian all-rounder with the ability to change the game both with bat and ball. He is a well-built man and can use the long handle to great effect. His ability to hit the ball over the fence and even out of the ground is second to none and with the ball, he can notch up speeds of over 140 kmph consistently. Smith made his List A debut for West Indies U-19 in 2015 and then represented West Indies U-19 in the 2016 World Cup. He made a rapid rise through the West Indies cricketing circles with some notable all-round performances, especially in white-ball cricket. His natural ability to hit the ball a long way brought him into the limelight and he was drafted into the big league to play in the Caribbean Premier League in 2017. Though Smith's stats were not that great, the sheer potential of the man brought him into the senior national side. He made his T20I debut for West Indies against Pakistan in 2018 in Karachi. Odean did not get many chances at the international level in his initial days but continued to improve his game. His performances in the Caribbean Premier League also improved and he also played in other T20 leagues around the world. Odean Smith got back into the West Indies side again in 2021 as a much-improved player and also made his ODI debut against Ireland in 2022. He took 2 wickets and scored 18 runs on his debut and smashed 46 off just 19 balls in his second ODI. Smith was bought by Punjab in the mega auction ahead of the 2022 season of the Indian T20 League. Odean Smith is a typical West Indian powerhouse who can clear the fence with his sheer power. His pace bowling is also quite sharp and that makes him a great asset for the Windies cricket going forward.",
  "nationality": "West Indies",
  "career_span": {
    "Test": "",
    "ODI": "2022-2023",
    "IPL": "2022-2022"
  }
}