{
  "id": "pprofile_65632",
  "type": "player_bio",
  "player": "Phil Salt",
  "full_name": "Philip Dean Salt",
  "dob": "August 28, 1996",
  "role": "Wicket-Keeper",
  "batting_style": "Right Handed",
  "bowling_style": "Off break",
  "teams": [
    "England",
    "Lancashire",
    "Royal Challengers Bengaluru",
    "Kolkata Knight Riders",
    "Delhi Capitals",
    "Sussex",
    "Adelaide Strikers",
    "Perth Scorchers",
    "Chattogram Challengers",
    "England Lions",
    "Barbados Royals",
    "Islamabad United",
    "Lahore Qalandars",
    "Punjabi Legends",
    "Qalandars",
    "Team Abu Dhabi",
    "Manchester Originals",
    "Dambulla Sixers",
    "Kandy Falcons",
    "Lancashire CCC",
    "Pretoria Capitals",
    "Desert Vipers",
    "Abu Dhabi Knight Riders"
  ],
  "bio": "Phillip Salt, born on August 28th, 1996, is a right-handed top-order batter who represents the England cricket team. His journey in cricket began after receiving a scholarship to play the sport at Reed School, which led him to give up football and focus solely on cricket. Initially, Salt didn't make significant waves in the local cricket scene until 2018, despite making his first-team debut in 2015. Born in Bodelwyddan, he showcased his potential with impressive performances, including scoring two hundreds in the Championship, notably a remarkable 148 off just 138 deliveries against Derbyshire in the 2018 Royal One-Day Cup. Salt's aggressive batting style caught the attention of Lahore Qalandars, who invited him to participate in the Abu Dhabi T20 Trophy. He also earned a spot with Islamabad United for the Pakistan Super League's fourth season. Although he didn't feature in any games, Salt's performances for the Lions, including a stunning 58-ball ton against Ireland at the Ageas Bowl in July 2020, earned him recognition and a reserve spot for the England ODI series. In the shorter formats, Salt established himself as a star batter during his time with the Adelaide Strikers in the Big Bash League. His talent and ability to turn the tide of a match at will have earned praise from the English cricketing community. While he went unsold in the Indian Premier League 2024 mini-auction, he was later signed by Kolkata at his reserve price of 1.50 crore INR after Jason Roy decided to skip the tournament. He grabbed that opportunity with both hands, smashing 435 runs in 12 games at a strike rate of 182. Despite missing the playoffs due to international commitments, he played a big role for Kolkata in lifting the trophy. Salt continued his good form at the international level and established himself as one of the most destructive openers in modern cricket. In the 2023-24 white-ball tour of the West Indies, he made his maiden T20I ton in the third T20I. He also became the first Englishman to score two centuries in T20Is and only the third batter in the world to hit back-to-back tons in T20 cricket. His impressive performances fetched him a whopping INR 11.50 crores as he was bought by Bengaluru for the 2025 Indian Premier League. Leading up to the Champions Trophy, Salt had a quiet ODI series against India. His struggles continued at the global event, where he managed a highest score of just 12 across three innings as England crashed out in the group stage.",
  "nationality": "England",
  "career_span": {
    "Test": "",
    "ODI": "2021-2025",
    "IPL": "2023-2025"
  }
}