{
  "id": "pprofile_66081",
  "type": "player_bio",
  "player": "Josh Little",
  "full_name": "Joshua Brian Little",
  "dob": "November 1, 1999",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Left-arm fast medium",
  "teams": [
    "Ireland",
    "Ireland A",
    "Middlesex",
    "Ireland Under-19",
    "Trinbago Knight Riders",
    "Leinster Lightning",
    "Bangla Tigers",
    "Multan Sultans",
    "Northern Warriors",
    "Ireland Wolves",
    "Dublin Chiefs",
    "Deccan Gladiators",
    "Manchester Originals",
    "Welsh Fire",
    "Dambulla Sixers",
    "Gujarat Titans",
    "Pretoria Capitals",
    "Abu Dhabi Knight Riders",
    "Los Angeles Knight Riders",
    "Grand Cayman Jaguars"
  ],
  "bio": "Joshua Brian Little, born 1st November 1999, a fiery pace spearhead from Ireland, is a tall left-arm fast bowler who creates a lot of problems for the opposition batters with his ability to swing the ball and extract seam movement. Josh Little came to prominence through Cricket Ireland's development program. He began playing softball cricket at the age of ten at St Andrew's Primary School. Little was also a field hockey player for the Monkstown Hockey Club. He even played at the age group level for the Irish Under-16 field hockey team, which is part of the Irish national team. He was a net bowler when he was 16 years old for the Ireland national team for the series against Sri Lanka in 2016. In the Under-19 T20I World Cup 2016, he was exceptional with his performance as he picked up 11 wickets, which certainly helped him to forward his career to get into the senior team of Ireland. He made his Twenty20 International debut against Hong Kong in September 2016 and became the second-youngest back then to make a debut at an international level after Waqas Khan from Hong Kong. Showcasing his bowling prowess, Joshua got enlisted in the T20I squad, against Afghanistan in March, but due to obligations related to his studies, he was forced to withdraw. But he was soon named in the national squad for the 2018 Under-19 Cricket World Cup. Joshua made his debut in List A for Leinster Lighting in the June 2018 Inter-Provincial Cup. In the same month, he also made his first-class debut for the same team in 2018 2018 Inter-Provincial Championship. After his decent overall performance, Cricket Ireland awarded an Emerging Player Contract to him and four more young cricketers just before the start of the 2019 domestic season. In January 2019, Little was selected for the T20I squad for the Oman Quadrangular Series, where four countries, Oman, the host, Scotland, Netherlands, and Ireland clashed together for the trophy. After a couple of months in April, he got selected in the ODI national squad for the first time against England and the 2019 Ireland Tri-Nation Series, which was a series between Bangladesh, West Indies, and the host Ireland. He made his debut against England in May 2019. As Joshua was seeking opportunities in the national team at the same time he was getting opportunities to play international domestic cricket. In the first-ever Euro T20 Slam cricket tournament, Little was picked to play for the Dublin Chiefs in July 2019. But the competition was canceled the next month. Little was included on the Ireland Wolves roster for their Bangladesh tour in February 2021. Little was included in Ireland's preliminary team for the ICC Men's T20 World Cup in September 2021. In November of the same year, he was called to play for Dambulla Giants in the 2021 Lanka Premier League. In 2022, Chennai invited him to be their net bowler for the season 2022 of the Indian Premier League. In November against New Zealand in the 2022 T20 Cricket World Cup, Joshua picked up a hat-trick and dismissed experienced players like Kane Williamson, James Neesham, and Mitchell Santner and shook the world off the roots to steal the headlines of the newspapers. In the history of the ICC Men's T20 World Cup, Little became the sixth player and the second bowler in that tournament to record a hat-trick during the World Cup. In a T20I encounter, he also made history by becoming the second bowler from Ireland to achieve a hat-trick. In four games, he claimed seven wickets, assisting his team in making it to the Super 12. In 2022, in total, he hunted 39 dismissals and also became the second-highest wicket-taker in all T20Is. At the same time, he held the record for having the most number of dismissals by any bowler in T20Is in a single year in Irish cricketing history. In December of that year, Gujarat bought Joshua for the Indian Premier League 2023 and yet he breaks another record of being the first-ever Irish player to take part in the league and also got his debut in the same season against Chennai. He became the first Irish player to be chosen into the ICC Men's T20I Team of the Year after being named in the ICC Men's T20I Team of the Year for the Year 2022 during the 2022 ICC Awards for his outstanding efforts with the ball in T20I cricket in 2022. Soon after some months, he got picked by Multan Sultans for Pakistan Super League but because of a hamstring niggle he was ruled out. He made a comeback playing for Abu Dhabi Knight Riders in 2024 in the International T20 league. Little was also named in the Ireland squad for the 2024 T20 World Cup.",
  "nationality": "Ireland",
  "career_span": {
    "Test": "",
    "ODI": "2019-2025",
    "IPL": "2023-2024"
  }
}