{
  "id": "pprofile_5132",
  "type": "player_bio",
  "player": "Bhuvneshwar Kumar",
  "full_name": "Bhuvneshwar Kumar Singh",
  "dob": "February 5, 1990",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm medium",
  "teams": [
    "India",
    "Central Zone",
    "India A",
    "India Blue",
    "Royal Challengers Bengaluru",
    "Uttar Pradesh",
    "Pune Warriors India",
    "Sunrisers Hyderabad",
    "Noida Kings",
    "Lucknow Falcons"
  ],
  "bio": "Not many bowlers begin their careers as well as Bhuvneshwar Kumar did for India. He struck in his very first over in both ODIs and T20Is, both against Pakistan in 2012. Kumar is another one of Indian cricket's extracts from the state of Uttar Pradesh. His predecessors were Praveen Kumar and RP Singh. Kumar is well renowned for his ability to swing the ball both ways. Bhuvneshwar got his name etched in the history books when he dismissed Sachin Tendulkar for a duck in first-class cricket. He didn’t get many opportunities in Tests but showed his true skills when he picked up his first five-for in the Nottingham Test in 2014. Another five-for followed in the next Test, which India won at Lord’s, which also put his name on the Lord’s Honours Board. He ended up taking 19 wickets in five matches besides scoring 247 runs with the help of three fifties. Things appeared rosy for Bhuvi at that time, but soon the pressure of international cricket got to him. He failed to cope with the extra workload, and it started to reflect in his bowling. He struggled and didn’t take wickets as easily as he did before. Consequently, Kumar lost his place in the side as he thrived at an extra pace and, in the process, lost his main weapon, i.e., swing. After beginning with Bengaluru and a stint with Pune, it was with the Hyderabad franchise in 2014 where he started to get his mojo back. There were talks about him being only a new-ball bowler, but he toiled hard to better his bowling with the old ball and came out triumphant, acquiring the quality to bowl fast yorkers at the death. Kumar established himself as a vital bowler for Hyderabad, securing consecutive Purple Caps in 2016 and 2017 while playing a crucial role in their maiden title triumph in 2016. However, persistent injuries disrupted his career, limiting his Test appearances after 2018 and impacting his performances in ODIs and T20Is. Although he made sporadic comebacks, including spearheading India's bowling attack during the 2021 tour of Sri Lanka, a drop in pace led to his exclusion from the squad after the 2022 T20 World Cup. His association with Hyderabad ended in 2024, and despite being out of the national setup for a while, his vast experience remained highly valued. Bengaluru secured his services at the 2025 IPL auction for INR 10.75 crore, bringing him back to his first-ever IPL franchise.",
  "nationality": "India",
  "career_span": {
    "Test": "2013-2018",
    "ODI": "2012-2022",
    "IPL": "2011-2025"
  }
}