{
  "id": "pprofile_74761",
  "type": "player_bio",
  "player": "Tristan Stubbs",
  "full_name": "Tristan Stubbs",
  "dob": "August 14, 2000",
  "role": "Wicket-Keeper",
  "batting_style": "Right Handed",
  "bowling_style": "Off break",
  "teams": [
    "South Africa",
    "Durham",
    "Eastern Province",
    "South Africa A",
    "Delhi Capitals",
    "Mumbai Indians",
    "Warriors",
    "St Kitts and Nevis Patriots",
    "Manchester Originals",
    "Jaffna Kings",
    "Sunrisers Eastern Cape"
  ],
  "bio": "In the dynamic world of cricket, certain players emerge who challenge traditional boundaries, embodying a new era of fearless and intelligent batting. These modern-day cricketers possess an extraordinary blend of technical skill and game awareness that sets them apart. Within this exciting landscape, young Tristan Stubbs stands out as a prime example of this evolving breed of cricketers. As a wicket-keeper right-handed batter, Stubbs launched his professional journey at a very early age. He demonstrated early promise in South African youth cricket, emerging as the leading run-scorer at the 2018 Khaya Majola Cricket Week, an Under-19 tournament. Although he missed selection for the SA Under-19 squad, his talent was recognized, leading to his provincial debut for Eastern Province in January 2020. He also made his List-A debut the same year playing for the same team in the One-Day Provincial Challenge, while his T20 debut came following that in the CSA T20 Challenge playing for the Warriors. Before national selection, Stubbs was acquired by the Mumbai franchise in the 2022 Indian T20 League. His career trajectory further ascended when he secured his first opportunity to represent South Africa in a T20I series against India that same year, marking a pivotal moment in his emerging international cricket journey. He was soon picked up by the Delhi franchise for the 2024 season where he emerged as the second-highest run scorer of the season and marked his arrival in style, but before that, he received the coveted ODI call-up in 2023 against West Indies. Sooner, Stubbs became an all-format player as he debuted in the Tests against India in 2024 and also became an obvious choice in the T20 World Cup the same year.",
  "nationality": "South Africa",
  "career_span": {
    "Test": "2024-2025",
    "ODI": "2023-2025",
    "IPL": "2022-2025"
  }
}