{
  "id": "pprofile_65861",
  "type": "player_bio",
  "player": "Zeeshan Ansari",
  "full_name": "Zeeshan Ansari",
  "dob": "December 16, 1999",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Leg break googly",
  "teams": [
    "India Under-19",
    "Uttar Pradesh",
    "Sunrisers Hyderabad",
    "LDA Coaching Centre",
    "Lucknow Falcons",
    "Meerut Mavericks"
  ],
  "bio": "Zeeshan Ansari, a promising leg-spin bowler from India, has been making waves in the domestic circuit with his impressive performances. Known for his leg break googly, Ansari has shown a knack for taking crucial wickets and maintaining a tight economy rate. His journey began with the India Under-19 team, where he showcased his potential in the ICC Under-19 World Cup 2016, taking seven wickets in six matches at an average of 24.42. His best bowling figures of 2-1 against Bangladesh Under-19 highlighted his ability to deliver under pressure. Despite not having made his mark in international cricket yet, Ansari's domestic performances have been noteworthy. In the Ranji Trophy, he has taken 17 wickets in five matches, with a best of 3-33 against Tripura. His bowling average of 30.76 and economy rate of 3.65 in first-class cricket reflect his consistency and control. In the shorter format, Ansari has been a key player in the Uttar Pradesh T20 League, where he claimed 29 wickets in 20 matches, including a five-wicket haul against Kanpur Superstars. Ansari's career statistics in domestic cricket are impressive. In first-class cricket, he has played five matches, taking 17 wickets with an average of 30.76. In T20s, he has played 20 matches, taking 29 wickets at an average of 15.93 and an economy rate of 7.94. His best performance came in the Uttar Pradesh T20 League, where he took 5-26 against Kanpur Superstars, showcasing his match-winning capabilities. As Ansari continues to hone his skills, his leadership potential and match-winning performances in domestic cricket suggest a bright future. His ability to perform in high-pressure situations, as seen in the Uttar Pradesh T20 League, indicates his readiness for bigger challenges. And seeing this, Sunrisers Hyderabad even picked him up in the mega auction for the 2025 IPL season. In conclusion, Zeeshan Ansari is a young talent with immense potential. His performances in domestic cricket have laid a strong foundation for a promising career, and with continued hard work and dedication, he is poised to become a key player for India in the future.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "",
    "IPL": "2025-2025"
  }
}