{
  "id": "pprofile_66812",
  "type": "player_bio",
  "player": "Prithvi Shaw",
  "full_name": "Prithvi Pankaj Shaw",
  "dob": "November 9, 1999",
  "role": "Batsman",
  "batting_style": "Right Handed",
  "bowling_style": "Off break",
  "teams": [
    "India",
    "India A",
    "Indian Board Presidents XI",
    "India Red",
    "Northamptonshire",
    "Rest of India",
    "West Zone",
    "Delhi Capitals",
    "India Under-19",
    "Mumbai",
    "India Under-23",
    "North Mumbai Panthers",
    "Indians",
    "Indian Oil"
  ],
  "bio": "A roaring sea, chaotic traffic, tall buildings, and a talented crop of young cricketers, this is how we describe Mumbai. And it hasn't disappointed till now as Prithvi Shaw took the torch in his hand and marched forward when he successfully led his national team to the Under-19 World Cup glory in 2018. His name was cropping up in newspapers for all the right reasons. When he was just 14, he blasted 546 off 330 balls in an innings which contained 85 boundaries and 5 maximums. He did it when he was playing for his school Rizvi Springfield in the Harris Shield. Though it's a minors' cricket competition, it has been known to produce such performances time and again. Shaw once again came into the limelight when he was a part of India's Under-19 youth Asia cup winning squad in November 2016 in Sri Lanka. Since then, his name has been put to the banners like once it was done for the then prodigy, Sachin Tendulkar. He made the comparisons even more concrete when he hit centuries in both his Ranji Trophy and Duleep Trophy debuts - a record previously held by Sachin Tendulkar. Prithvi added another feather in his cap when the Delhi-based franchise in the Indian Premier League bid Rs. 1.2 cr for the untested right-handed opening batter. His Brian Lara-esque backlift earned him a lot of plaudits as he went on to gather fans all over India in the tournament with his classy drives and flicks. In August 2018, he was called up to India's Test squad for the final two Tests against England, but he did not play. He then made his first international appearance on 4th October 2018 against the Windies in a home Test and became the second-youngest Indian after Tendulkar to make a Test century on debut. He performed really well in the second Test as well and was named the Player of the Series. Consequently, he was named in the Test squad to tour Down Under but unfortunately, a freak injury caused him to miss the first Test and then eventually the remainder of the series. Shaw's career hit a roadblock in 2019 when he was banned by the BCCI for doping violation. In the press release, it was mentioned that Prithvi had inadvertently ingested a prohibited substance which can be commonly found in the cough syrups. The young boy took it in his stride and accepted his fate with all sincerity. Prithvi still has a long road ahead of him but the signs of being a long, prosperous and triumphant career are all there. Already being acclaimed as the next big thing since Virat Kohli in the Indian cricket, Prithvi Pankaj Shaw could well write new chapters in the cricketing history.",
  "nationality": "India",
  "career_span": {
    "Test": "2018-2020",
    "ODI": "2020-2021",
    "IPL": "2018-2024"
  }
}