{
  "id": "pprofile_4276",
  "type": "player_bio",
  "player": "Manish Pandey",
  "full_name": "Manish Krishnanand Pandey",
  "dob": "September 10, 1989",
  "role": "Batsman",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm medium",
  "teams": [
    "India",
    "India A",
    "India B",
    "India Blue",
    "India Red",
    "Rest of India",
    "South Zone",
    "Royal Challengers Bengaluru",
    "Kolkata Knight Riders",
    "Delhi Capitals",
    "Mumbai Indians",
    "India Under-19",
    "Karnataka",
    "Pune Warriors India",
    "Sunrisers Hyderabad",
    "Belagavi Panthers",
    "Mysore Warriors",
    "Hubli Tigers",
    "Lucknow Super Giants",
    "Gulbarga Mystics",
    "BPCL"
  ],
  "bio": "A name that has lived rent-free in our minds but could not have a similar impact in the Indian national side. Not taking any dig at this exceptional batter, but he certainly could not reach the limits that everyone expected him to. Nevertheless, Manish Pandey came to the limelight at the very young age of 19 years, when he became the first Indian player to score a century at the biggest stage possible for any Indian youngster, the Indian Premier League. Since then, Manish Pandey has been the talking point of the town, as well as the selectors, although, the wait was a bit longer than anticipated for him to see him perform for the Men in Blue. Born in Nainital, Uttaranchal, Pandey move to Bengaluru at a very young age and has grown tremendously through age-group cricket across the domestic circuit for Karnataka. Pandey started his career as a middle-order batter but has come up the ranks with his incredible strokeplay. After his amazing stint for Bengaluru in the Indian Premier League, during the 2009 season. Pandey made his international debut after 6 long years. For those six years, he continued to grind hard in the domestic circuit and play some valuable knocks for Karnataka, which inevitably helped him grow as a player. Over the years, Pandey has played for several franchises in the Indian Premier League. One of his most important knocks came during the finals of the Indian Premier League 2014 when he was picked by Kolkata ahead for that season and well, it paid dividends at the end of it, quite literally, when his knock of 94 runs against Punjab, helped Kolkata to seal their maiden title. Pandey now comes across as a floater, he is a batter who can bat as per the team requirements. This flexibility is certainly a plus point in his gameplay, alongside his excess determination in the field. Pandey continues to shine for Karnataka in the domestic circuit, across all formats. Pandey though has always been seen as a white-ball cricketer, who hasn't made a debut for India in the red-ball format. Pandey has signed for Delhi ahead of the 16th edition of the Indian Premier League. He would hope to use this opportunity to make a louder statement and get the selectors back on their toes. It all comes down to him, and he knows that it is never an easy route. With slim outings, Pandey fell down the pecking order but has been offered a bit of a lifeline to resurrect his career by Kolkata as they added him to the roster for the 2024 edition of the Indian Premier League. He did not get many opportunities but did well whenever he played and won the title with them that season. He was then picked up by Kolkata once again for the 2025 season.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "2015-2021",
    "IPL": "2008-2025"
  }
}