{
  "id": "pprofile_4255",
  "type": "player_bio",
  "player": "Josh Hazlewood",
  "full_name": "Josh Reginald Hazlewood",
  "dob": "January 8, 1991",
  "role": "Bowler",
  "batting_style": "Left Handed",
  "bowling_style": "Right-arm fast medium",
  "teams": [
    "Australia",
    "Australia A",
    "Royal Challengers Bengaluru",
    "Chennai Super Kings",
    "Mumbai Indians",
    "New South Wales",
    "Australia Under-19",
    "Australian XI",
    "Sydney Sixers",
    "Australians"
  ],
  "bio": "Standing 6’4” tall, Josh Hazlewood is extremely unerring when it comes to his line and length and made a visible impact on his Test debut against India in the second Test in December 2014. He led his team’s attack, picking up 7 wickets in the game (including a five-for in the first innings) and led his team to a 4-wicket win in the same. Hazlewood was an early bloomer, having been selected by New South Wales at 17, when he appeared against the Kiwis in November 2008. He made his ODI debut against England at the Rose Bowl at the age of 19. Hazlewood counts Glenn McGrath as his idol and shares a few statistical similarities with the Pigeon—both making their Test debuts at the same age (23) and, in terms of picking up 100 wickets in Tests, Hazlewood achieved it in 46 innings, just one innings shy of the Aussie legend. He was impressive in the 2015 Ashes, picking up 16 wickets in the first four games, and was dropped from the last game owing to health concerns. Hazlewood starred yet again in the 2017-18 Ashes, with 21 wickets to his name in the series, which Australia won 4-0. He was a part of the Aussie squad that won the 2015 World Cup. Persistent back injuries saw him being replaced as the Test vice-captain (he was declared as the joint vice-captain following the 2018 ball-tampering scandal) as he missed the tour to UAE, the domestic series against India in 2018-19, and the following World Cup owing to the same. During India's tour of Australia in 2020-21, Hazlewood produced a spell for the ages as his figures of 5-3-8-5 destroyed India and skittled them out for just 36. Hazlewood's metronomic accuracy and relentless consistency have made him one of the finest fast bowlers of his generation, a vital asset in Australia’s modern pace legacy. One might think Hazelwood is a perfect fit for Test cricket, but he has shone in the shortest formats as well. He was acquired by Chennai for the Indian Premier League in 2020 and was part of their squad till 2021. In the mega auction of the Indian Premier League in 2022, he was roped in by Bengaluru for INR 7.75 crores. In the 2023 ODI World Cup held in India, Josh played a crucial role in Australia's title-winning campaign, finishing with 16 wickets. However, injuries remained a concern, sidelining him for a significant part of the Test series against India in late 2024 and the subsequent series against Sri Lanka in 2025. These setbacks ultimately led to his exclusion from the 2025 Champions Trophy. Despite being released by Bengaluru ahead of the 2025 IPL auction, the franchise opted to buy him back for INR 12.5 crore, reaffirming their faith in his abilities.",
  "nationality": "Australia",
  "career_span": {
    "Test": "2014-2025",
    "ODI": "2010-2024",
    "IPL": "2020-2025"
  }
}