{
  "id": "pprofile_5380",
  "type": "player_bio",
  "player": "David Warner",
  "full_name": "David Andrew Warner",
  "dob": "October 27, 1986",
  "role": "Batsman",
  "batting_style": "Left Handed",
  "bowling_style": "Leg break",
  "teams": [
    "Australia",
    "Australia A",
    "Durham",
    "Northern Districts",
    "Delhi Capitals",
    "Middlesex",
    "New South Wales",
    "Australia Under-19",
    "Australian XI",
    "Sydney Sixers",
    "Sydney Thunder",
    "Sylhet Strikers",
    "Sunrisers Hyderabad",
    "Saint Lucia Kings",
    "Karachi Kings",
    "Australians",
    "Winnipeg Hawks",
    "Brampton Wolves",
    "London Spirit",
    "Southern Brave",
    "Dubai Capitals",
    "Seattle Orcas",
    "Bulawayo Brave Jaguars",
    "Boca Raton Trailblazers"
  ],
  "bio": "A destructive, fiery left-handed opening batter from New South Wales, David Warner became the first Australian cricketer in 132 years to get into the national team without playing a first-class game. An outstanding fielder and a hard-hitting batter, he was the leading run-scorer in the 2005-06 season when the Australia Under-19s toured India. He then proceeded to play in the Under-19 World Cup. Warner's domestic career took off brilliantly as he represented New South Wales and recorded the then-highest one-day score of 165* for his team in the FR Cup, which immediately called for his selection in the Australian T20 side. He made his T20I debut in 2009 against South Africa, where he smashed a quick 89 off 43 balls and also played his first ODI in the same year. After some good performances with the bat in the T20 arena, Warner finally made his first-class debut for New South Wales in the Sheffield Shield season of 2008-09. The best was yet to come for this talented and destructive southpaw. Despite making a quiet Test debut against New Zealand in 2011, Warner shone with a maiden international ton in only his fourth innings, smashing a blazing knock of 123* and nearly taking Australia to victory single-handedly. That knock was particularly special as it showed a different side to his game, where he battled it out under pressure and showed the temperament and patience for the longest format of the game. If that showed one side, then he displayed his natural destructive abilities against India in 2012 by ripping apart the Indian bowling attack, making his then-career-best score of 180. From there on, Warner cemented his place in the Australian team but faced immense criticism for unnecessary off-field issues which often led to disciplinary actions. A major black mark on Warner's otherwise prolific career came when he allegedly had an altercation with Joe Root just before Australia's Ashes campaign in England, in 2013. He was then dropped for the first two Tests and asked to play for Australia A in their tour to South Africa. Warner, however, fought back hard with loads of runs in the Australian domestic season and contributed heavily in the return Ashes that followed Down Under. He scored 523 runs in the series, at an average of 58.11 which included two hundreds and as many fifties. His form in Test matches was extraordinary as he continued his prolific scoring. Made 543 runs in the 3-match Test series against South Africa in 2014, where he notched up twin hundreds in the Cape Town Test. He repeated this feat against India in Adelaide and what made this more special was the fact that the Aussies returned to cricket after the unfortunate death of Phillip Hughes. Warner struggled in the shorter formats though, not being able to score a century in ODIs and scoring only one half-century in T20Is in that period. He eventually regained his form and was back to his best again and won the Allan Border Medal in 2016 and 2017, becoming the fourth player after Ricky Ponting, Shane Watson, and Michael Clarke to win it back-to-back. To add to his laurels, David became the first Australian cricketer to score seven ODI tons in a calendar year (2016), joint second with Sourav Ganguly on the all-time list and only behind Sachin Tendulkar (9). The left-hander was the second-highest run-scorer for Australia in their 2015 World Cup winning campaign, with 345 runs in 8 games. That included a thumping of the Afghan side with a blazing 178 runs. This was an excellent year for David to say the least. His vital presence in the team was recognized and he was made deputy to Steven Smith in the Tests and ODIs. In the Indian Premier League, he successfully represented Delhi since the opening season before going on to lead Hyderabad to the trophy in 2016. In their title-winning season, he was the second-highest run-getter of the tournament with 848 runs. In 2015 and 2017, he was the highest scorer with 562 and 641 runs respectively. Just when it looked like things were going right for David Warner things took an unexpected turn and he had the darkest day in his cricketing life. During the third Test of Australia's tour of South Africa in 2018, Cameron Bancroft was caught tampering with the ball with a foreign object (Sandpaper). David Warner was found to be the instigator of this scandal and was banned for 12 months by Cricket Australia. This also saw him being barred from the Indian Premier League in 2018. David Warner made his comeback in 2019 and showed exemplary form in the 12th edition of the Indian Premier League where he finished as the highest run-scorer. His inclusion in the 2019 World Cup squad was never in doubt once he served his punishment. David batted like a man on a mission in the mega event and finished second in the list of the top run-scorers, just one run behind Rohit Sharma. During Australia's maiden title triumph in the 2021 T20 World Cup, David Warner was named the Player of the Tournament and the Aussies continue to benefit immensely from his presence in the top order. In 2022, Warner returned to the Delhi franchise in the Indian Premier League, and in the 2023 edition of the tournament, he was named their skipper as regular skipper Rishabh Pant was ruled out of the tournament due to an injury. Warner's journey in the Indian Premier League has been nothing short of spectacular. He emerged as one of the most successful overseas batter in League history, amassing over 6,000 runs and earning accolades such as the Orange Cap award for the highest-scoring batter in a season multiple times. Warner's impactful performances for franchises like Delhi and Hyderabad made him a marquee player in the world's premier T20 league. Warner's illustrious international career reached its twilight phase in January 2024 when he bid farewell to red-ball cricket after playing his final Test match for Australia. Throughout his career, Warner left an indelible mark on the sport, inspiring generations of cricketers with his fearless approach and unwavering passion for the game. As he transitions into retirement, Warner's legacy as one of Australia's greatest cricketers is etched in the annals of cricketing history, serving as a testament to his remarkable talent and enduring impact on the sport.",
  "nationality": "Australia",
  "career_span": {
    "Test": "2011-2024",
    "ODI": "2009-2023",
    "IPL": "2009-2024"
  }
}