{
  "id": "pprofile_3850",
  "type": "player_bio",
  "player": "Ravindra Jadeja",
  "full_name": "Ravindrasinh Anirudhsinh Jadeja",
  "dob": "December 6, 1988",
  "role": "All-Rounder",
  "batting_style": "Left Handed",
  "bowling_style": "Slow left-arm orthodox",
  "teams": [
    "India",
    "India A",
    "India B",
    "India Blue",
    "India Red",
    "Rest of India",
    "West Zone",
    "Chennai Super Kings",
    "Rajasthan Royals",
    "India Under-19",
    "Saurashtra",
    "Kochi Tuskers Kerala",
    "Gujarat Lions",
    "Indians",
    "Team B"
  ],
  "bio": "In a country like India where emotions ride high, the phrase, 'the next big thing' is used judgmentally for players at a very young age. Ravindra Jadeja was a victim of such a stereotype during his early days. It was only a few years later that the talent was truly realized by the Indian selectors and subsequently capitalized to its fullest. Glimpses of Jadeja's prodigious talent were evident in his debut First-Class game where he scored 53 for West Zone. He was consequently a member of the 2006 Under-19 World Cup side which reached the final. He made it to the 2008 edition as well where his bowling performance of 2-25 against South Africa in the final played a major role in India's acquisition of the title. A good stint in the Indian Premier League with Rajasthan under the captaincy of Shane Warne who nicknamed him 'Rockstar' and an impressive all-round show in the 2008-09 season prompted selectors to hand him an ODI debut against Sri Lanka. Though India lost, the left-hander impressed with an unbeaten 60. 2012 turned out to be a productive year for Jadeja. He was one of the marquee signings for Chennai. Jadeja hit the headlines and record books when he became the first Indian to score three triple centuries in first-class cricket. With an all-rounder's role beckoning and the series already lost to England with one game to play, Jadeja received his first Test cap in 2012. The year 2013, saw Jadeja reach greater heights as he ran through the Australian batting line-up with consummate ease in India's 4-0 clean sweep in Tests. He surged to the top in the ICC bowler's rankings in ODIs as well, going past the likes of world-class spinners like Saeed Ajmal and Sunil Narine. Constant hard work and self-belief have blessed Jadeja or 'Sir' as he is commonly known, with a regular berth in the Indian team across all the formats. During India’s home season, he bagged the Player of the Series award against Australia in 2017 to further showcase his skills as a Test bowler on surfaces which were relatively better for the batters. He then became the Number 1 bowler in the ICC Test Rankings with his teammate Ravichandran Ashwin sharing the pole position. When the Chennai franchise was suspended for two years after the 2015 season, Jadeja would go on to represent the Gujarat franchise. He returned to the reinstated Chennai team from 2018 onwards and was among the three people retained. In the 2019 World Cup, he appeared in two games and was the highest scorer for India in their Semi-Final defeat against New Zealand. After being retained for Chennai ahead of the 2022 edition, he was named the captain of the side. However, halfway through the season, he handed the captaincy back to MS Dhoni to concentrate on his game. He came back strongly in the 2023 edition of the tournament. With Chennai needing 10 runs off 2 deliveries, Jadeja emerged, captivating the Ahmedabad crowd by striking a six in the penultimate ball. He then sealed the deal with a boundary off a full toss in the final delivery, propelling Chennai to claim their fifth Indian Premier League title in spectacular fashion. Success followed Jadeja in the following year, as the seasoned all-rounder played a key role in India's triumphant campaign at the 2024 T20 World Cup in the Caribbean and the USA. Following the historic win, Jadeja announced his retirement from T20Is, joining Virat Kohli and Rohit Sharma in bidding adieu to the format. However, he confirmed that he would continue playing in the IPL and was retained by Chennai for the 2025 season.",
  "nationality": "India",
  "career_span": {
    "Test": "2012-2025",
    "ODI": "2009-2025",
    "IPL": "2008-2025"
  }
}