{
  "id": "pprofile_57239",
  "type": "player_bio",
  "player": "Akeal Hosein",
  "full_name": "Akeal Jerome Hosein",
  "dob": "April 25, 1993",
  "role": "Bowler",
  "batting_style": "Left Handed",
  "bowling_style": "Slow left-arm orthodox",
  "teams": [
    "West Indies",
    "Leeward Islands Hurricanes",
    "Trinidad & Tobago Red Force",
    "West Indies Under-19",
    "Melbourne Renegades",
    "Sydney Sixers",
    "Sunrisers Hyderabad",
    "Barbados Royals",
    "Guyana Amazon Warriors",
    "Trinbago Knight Riders",
    "Dhaka Capitals",
    "Quetta Gladiators",
    "Multan Sultans",
    "Bravo XI",
    "Delhi Bulls",
    "Southern Brave",
    "Trent Rockets",
    "Curepipe Crushers",
    "Chicago Steelpan Players",
    "QPCC I",
    "New York Strikers",
    "Joburg Super Kings",
    "Abu Dhabi Knight Riders",
    "MI Emirates",
    "Texas Super Kings",
    "Washington Freedom"
  ],
  "bio": "Akeal Hosein is a Trinidadian cricketer who represents West Indies and is a left-arm orthodox bowler. He has represented West Indies in the 2012 U-19 World Cup in Australia and made his first-class debut for Trinidad and Tobago during 2012-13 Regional Four Day Competition against Jamaica. The following season, in 2013-14, he was the Man of the Match in consecutive games where he registered figures of 6/33 and 5/34 against Windward Islands and later on scored his maiden first-class hundred against the Leewards. Hosein made his ODI debut against Bangladesh in January 2021. Soon, in the same year, Akeal was given the white-ball central contract by the Cricket West Indies for 2020-21 season. Akeal Hosein made his T20I debut against South Africa in July 2021 and was also included in the West Indies squad to play the last two T20Is against Australia. Hosein was picked to play for Barbados Tridents in the 2014 edition of the Caribbean Premier League. He represented the side till 2019 and then moved to Trinbago Knight Riders ahead of the 2020 season. He has been one of the most consistent performers in the CPL, being equally handy with the bat and a livewire on the field.",
  "nationality": "West Indies",
  "career_span": {
    "Test": "",
    "ODI": "2021-2023",
    "IPL": "2023-2023"
  }
}