{
  "id": "pprofile_4235",
  "type": "player_bio",
  "player": "Tim Southee",
  "full_name": "Timothy Grant Southee",
  "dob": "December 11, 1988",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm medium fast",
  "teams": [
    "New Zealand",
    "Essex",
    "Northern Districts",
    "Royal Challengers Bengaluru",
    "Kolkata Knight Riders",
    "Chennai Super Kings",
    "Rajasthan Royals",
    "Mumbai Indians",
    "Middlesex",
    "New Zealand Under-19",
    "Basnahira Cricket Dundee",
    "New Zealanders",
    "Vancouver Knights",
    "Brampton Wolves",
    "Birmingham Phoenix",
    "London Spirit",
    "Sharjah Warriorz"
  ],
  "bio": "With all kinds of swing in his repertoire, Tim Southee has shown significant promise since his breakthrough into the national frame of New Zealand. The Kiwis have been fortunate enough to have plenty of swing bowlers at their disposal and the duo of Trent Boult and Tim Southee were a blessing for them paving a path to their team's success in Test cricket. The right-arm fast bowler was born on 11th December 1988 in Whangarei in Northland and started his cricketing career by making his T20 debut for Northern Districts during the 2007 State Twenty20 season. Later in the year, he made his List A and first-class debuts for the Northern Districts and his performances earned him a call-up to the national side for his T20I debut against England. After this series, Southee represented New Zealand at the 2008 Under-19 World Cup where he was the second-highest wicket-taker with 17 scalps and was also named 'Player of the Tournament'. In March 2008, he made his Test debut in the home series against New Zealand. Entering the big stage as a teenager, he showed very few nerves as he ripped through England's top order in the first innings on debut, grabbing a five-wicket haul. He also proved his value with the bat by smashing 77 off just 40 balls in the second innings. In the same year, he also made his ODI debut claiming 16 wickets in his initial six games. Southee has appeared for multiple franchises in the Indian Premier League including Chennai, Mumbai, Rajasthan and Bengaluru. He was picked up by the Kolkata franchise in 2021 but despite playing just three games that season, he was re-signed in the 2022 mega auction. Southee was retained by Kolkata for the 2023 IPL season but featured in only a couple of games. Later in the year, during the ODI World Cup, he played just four matches but made a significant impact by claiming seven wickets, proving his value even with limited opportunities. In 2024, Southee decided to retire from Test cricket, choosing his home ground in Hamilton as the stage for his final match, a fitting end to an illustrious career. Despite New Zealand losing the series against England, Southee enjoyed a triumphant farewell, as the Kiwis secured a resounding 423-run victory in his last Test. An interesting highlight of Southee’s Test career was his batting exploits, finishing with an impressive tally of 98 sixes in the format.",
  "nationality": "New Zealand",
  "career_span": {
    "Test": "2008-2024",
    "ODI": "2008-2023",
    "IPL": "2011-2023"
  }
}