{
  "id": "pprofile_10053",
  "type": "player_bio",
  "player": "Mitchell Starc",
  "full_name": "Mitchell Aaron Starc",
  "dob": "January 30, 1990",
  "role": "Bowler",
  "batting_style": "Left Handed",
  "bowling_style": "Left-arm fast",
  "teams": [
    "Australia",
    "Australia A",
    "Yorkshire",
    "Royal Challengers Bengaluru",
    "Kolkata Knight Riders",
    "Delhi Capitals",
    "New South Wales",
    "Australia Under-19",
    "Australian XI",
    "Sydney Sixers",
    "Australians",
    "Welsh Fire"
  ],
  "bio": "Mitchell Starc, one of the most fearsome pace bowlers of the 21st century, burst onto the scene in the 2009/10 season representing New South Wales and was soon compared to Mitchell Johnson. While both were left-arm quicks, Starc relied more on swing and deadly yorkers rather than pace and bounce. Early in his career, he struggled to secure a permanent spot in the national team due to stiff competition but gained valuable experience with Yorkshire in 2012, which helped him establish himself in Australia’s limited-overs setup. Back-to-back fifers in ODIs against West Indies in 2013 strengthened his place, but his Test career remained inconsistent. In 2014, after being criticized by Shane Warne for his performance against India, Starc found redemption in the Big Bash League, showcasing his aggressive side and earning a Test recall. From then on, his career took off, and he became one of the world’s most lethal bowlers. In the 2015 World Cup, he was named Player of the Tournament, leading Australia to victory with 22 wickets at an average of 10.18 and becoming the No. 1 ODI bowler. His red-ball dominance was also evident, finishing 2016 as the most successful pace bowler in Tests with 50 wickets. Starc returned to red-ball cricket in Australia's tour of the West Indies in June 2015 and was a key player in the Ashes series that followed. Although he struggled with an ankle injury, he remained a major threat to England. In the 2016 West Indies Tri-Series, he made his comeback from foot surgery, and later that year, he broke the record for the best bowling figures by an Australian fast bowler in Sri Lanka. Starc continued to impress, and in the 2019 World Cup, he took 5 wickets in Australia’s first match against West Indies, followed by a record-breaking third five-wicket haul at a World Cup against New Zealand. He finished the tournament with 27 wickets, the most by any bowler in a single edition. He was part of Australia's squad for the 2019 Ashes and reached several milestones, including becoming the first Australian to take 50 T20I wickets in August 2021. He played a crucial role in the 2021-22 Ashes, excelling with both bat and ball. In the 2023 ODI World Cup, he was part of Australia’s winning squad in India, picking up 16 wickets in 10 matches. In May 2024, he was named in Australia’s squad for the 2024 ICC Men’s T20 World Cup, but in the Super-8 match against India, he conceded 29 runs in an over to Rohit Sharma, marking his most expensive over in international cricket. Starc remained a core part of Australia’s Test team and had an outstanding 2024-25 Border-Gavaskar Trophy, playing a pivotal role in helping Australia win the series 3-1 after a decade-long wait. He picked up 18 wickets and contributed crucial lower-order runs. Mitchell Starc was snapped up by Delhi for a staggering 11.75 crore rupees in the 2025 IPL auction, reaffirming his status as one of the most sought-after fast bowlers in the game. With a treasure trove of wickets and countless match-winning performances to his name, Starc has cemented himself as one of the greatest pacers cricket has ever seen.",
  "nationality": "Australia",
  "career_span": {
    "Test": "2011-2025",
    "ODI": "2010-2024",
    "IPL": "2014-2025"
  }
}