{
  "id": "pprofile_63714",
  "type": "player_bio",
  "player": "Jagadeesha Suchith",
  "full_name": "Jagadeesha Suchith",
  "dob": "January 16, 1994",
  "role": "Bowler",
  "batting_style": "Left Handed",
  "bowling_style": "Slow left-arm orthodox",
  "teams": [
    "Punjab Kings",
    "Delhi Capitals",
    "Mumbai Indians",
    "Karnataka",
    "Sunrisers Hyderabad",
    "Southern Champs",
    "Mysore Warriors",
    "Bengaluru Blasters",
    "Nagaland",
    "CAG"
  ],
  "bio": "Another talented cricketer from Karanataka, a state which has provided Indian cricket with such gems, Jagadeesha Suchith is a left-arm spinner, and is someone who can also be handy with the bat in the lower-order. He burst onto the domestic scene in the 2014-15 season and also played a key role in Karnataka's victory over Bangladesh A. He showed his prowess with the bat and the ball, as in the first innings, he contributed a very useful 41 and also ended with 6 wickets for 60 runs, in the second innings. He was also a key player for Karnataka in that season's 50-over Vijay Hazare Trophy, as in 6 matches, he took 12 wickets and was overall very good with his bowling. He also showed his batting skill in the 2016 Karnataka Premier League, hitting the fastest 50 in the tournament then. Even before all these exploits, Suchith was in the spotlight due to Mumbai Indians' scouting team for the Indian T20 League before the 2015 season, after they spotted how talented he was in the Karnataka Premier League. He snared 10 wickets in 13 games that season for the Mumbai and his contribution played a part in his team winning the trophy in 2015. Jagadeesha was part of the Delhi and Punjab teams and then was snared up by the Hyderabad, in the auctions, preceding the 2021 IPL for INR 30 lakhs and if he can perform at the highest level in the upcoming competition, then a lot of opportunities could open up for the spinner.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "",
    "IPL": "2015-2022"
  }
}