{
  "id": "pprofile_67126",
  "type": "player_bio",
  "player": "Mayank Markande",
  "full_name": "Mayank Markande",
  "dob": "November 11, 1997",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Leg break",
  "teams": [
    "India",
    "India A",
    "India B",
    "India Green",
    "North Zone",
    "Rest of India",
    "Kolkata Knight Riders",
    "Rajasthan Royals",
    "Mumbai Indians",
    "India Under-19",
    "Punjab",
    "Sunrisers Hyderabad",
    "India Under-23",
    "India C",
    "BLV Blasters",
    "JK Super Strikers",
    "Team C"
  ],
  "bio": "A young sensation from Patiala, Mayank Markande is a classic right-arm leg-break bowler who can deceive the batsmen with his flighted deliveries and stunning googlies. He played for Punjab in the 2017-18 edition of the Syed-Mushtaq Ali Trophy. Out of nowhere, Mayank was picked up by the Mumbai franchise for INR 20 lakhs in the 2018 Indian Premier League auction. His impressive performance in the pre-auction trials and net sessions convinced the star-studded Mumbai coaching staff and the skipper. Straightaway, Markande was sent to make his debut in the first game of the season against Chennai. His inclusion in playing XI surprised many at the beginning but Markande proved his worth in the first match itself when he picked up a 3-wicket haul which included his life's most memorable wicket - MS Dhoni, who he dismissed with his ravishing googly. He followed it up by picking up a 4-fer against Hyderabad which also allowed him to wear the purple cap for a certain period. After an amazing display of spin bowling in the Indian T20 League, Markande's name spread like a wildfire and he was included in the India A team for the quadrangular ODI series. Markande proved to be a big asset for Punjab as he became the leading wicket-taker for them, picking up 29 wickets for his side in his maiden Ranji season. His fifer against the England Lions at the start of 2019 further proved his credentials. Markande was traded twice in the Indian T20 League, from Mumbai to Delhi, and before he could play fir Delhi, he was traded to Rajasthan in a move to swap him with Ajinkya Rahane. Mayank received a call out of the blue, this time it was to represent his national side. Mayank got his T20I cap and made his debut against Australia. However, with heavy competition in the spin department, he could not really cement his place in the side. In 2022, he was bought back by Mumbai in the IPL. The following year he moved to Hyderabad, and for the 2025 season, he was picked up by Kolkata.",
  "nationality": "India",
  "career_span": {
    "ODI": "2024",
    "IPL": "2018-2024"
  }
}