{
  "id": "pprofile_67910",
  "type": "player_bio",
  "player": "Atharva Taide",
  "full_name": "Atharva Taide",
  "dob": "April 26, 2000",
  "role": "Batsman",
  "batting_style": "Left Handed",
  "bowling_style": "Slow left-arm orthodox",
  "teams": [
    "Punjab Kings",
    "India Under-19",
    "Vidarbha",
    "Sunrisers Hyderabad",
    "India Under-23",
    "VCA Green",
    "Mumbai Customs",
    "India D"
  ],
  "bio": "There is ample demand in white-ball cricket for a left-handed batter especially one who can bowl left-arm orthodox spin. Atharva Taide is one such young player who is making a mark in the domestic circuit and has come to the notice of Indian Premier League franchises. Born on 26th April 2000 in Akola situated in the Vidarbha region of Maharashtra, Atharva played youth cricket for India U19 and came to the limelight with his performance against Sri Lanka U19 as he scored two centuries in two youth Test matches midway through 2018. He was immediately recruited by the Vidarbha side for their domestic season and justified their faith. He made his List A debut in the Vijay Hazare Trophy late in 2008 against Baroda where he opened the inning and scored a quickfire 57. Towards the end of the year, he was named as a part of India’s squad for the 2018 ACC Emerging Teams Asia Cup before making his first-class debut against Gujarat in the 2018-19 Ranji Trophy. The start of 2019 saw him make his T20 debut against Himachal Pradesh in the Syed Mushtaq Ali Trophy, a game in which he got his team off to an explosive start scoring 43 runs in just 16 balls before being run out. He continued to ply his trade in domestic competitions till he was finally picked by the Punjab franchise for the 2022 Indian Premier League. He did not play a part in the competition and was released, only to be bought again by the same team for the 2023 edition. He got his opportunity in that season playing 7 matches and also scored two eye-catching half-centuries. Taide was exceptional in the Syed Mushtaq Ali Trophy 2023 for Vidarbha scoring 302 runs in just 7 games with a high strike rate. His domestic performances made him get ample game time for the Punjab team in the 2024 Indian Premier League. However, he was released by Punjab and it was Hyderabad who picked him up in the auction for the 2025 season. There is much expectation for him to prove himself on the world stage with his attacking batting up the order and part-time spin bowling that could make him an asset in the years to come. It is only a matter of time before a life-changing game comes his way and we get to see another talent produced in the fast-paced age of cricket.",
  "nationality": "India",
  "career_span": {
    "IPL": "2023-2024"
  }
}