{
  "id": "pprofile_4360",
  "type": "player_bio",
  "player": "Wayne Parnell",
  "full_name": "Wayne Dillon Parnell",
  "dob": "July 30, 1989",
  "role": "All-Rounder",
  "batting_style": "Left Handed",
  "bowling_style": "Left-arm medium fast",
  "teams": [
    "South Africa",
    "Durham",
    "Eastern Province",
    "Glamorgan",
    "Kent",
    "Northamptonshire",
    "South Africa A",
    "South African Invitation XI",
    "Worcestershire",
    "Western Province",
    "Royal Challengers Bengaluru",
    "Delhi Capitals",
    "Cape Cobras",
    "South Africa Under-19",
    "Sussex",
    "Warriors",
    "Pune Warriors India",
    "Sylhet Strikers",
    "Barbados Royals",
    "Dhaka Capitals",
    "Islamabad United",
    "Karachi Kings",
    "Khulna Tigers",
    "Stellenbosch Kings",
    "Kerala Knights",
    "Multan Sultans",
    "Surrey Jaguars",
    "Kabul Zwanan",
    "Northern Warriors",
    "Manchester Originals",
    "Northern Superchargers",
    "Pretoria Capitals",
    "Seattle Orcas",
    "Carolina Eagles",
    "South Africa Champions"
  ],
  "bio": "A left-hand bowling all-rounder by trade, a teenaged Wayne Parnell announced his arrival in the U-19 World Cup where he captained his country and put on impressive displays with bat and ball. Along with procuring domestic fame, it also granted Parnell a short stint in English county cricket with Kent and later a lucrative deal in the Indian T20 League first with the Delhi franchise in 2010 and then with the Pune franchise in 2011. Ahead of the 2014 season, he returned back to Delhi. Parnell made his full international debut facing a touring Australia in the five-match series. Fame quickly followed in his second outing, where a 4/25 dismantled the Aussies for a mere 131 and helped his team level the series. He later went on to pick two five-wicket hauls, one each against New Zealand and India. It was impressive enough for a Test call-up against England at home, bowling as first change in England's follow-on innings, in a match South Africa won batting once. Parnell earned a recall for the limited overs series against Pakistan in 2013 and was superb with his all-round performance. His pace had gone up a notch and with the bat too, he was able to score some crucial runs lower down the order. This helped the Proteas beat Pakistan comprehensively and as a result cemented Parnell's place in the limited over squad. With age on his side and also the experience of having led the U-19 team, Parnell could well be South Africa's future captain with many youngsters cropping up around him.",
  "nationality": "South Africa",
  "career_span": {
    "Test": "2010-2017",
    "ODI": "2009-2023",
    "IPL": "2011-2023"
  }
}