{
  "id": "pprofile_4610",
  "type": "player_bio",
  "player": "Rishi Dhawan",
  "full_name": "Rishi Dhawan",
  "dob": "February 19, 1990",
  "role": "All-Rounder",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm medium fast",
  "teams": [
    "India",
    "India A",
    "North Zone",
    "Rest of India",
    "Kolkata Knight Riders",
    "Punjab Kings",
    "Mumbai Indians",
    "Himachal Pradesh",
    "Legends of Rupganj",
    "Agrani Bank Cricket Club",
    "Food Corporation of India",
    "Samp Army",
    "Chhattisgarh Warriors",
    "Rest of Asian Stars",
    "Trans Titans",
    "Grand Cayman Falcons"
  ],
  "bio": "Considered by many as one of the best players to have played for Himachal Pradesh, Rishi Dhawan has time and again proved his worth with both the bat and the ball in the domestic circuit. Born on 19th February 1990 in Mandi in Himachal Pradesh, Rishi started as an opening batter at the junior levels and over time developed into a seam-bowling all-rounder. He initially came into the limelight in 2006 when he scored 340 runs for Himachal Pradesh U19 against Railways U19 in the Cooch Behar Trophy and he was just 16 years of age. His exploits at the junior level got him into the senior squad the following year and he made his T20 debut against Delhi in the Inter-State Twenty-20 Tournament. At the start of 2008, he made his List A debut for the senior side against Services in the Vijay Hazare Trophy claiming his maiden domestic wicket, and soon his bowling began taking prominence. He was part of the squad for the Punjab franchise in the 2008 Indian Premier League but did not play a single game. He made his first-class debut towards the end of 2009 against Tamil Nadu in the Ranji Trophy Super League. His consistent performances in the white-ball domestic tournaments got him a contract with the Mumbai franchise for the 2013 Indian Premier League. He played a handful of games for them and had done enough to impress the Punjab franchise who picked him for INR 3 crores in the 2014 auction. He finished the 2013-14 Ranji Trophy as the highest wicket-taker with 49 dismissals in 8 games and this got him called up for the India A squad for the limited-overs series against Australia A midway through 2014. He continued his good form in the domestic circuit by claiming 40 wickets in the 2014-15 Ranji Trophy and this got him in contention for national selection. He made his debut against Australia at the start of 2016 away from home and midway through the year made his T20I debut against Zimbabwe. He was released by the Punjab franchise ahead of the 2017 IPL auction which allowed the Kolkata franchise to buy him but he did not play any game that season. They let go of him and he failed to find a team for a few years after that.Considered by many as one of the best players to have played for Himachal Pradesh, Rishi Dhawan has time and again proved his worth with both the bat and the ball in the domestic circuit. Born on 19th February 1990 in Mandi in Himachal Pradesh, Rishi started as an opening batter at the junior levels and over time developed into a seam-bowling all-rounder. He initially came into the limelight in 2006 when he scored 340 runs for Himachal Pradesh U19 against Railways U19 in the Cooch Behar Trophy and he was just 16 years of age. His exploits at the junior level got him into the senior squad the following year and he made his T20 debut against Delhi in the Inter-State Twenty-20 Tournament. At the start of 2008, he made his List A debut for the senior side against Services in the Vijay Hazare Trophy claiming his maiden domestic wicket, and soon his bowling began taking prominence. He was part of the squad for the Punjab franchise in the 2008 Indian Premier League but did not play a single game. He made his first-class debut towards the end of 2009 against Tamil Nadu in the Ranji Trophy Super League. His consistent performances in the white-ball domestic tournaments got him a contract with the Mumbai franchise for the 2013 Indian Premier League. He played a handful of games for them and had done enough to impress the Punjab franchise who picked him for INR 3 crores in the 2014 auction. He finished the 2013-14 Ranji Trophy as the highest wicket-taker with 49 dismissals in 8 games and this got him called up for the India A squad for the limited-overs series against Australia A midway through 2014. He continued his good form in the domestic circuit by claiming 40 wickets in the 2014-15 Ranji Trophy and this got him in contention for national selection. He made his debut against Australia at the start of 2016 away from home and midway through the year made his T20I debut against Zimbabwe. He was released by the Punjab franchise ahead of the 2017 IPL auction which allowed the Kolkata franchise to buy him but he did not play any game that season. They let go of him and he failed to find a team for a few years after that. He was the leading run-scorer for Himachal Pradesh in the 2018-19 Ranji Trophy getting 519 runs in 8 games and at the end of 2021 he became a State hero by leading his side to their maiden domestic title. Himachal Pradesh beat Tamil Nadu in the final of the Vijay Hazare Trophy with Rishi ending the tournament as the second-highest run-scorer with 458 runs at an average of 76 and the second-highest wicket-taker with 17 wickets in the 8 games they played. This performance prompted the Punjab franchise to buy him once again in the 2022 auction and he performed decently which made them retain him for the 2023 edition. In the 2023 season, he could only get a handful of games, but his consistent performances for Himachal Pradesh with the bat and ball along with his leadership skills made Punjab retain him again for the 2024 Indian Premier League. He was the leading run-scorer for Himachal Pradesh in the 2018-19 Ranji Trophy getting 519 runs in 8 games and at the end of 2021 he became a State hero by leading his side to their maiden domestic title. Himachal Pradesh beat Tamil Nadu in the final of the Vijay Hazare Trophy with Rishi ending the tournament as the second-highest run-scorer with 458 runs at an average of 76 and the second-highest wicket-taker with 17 wickets in the 8 games they played. This performance prompted the Punjab franchise to buy him once again in the 2022 auction and he performed decently which made them retain him for the 2023 edition. In the 2023 season, he could only get a handful of games, but his consistent performances for Himachal Pradesh with the bat and ball along with his leadership skills made Punjab retain him again for the 2024 Indian Premier League.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "2016-2016",
    "IPL": "2013-2024"
  }
}