{
  "id": "pprofile_68173",
  "type": "player_bio",
  "player": "Chetan Sakariya",
  "full_name": "Chetan Sakariya",
  "dob": "February 28, 1998",
  "role": "Bowler",
  "batting_style": "Left Handed",
  "bowling_style": "Left-arm medium fast",
  "teams": [
    "India",
    "Rest of India",
    "West Zone",
    "Kolkata Knight Riders",
    "Delhi Capitals",
    "Rajasthan Royals",
    "Saurashtra",
    "Aryan Sorath Lions",
    "Zalawad Strikers"
  ],
  "bio": "Chetan Sakariya is a left-arm medium-pace bowler from India. He can generate a decent pace and swing the ball both ways. He hails from a village called Vartej, which is located on the outskirts of Gujrat. Sakariya belongs to a family that struggled financially, and it was a senior player on the Saurashtra team, Sheldon Jackson, who bought him new shoes and helped him attend the MRF Pace Foundation. He impressed with his pace and found himself on the domestic team. Sakariya made his first-class debut for Saurashtra in the 2018 Ranji Trophy season and picked up a five-wicket haul in the first innings. He played his first List A game in the same year as well and picked up a couple of wickets. He made his Twenty20 debut for Saurashtra in the 2018–19 Syed Mushtaq Ali Trophy. He put in some decent performances for Saurashtra, which helped him get a contract from Rajasthan for the 2021 Indian Premier League. He had a good season for them, picking up 14 wickets in 14 games, which put him closer to national selection. Sakariya made his ODI and T20I debuts on the tour of Sri Lanka in 2021. However, he failed to capitalize on his opportunities and was dropped off the team. In 2022, he was bought by Delhi but did not get that many games in the Indian Premier League. He was picked by Delhi again for the 2023 season. Sakariya has the potential and the age, but he needs to work on himself and produce consistently at the domestic level to get back in the mix to play for India. After a bit of a torrid time, he did get picked up by Kolkata for the 2024 edition of the Indian Premier League, and even though he played as a bit-part player, he won the title with them. Ahead of the 2025 season, he went unsold at the auction but due to an injury to Umran Malik, Kolkata bagged him in as replacement.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "2021-2021",
    "IPL": "2021-2025"
  }
}