{
  "id": "pprofile_58101",
  "type": "player_bio",
  "player": "Reece Topley",
  "full_name": "Reece James William Topley",
  "dob": "February 21, 1994",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Left-arm fast medium",
  "teams": [
    "England",
    "Essex",
    "England XI",
    "Hampshire",
    "Surrey",
    "Royal Challengers Bengaluru",
    "Mumbai Indians",
    "England Under-19",
    "Sussex",
    "Melbourne Renegades",
    "Sylhet Strikers",
    "England Lions",
    "Islamabad United",
    "Bangla Tigers",
    "Multan Sultans",
    "Northern Warriors",
    "Northern Superchargers",
    "Oval Invincibles",
    "Southern Brave",
    "Team Morgan",
    "New York Strikers",
    "Durban's Super Giants",
    "Dubai Capitals",
    "MI Emirates"
  ],
  "bio": "Reece Topley, a towering left-arm medium-pacer, captured headlines at just 15 years old when he suffered an injury caused by none other than his cricketing idol, Kevin Pietersen. During a practice session, a powerful drive from Pietersen struck Topley on the head, resulting in stitches. However, as a gesture of goodwill, Pietersen gifted him a signed bat, leaving a lasting impression on the young bowler. Topley's journey began at Essex, where he made his first-class debut in 2011. He made an immediate impact, claiming a five-wicket haul against Kent and following it up with another stellar performance against Middlesex. Despite his cricketing commitments, Topley prioritized his studies, taking a mid-season break to focus on his exams. During this hiatus, he received a call-up to the England U-19 squad for their tour of South Africa in 2011. The talented left-armer further showcased his potential in the U-19 World Cup in 2012, emerging as the tournament's top wicket-taker with 19 scalps. His performances earned him a spot in the Lions squad for their tour down under in 2013, where he continued to impress, amassing over 80 wickets across all formats for Essex. Topley's international breakthrough came in 2015, when he earned his maiden ODI and T20I caps against Australia. Despite initial success, injuries plagued his career, including a broken hand and stress fractures, sidelining him for significant periods. However, he demonstrated resilience, making a comeback and delivering standout performances for Sussex in the T20 competition. In 2021, Topley returned to the England side, showcasing his skills with a two-wicket haul against India. He continued to excel, achieving a career milestone with a remarkable six-wicket haul against India in 2022, setting a new record for England in an ODI match. He declined an opportunity to join the Chennai squad for the 2021 Indian Premier League due to COVID concerns and instead represented the Oval Invincibles in the inaugural Men's Hundred. His performances earned him a place in the England squad for the 2022 World T20, although a late injury ruled him out of the tournament. The year changed, but Reece Topley's battle with injuries persisted. His unfortunate streak began with a shoulder dislocation during Bengaluru's campaign opener against Mumbai in the 2023 Indian Premier League, forcing him out of the tournament prematurely. Subsequently, a fracture on his index finger sidelined him midway through the 2023 ODI World Cup, dealing a significant blow to England's title defence. Despite these setbacks, Topley's resilience and determination earned him a place in the England squad for the 2024 T20 World Cup. He was also picked up by Mumbai for the 2025 Indian Premier League season. Topley's journey serves as a testament to the spirit of a true fighter, inspiring others with his unwavering commitment to overcoming adversity and contributing to his team's success.",
  "nationality": "England",
  "career_span": {
    "Test": "",
    "ODI": "2015-2024",
    "IPL": "2023-2025"
  }
}