{
  "id": "pprofile_69274",
  "type": "player_bio",
  "player": "Maheesh Theekshana",
  "full_name": "Morawakage Maheesh Theekshana",
  "dob": "August 1, 2000",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Off break",
  "teams": [
    "Sri Lanka",
    "Colts Cricket Club",
    "Sri Lanka Army Sports Club",
    "Chennai Super Kings",
    "Rajasthan Royals",
    "Barbados Royals",
    "Trinbago Knight Riders",
    "Galle",
    "Northern Warriors",
    "Deccan Gladiators",
    "Galle Marvels",
    "Jaffna Kings",
    "SLC Blues",
    "SLC Reds",
    "SLC Greys",
    "Chennai Brave Jaguars",
    "Morrisville Samp Army",
    "Joburg Super Kings",
    "Sharjah Warriorz",
    "Cape Town Samp Army"
  ],
  "bio": "Maheesh Theekshana is a Sri Lankan international cricketer who was born on 1 August 2000 in Colombo. Theekshana is a right-arm off-break bowler who has represented the senior national team in all formats of the game. Theekshana grew up in Sedawatta with his grandmother, but they were requested to move to Kotahena, allowing Theekshana to play school cricket representing St. Benedict's College. The Cricket Wing of St. Benedict's volunteered to look after his finances in the first two years, and later St. Benedict's College granted him a scholarship offer. He repaid the faith by winning the All Island Best All-Rounder Award during his final year at St. Benedict's College. After having impressed with the ball at the school level, he was called for trials by the National Cricket Academy at R. Premadasa Stadium. He subsequently impressed the spin bowling coaches and director of cricket at the National Cricket Academy, Simon Willis, with his control, accuracy, bounce, and variations in addition to his Ajantha Mendis-like bowling action. He was omitted from the Sri Lankan U-19 squad for the 2018 Under-19 World Cup on the basis of fitness issues. He joined the Sri Lanka Army in 2020, which transformed him completely as he began adhering to strict food diets and worked hard on improving his fitness levels. He also subsequently reduced his weight as per the level of expectations levelled on him in order to pursue his cricketing ambitions. By 2020, he had dropped 22 kilograms and halved his skinfold levels. He also improved his two-kilometre run within 10 minutes and improved his YOYO test maximum from 16.1 to 19.2. He trained under Ajantha Mendis, who was his first coach with the Sri Lanka Army when he joined the Army's U-23 side. His breakthrough came in 2021 when he made his ODI debut against South Africa. Theekshana's ability to deliver under pressure saw him earn a place in Sri Lanka’s T20I squad, where he became a crucial weapon in their spin attack. His performances in the 2021 T20 World Cup helped Sri Lanka progress through the qualifiers, and he soon became a regular across formats. In franchise cricket, Theekshana made his mark in the Lanka Premier League, consistently delivering standout performances. His success caught the attention of IPL franchises, and Chennai secured his services for the 2022 season. He played a vital role in CSK’s campaigns, helping them clinch the 2023 IPL title with his economical spells and crucial breakthroughs. Theekshana played a key role in Sri Lanka's 2022 Asia Cup-winning campaign, forming a potent partnership with Wanindu Hasaranga. However, injuries hampered his form in the 2023 ODI World Cup, where Sri Lanka struggled. In 2024, he continued to shine in T20 leagues worldwide, featuring in the SA20 for Joburg Super Kings and Major League Cricket for Texas Super Kings. His performances reaffirmed his status as one of the most sought-after spinners in the shortest format. Despite Sri Lanka’s early exit from the 2024 T20 World Cup, Theekshana remained a bright spot in their campaign. In the IPL, he continued to be a crucial cog for Chennai but was released ahead of the 2025 auction. Rajasthan, known for investing in spinners, secured his services.",
  "nationality": "Sri Lanka",
  "career_span": {
    "Test": "2022-2022",
    "ODI": "2021-2025",
    "IPL": "2022-2025"
  }
}