{
  "id": "pprofile_74400",
  "type": "player_bio",
  "player": "Will O'Rourke",
  "full_name": "William Peter O'Rourke",
  "dob": "August 6, 2001",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm fast",
  "teams": [
    "New Zealand",
    "Canterbury",
    "New Zealand A",
    "Yorkshire",
    "New Zealand Under-19",
    "New Zealand XI",
    "Lucknow Super Giants"
  ],
  "bio": "William O'Rourke, born in London, England, is a cricketer with roots tracing back to New Zealand. Hailing from Kingston upon Thames in London, O'Rourke inherited his cricketing prowess from his lineage. His father, Paddy O'Rourke, made waves as a fast bowler for Wellington, while his uncle, Matthew O'Rourke, left his mark with a solitary senior appearance for Auckland. O'Rourke's cricketing journey took flight early on, representing Auckland in age-group competitions before relocating to the South Island for his tertiary education at the esteemed University of Canterbury. His meteoric rise caught the attention of selectors, earning him a spot in New Zealand's squad for the 2020 Under-19 Cricket World Cup. Following standout performances for Burnside West Christchurch University Cricket Club, O'Rourke's elevation to the Canterbury 'A' team was inevitable. Notably, he showcased his prowess with 10 wickets during the National Provincial A Tournament. In January 2021, O'Rourke's talent was on full display as he donned the New Zealand XI jersey in two T20 matches against the touring Pakistan Shaheens. Recognition followed as he secured his first domestic contract with Canterbury, marking the beginning of a promising professional career. His List A debut against Otago in January 2022, in the 2021–22 Ford Trophy, was a testament to his burgeoning talent, swiftly followed by impactful performances in T20 and first-class formats. O'Rourke's journey reached new heights in 2024 when he made his Test debut against South Africa on February 13. With four wickets in the first innings and five in the second, he had a debut to remember and was named Player of the Match in New Zealand's series-sealing win. A few months later, he was on a flight to India, where New Zealand made history by becoming the first team to inflict a Test series whitewash on India in their own backyard. In the first Test, O'Rourke played a crucial role, finishing with a match tally of 7 wickets, including four in the first innings, where the Kiwis skittled India out for just 46, setting the tone for the rest of the series. O'Rourke's ODI career didn’t take off with the same bang as his Test debut, but the promise was evident for all to see. The Kiwi selectors backed his potential and showed faith in him, rewarding him with a spot in New Zealand’s squad for the 2025 Champions Trophy.",
  "nationality": "New Zealand",
  "career_span": {
    "Test": "2024-2025",
    "ODI": "2023-2025",
    "IPL": "2025-2025"
  }
}