{
  "id": "pprofile_66799",
  "type": "player_bio",
  "player": "Abhishek Sharma",
  "full_name": "Abhishek Sharma",
  "dob": "September 4, 2000",
  "role": "All-Rounder",
  "batting_style": "Left Handed",
  "bowling_style": "Slow left-arm orthodox",
  "teams": [
    "India",
    "India A",
    "North Zone",
    "Delhi Capitals",
    "India Under-19",
    "Punjab",
    "Sunrisers Hyderabad",
    "Agri King's Knights"
  ],
  "bio": "India’s cricketing landscape has been enriched by a plethora of emerging talents, thanks to the country’s robust age-group structure and a series of successful campaigns in the Under-19 World Cup. Among the standout contributors to this success is the 2018 Under-19 World Cup victory, which has propelled numerous young players into the limelight. Among them, Prithvi Shaw, Shubman Gill, Abhishek Sharma, and Arshdeep Singh are some of the players who have made significant strides in Indian cricket. Abhishek Sharma, a left-handed batting all-rounder, has shown immense promise since his early days. Born in Amritsar, Abhishek began his cricketing journey playing junior cricket for his state. His talent did not go unnoticed, and in 2016, he was appointed captain of India’s Under-19 team for the Asia Cup. Under his leadership, India clinched the title, defeating Sri Lanka in the final. Abhishek made his debut in first-class and List A cricket in 2017 for Punjab, further showcasing his potential in domestic cricket. His consistent performances for India U-19 and his impressive domestic form were key reasons for his selection in the squad that won the 2018 Under-19 World Cup. Ahead of the 2018 Indian Premier League season, Abhishek was picked up by the Delhi franchise, marking his entry into the IPL. However, after a solitary season with Delhi, Abhishek was released, which opened up an opportunity for the Hyderabad franchise to acquire his services for the 2019 season. Though his initial years in the IPL were relatively quiet, Hyderabad showed faith in him, and this persistence paid dividends in 2022. Despite Hyderabad’s disappointing 8th-place finish that season, Abhishek stood out as one of the positives for the team. He amassed 426 runs from 14 matches, showcasing his consistency and adaptability, particularly in the pressure-cooker environment of the IPL. Abhishek had a quiet 2023 IPL season but regained lost ground in the domestic arena. In the 10 innings of the Syed Mushtaq Ali Trophy that season, the southpaw scored 485 runs, playing a key role in Punjab's maiden title-winning campaign. His form continued in 2024, where he was unstoppable in the IPL, forming a ruthless opening pair with Travis Head for Hyderabad. Although the team fell short in the final, Abhishek’s remarkable consistency earned him a call-up to the Indian side for the tour of Zimbabwe. Abhishek made his international debut during the series opener, where he unfortunately fell for a duck. However, he quickly made a statement in the very next game, scoring a stunning hundred and announcing his arrival on the international stage.Given the giant strides Sharma has taken in T20 cricket, particularly with his consistent performances for Hyderabad in the IPL, it was an easy decision for the franchise to retain him heading into the mega auction for the 2025 season.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "",
    "IPL": "2018-2025"
  }
}