{
  "id": "pprofile_63611",
  "type": "player_bio",
  "player": "Kagiso Rabada",
  "full_name": "Kagiso Rabada",
  "dob": "May 25, 1995",
  "role": "Bowler",
  "batting_style": "Left Handed",
  "bowling_style": "Right-arm fast",
  "teams": [
    "South Africa",
    "Gauteng",
    "Kent",
    "South Africa A",
    "Punjab Kings",
    "Delhi Capitals",
    "South Africa Under-19",
    "DP World Lions",
    "Jo'burg Giants",
    "Jozi Stars",
    "Manchester Originals",
    "KG’s Kingfishers",
    "Gujarat Titans",
    "MI Cape Town",
    "MI New York"
  ],
  "bio": "Considered by many as the future of South African fast bowling, Kagiso Rabada has all the attributes to help him achieve success. Born on 25th May 1995 in Johannesburg, the largest city in South Africa, Kagiso who hailed from a humble background was identified at an early age for his fiery pace and bounce. His talent brought about a lot of excitement in the domestic circuit and there was expectation building that he would fill the boots of several South African greats. He was roped in by Gauteng to play provincial cricket and there began his rise to supremacy. Towards the end of 2013, he made his List A debut against Border in the CSA Provincial One-Day competition and picked up two wickets in his first outing. He made his T20 debut at the beginning of 2014 against Griqualand West in the CSA Provincial T20 Challenge and picked up three wickets for just 12 runs in his 4 overs. This propelled him into the U19 squad for the 2014 U19 World Cup where he played a crucial role in his team’s victorious campaign. He bowled fast and became known as the most dangerous bowler in the competition after he dismantled the Australian U19 side claiming 6 wickets for 25 runs. He claimed 14 wickets in the tournament and bowled at an economy rate of 3.10 proving to be quite a handful for the batters. On the back of a successful tournament, he made his first-class debut in the CSA Provincial Three-Day Competition and continued his good form with the ball taking three wickets. A few months later, he was rewarded a contract with the Lions as he began his journey into franchise cricket. Things got better for Kagiso as his hard work bore dividends and he traveled with the South Africa A side to Australia. His performances and ability forced the selectors to include him in the T20I squad against Australia. He made his T20I debut in the first game but ended up with no wickets to show for in his team’s victory. He did get his maiden international wicket in the second game but was dropped for the final game. He returned home to play for his franchise in the Sunfoil Series and started 2015 with a bang as he broke Dale Steyn’s record of the best bowling figures in a first-class match in the franchise era by claiming 14 wickets for 105 runs. He was the third-highest wicket-taker in the tournament and showed his aptitude for the longer format of the game. He was included in all three squads for the tour of Bangladesh midway through the year and made his ODI debut in the first game. He had a fairy-tale beginning to his ODI career as he became just the second player in history to take a hat-trick on debut. He ended the game with the best figures for a debutant taking 6 wickets for just 16 runs and getting his maiden five-wicket haul as well. Late in 2015, he made his Test debut against India in spin-friendly conditions and played three of the four games in the series. He was unable to make much of an impact in the series but once he found himself back in South Africa in favorable conditions, he claimed three five-wicket hauls in the three-match series. In the final Test, Kagiso became the youngest South African to claim a 10-wicket haul in a Test match picking up 13 wickets for 144 runs. He continued to perform consistently in all three formats of the game and was picked for the 2016 T20 World Cup in India. He was heavily involved in South Africa’s Test series win against Australia away from home later that year. Kagiso was picked by the Delhi franchise in the Indian Premier League for the 2017 edition and was a part of the team over the next few years. He however had an issue with discipline as he faced a one-match ban against England for inappropriate language towards Ben Stokes. He was banned once again for bumping his shoulder into Steven Smith but the decision was overturned after an appeal. In 2018, he claimed the top spot in the ICC Test Rankings crossing the 900 points mark. The same year he became the youngest player at the age of 23 to claim 150 Test wickets and also was the leading wicket-taker in the calendar year picking 52 wickets. In the 2019 Indian Premier League, Kagiso played 12 games in the group stages and picked up 25 wickets before leaving for international duty. He was picked for the 2019 Cricket World Cup in England and the following year he had his best T20 stint as he topped the wicket-taking chart in the Indian Premier League claiming 30 wickets. He took part in the 2021 ICC Men’s T20 World Cup and became the first South African to take a hat-trick in T20I cricket in the final game against England. He has developed his game over the years and is an integral part of the South African squad. Having been released by Delhi ahead of the 2022 Indian Premier League mega auction, the Punjab franchise grabbed the opportunity will both hands to complete his signing for INR 9.25 crore. He claimed 23 wickets in the 13 games he played for his new franchise and it was a no-brainer for them to retain his services for the 2023 edition. He was also a part of the South Africa squad for the 2022 ICC Men's T20 World Cup towards the end of the year. He only played a handful of games for Punjab in the 2023 season but was still retained for the upcoming season. However, he enjoyed a great year for South Africa, especially in Tests. Rabada picked up his 500th international wicket in the Test series against India and became the 7th South African bowler to achieve this feat. He played for Cape Town in the 2024 South African T20 League, but could not make much impact and will be eager to do well for Punjab in the 2024 Indian Premier League and prepare for the upcoming T20 World Cup. He can swing the ball both ways but has a keen preference for bowling cross-seam deliveries allowing the pitch to create deviation. With height at his disposal, he brings a natural bounce to his deliveries and consistently bowls above 140 kph. His ability to reverse-swing the old ball makes him a lethal Test bowler and he adapts to the shorter format adequately bowling yorkers and slower deliveries.",
  "nationality": "South Africa",
  "career_span": {
    "Test": "2015-2025",
    "ODI": "2015-2025",
    "IPL": "2017-2025"
  }
}