{
  "id": "pprofile_83549",
  "type": "player_bio",
  "player": "Vignesh Puthur",
  "full_name": "Vignesh Puthur",
  "dob": "March 2, 2001",
  "role": "All Rounder",
  "batting_style": "Right Handed",
  "bowling_style": "Left-arm wrist spin",
  "teams": [
    "Mumbai Indians",
    "Dindigul Dragons",
    "India C Under-19",
    "KCA Royals",
    "KCA Tuskers",
    "KCA Lions",
    "Jolly Rovers",
    "Alleppey Ripples"
  ],
  "bio": "Vignesh Puthur, a budding all-rounder from India, is making waves in the domestic cricket circuit with his versatile skills. As a right-handed batter and a slow left-arm wrist spinner, Puthur has shown glimpses of his potential in various domestic leagues. Although he is yet to make his mark on the international stage, his performances in domestic T20 competitions have been noteworthy. In the Kerala Cricket League 2024, Puthur demonstrated his bowling prowess by taking 13 wickets in 16 matches, with an impressive average and a best bowling figure of 3-38 against BK-55. His stellar economy rate reflects his ability to contain runs in the shorter format. Despite limited opportunities with the bat, Puthur has managed to maintain a decent strike rate, showcasing his ability to contribute lower down the order. However, his primary strength lies in his bowling, where he has consistently delivered for teams like Alleppey Ripples and Jolly Rovers. Puthur's journey in domestic cricket has been defined by adaptability and determination. His standout performance in the TCM KCA Club Championship 2023, where he claimed three wickets for 38 runs, showcased his match-winning potential. His efforts didn’t go unnoticed, as Mumbai secured him at the 2025 IPL auction. With the right guidance and opportunities, he could soon transition from a promising domestic player to a key figure in Indian cricket. His journey is a testament to the depth of talent in Indian cricket, and his future endeavours will be eagerly anticipated by fans and selectors alike.",
  "nationality": "India",
  "career_span": {
    "IPL": "2025"
  }
}