{
  "id": "pprofile_64225",
  "type": "player_bio",
  "player": "Lungi Ngidi",
  "full_name": "Lungisani True-man Ngidi",
  "dob": "March 29, 1996",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm fast medium",
  "teams": [
    "South Africa",
    "Northerns",
    "South Africa A",
    "Titans",
    "Royal Challengers Bengaluru",
    "Chennai Super Kings",
    "Delhi Capitals",
    "South Africa Under-19",
    "Peshawar Zalmi",
    "Benoni Zalmi",
    "World XI",
    "Tshwane Spartans",
    "AB’s Eagles",
    "Dambulla Sixers",
    "Paarl Royals",
    "San Francisco Unicorns",
    "Seattle Orcas"
  ],
  "bio": "A tall, striking right-arm fast bowler hailing from South Africa, Lungi Ngidi can consistently touch speeds of around 140 kmph while moving the ball both ways and also has a great bouncer in him. Ngidi represented his college, Hilton, in rugby before focusing on cricket. He graduated and then enrolled in a Bachelor of Social Sciences degree in Industrial Sociology at the University of Pretoria. Ngidi made his T20 debut for the Northerns in 2015 and picked up three wickets. He was seen as a potential T20 player after finishing as the second-highest wicket-taker in the tournament. The following year, he made his first-class debut and also played his first List A game. After seeing his performances, he was promoted to the Titans team, where he played in the 2015-16 domestic T20 final, which they won, and helped them successfully defend it the following season. Ngidi made his T20I debut in 2017 against Sri Lanka, where he picked up a couple of wickets and was the player of the match. He was also added to the ODI squad but was ruled out due to an abdominal injury. In 2018, he made his Test debut against India after coming in as an injury replacement for Dale Steyn, picked up a six-wicket haul in the second innings, and was awarded the man of the match. His pace and accuracy impressed everyone, and he also perfectly set up Virat Kohli. He played his first ODI in the same series as well. In 2019, he was added to the South African squad for the World Cup. Ngidi also took a stand for his team to support the \"Black Lives Matter\" movement. In 2021, he was named to the South Africa team for the World T20, and the same happened in 2022. Ngidi was bought by Chennai for the 2018 Indian Premier League. He enjoyed a good season, picking up 11 wickets in nine matches. He performed well for the team and stayed with them until 2021, winning the title twice too. However, in 2022 he moved to Delhi, and they retained him for the following season as well. In July 2022, Lungi Ngidi blazed into the T20I scene, snatching his first-ever five-wicket haul in the series opener against England. Despite his previous achievements, Lungi Ngidi was named as a reserve player in South Africa's squad for the 2024 ICC Men's T20 World Cup tournament. Ngidi has also made his mark in franchise leagues worldwide, representing Paarl Royals in the SA20 and Seattle Orcas in Major League Cricket. For the 2025 Indian Premier League, Bengaluru secured his services for INR 1 crore. He was part of South Africa’s squad for the 2025 Champions Trophy, where the Proteas fell short in the semifinals. Ngidi made a notable impact, finishing with six wickets in three games.",
  "nationality": "South Africa",
  "career_span": {
    "Test": "2018-2025",
    "ODI": "2018-2025",
    "IPL": "2018-2025"
  }
}