{
  "id": "pprofile_63726",
  "type": "player_bio",
  "player": "Nicholas Pooran",
  "full_name": "Nicholas Pooran",
  "dob": "October 2, 1995",
  "role": "Wicket-Keeper",
  "batting_style": "Left Handed",
  "bowling_style": "Off Spin",
  "teams": [
    "West Indies",
    "West Indies A",
    "Yorkshire",
    "Punjab Kings",
    "Mumbai Indians",
    "Trinidad & Tobago Red Force",
    "West Indies Under-19",
    "Melbourne Stars",
    "Sylhet Strikers",
    "West Indies Cricket Presidents XI",
    "Sunrisers Hyderabad",
    "Rangpur Riders",
    "Barbados Royals",
    "Guyana Amazon Warriors",
    "Trinbago Knight Riders",
    "St Kitts and Nevis Patriots",
    "Islamabad United",
    "Khulna Tigers",
    "West Indians",
    "Jo'burg Giants",
    "World XI",
    "Kerala Knights",
    "Multan Sultans",
    "CWI B Team",
    "Northern Warriors",
    "Deccan Gladiators",
    "Manchester Originals",
    "Northern Superchargers",
    "Chennai Brave Jaguars",
    "Lucknow Super Giants",
    "Leatherback Giants",
    "Clarke Road United",
    "Durban's Super Giants",
    "MI Cape Town",
    "MI Emirates",
    "MI New York"
  ],
  "bio": "Nicholas Pooran is a powerful left-handed wicketkeeper batter, who has the ability to clear the boundary ropes with ease. He hails from Trinidad and displayed his hard-hitting abilities while playing for his school and a college. As a result, he was selected to play for Trinidad Red Steel in 2013 at the age of 16. Soon, he became the youngest player to play in the CPL and in his first game itself, he smashed 54 runs off 24 balls to prove his potential. Owing to his impressive performances, he was selected to play for West Indies in the Under-19 World Cup in 2014. He displayed his aggressive batting skills in the youth tournament as well and finished as one of the best players for West Indies. However, just when things were looking bright for Pooran in his cricket career, he met with a serious car accident that left him with a fractured tibia and a fractured ankle, keeping him out of cricket for more than two years. After a long recovery, Pooran returned in the best possible way. He scored over 200 runs for his side in the 2016 CPL season. As a result, he made his T20I debut for West Indies against Pakistan. But post that, he was handed a 10-month ban from playing for West Indies because he chose Bangladesh Premier League over regional cricket. Throughout his ban, he played for different T20 leagues across the globe. He was part of Islamabad United in the Pakistan Super League and Mumbai in the Indian Premier League. The stylish left-hand batter made his comeback to international cricket in 2019. He made his ODI debut in England in February 2019 and was also named in West Indies' World Cup squad in 2019. Pooran notched up his first ODI ton against Sri Lanka and ended as one of the leading run-scorers for West Indies in the mega event. After his success, Nicholas Pooran was awarded a central contract from West Indies and he cemented his spot in the shorter formats of the game. Pooran did not enjoy much success in the Indian Premier League while playing for Punjab. In the 2022 IPL Auction, Nicholas Pooran was snapped up by Sunrisers Hyderabad for a hefty ₹10.75 crore. The following year, his value soared even higher as Lucknow Super Giants secured his services for a staggering ₹16 crore in the IPL auction. Pooran was entrusted with the West Indies captaincy for the 2022 ICC Men's T20 World Cup, but it turned out to be a disappointing campaign. The team suffered an early exit in the first round, failing to qualify for the Super 12 stage after losing two out of three matches. Following the World Cup setback, Pooran stepped down as West Indies' limited-overs captain on November 21, 2022, paving the way for new leadership. In 2023, Pooran took his talents to the United States, where he was drafted by MI New York for the inaugural season of Major League Cricket. He delivered a breathtaking performance in the final, smashing 137 runs off just 55 balls to lead his team to victory. His heroics earned him the Player of the Season award, further cementing his reputation as a destructive T20 batter. In May 2024, Pooran was named in the West Indies squad for the 2024 ICC Men's T20 World Cup. During the tournament, he produced a standout performance against New Zealand, propelling his tally to 1,914 T20I runs and surpassing Chris Gayle’s 1,899 runs to become the highest run-scorer for West Indies in T20 internationals. With this achievement, Pooran has etched his name in history, solidifying his status as one of the most prolific batters in T20 cricket.",
  "nationality": "West Indies",
  "career_span": {
    "Test": "",
    "ODI": "2019-2023",
    "IPL": "2019-2025"
  }
}