{
  "id": "pprofile_69657",
  "type": "player_bio",
  "player": "Nehal Wadhera",
  "full_name": "Nehal Wadhera",
  "dob": "September 4, 2000",
  "role": "All-Rounder",
  "batting_style": "Left Handed",
  "bowling_style": "Leg break",
  "teams": [
    "India A",
    "North Zone",
    "Punjab Kings",
    "Mumbai Indians",
    "India Under-19",
    "Punjab",
    "India Green Under-19",
    "India A Under-19",
    "Reliance 1",
    "Trident Stallions"
  ],
  "bio": "Nehal Wadhera is a left-handed batter and occasional leg-break bowler who represents the Punjab cricket team in domestic competitions. He previously played for the India Under-19 cricket team. Known for his middle-order batting and a style similar to that of Yuvraj Singh, he is often referred to as the \"new-age Yuvraj Singh.\" Wadhera's career began with appearances for the Punjab Under-16 and Under-19 teams in the Vijay Merchant Trophy and Cooch Behar Trophy from 2015 to 2018, where he scored 529 runs in the 2017-18 season. He was then selected for various tiers of India’s Under-19 team. He made his Under-19 debut on 17 July 2018 against Sri Lanka in a four-day match, scoring 82 runs. Wadhera also became the third cricketer from Ludhiana to represent India at any level. In August 2018, he was named to India's squad for the 2018 ACC Under-19 Asia Cup. In April 2022, during the semi-final of the Inter-District U-23 Cricket Championship, Wadhera made headlines by scoring 578 runs in a single innings, breaking Brian Lara's record for the highest score in an innings in a four-day match. He also became the fastest player to reach 200, 300, 400, and 500 runs in any level of recognized cricket. His achievement earned him recognition from Junior Chamber International. Wadhera was included in Punjab's squad for the 2020-21 Syed Mushtaq Ali Trophy, and in December 2022, he was bought by the Mumbai franchise for INR 20 lakh to play in the Indian Premier League. In January 2023, he was selected to play for Punjab in the 2022-23 Ranji Trophy and scored a match-winning 123 runs on debut, helping Punjab secure a 380-run victory. In his third first-class match, he scored a double century, making 214 runs against Madhya Pradesh. He was named Player of the Match and finished his debut first-class season on a high. He showed glimpses of brilliance for Mumbai in the IPL but was released ahead of the auction, where he was picked up by Punjab for the 2025 season.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "",
    "IPL": "2023-2025"
  }
}