{
  "id": "pprofile_12047",
  "type": "player_bio",
  "player": "Andre Russell",
  "full_name": "Andre Dwayne Russell",
  "dob": "April 29, 1988",
  "role": "All-Rounder",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm fast",
  "teams": [
    "West Indies",
    "Jamaica Scorpions",
    "Jamaica Invitation XI",
    "Nottinghamshire",
    "Sagicor High Performance Centre",
    "West Indies A",
    "Worcestershire",
    "Kolkata Knight Riders",
    "Delhi Capitals",
    "Melbourne Renegades",
    "Melbourne Stars",
    "Sydney Thunder",
    "Khulna Royal Bengals",
    "Sylhet Strikers",
    "Knights",
    "Rangpur Riders",
    "Trinbago Knight Riders",
    "Jamaica Tallawahs",
    "Dhaka Capitals",
    "Comilla Victorians",
    "Islamabad United",
    "Quetta Gladiators",
    "Durbar Rajshahi",
    "Multan Sultans",
    "Vancouver Knights",
    "Montreal Tigers",
    "Nangarhar Leopards",
    "Northern Warriors",
    "Deccan Gladiators",
    "London Spirit",
    "Manchester Originals",
    "Southern Brave",
    "Colombo Strikers",
    "Surrey Kings",
    "Pretoria Capitals",
    "Abu Dhabi Knight Riders",
    "Royal Kings",
    "Los Angeles Knight Riders"
  ],
  "bio": "The West Indies have always had a rich history of producing hard-hitting all-rounders and they continue to produce the most brutal hitters of the cricket ball. Andre Russell is right up there when it comes to winning games with some clean hitting. Hailing from Jamaica, Andre Russell began his professional career when he made his List A debut for Jamaica against the Windward Islands in January 2007. Seen as a white ball specialist, the selectors took notice of his performances for Jamaica in the domestic circuit and surprisingly called him up for the Test side for the tour of Sri Lanka in 2010, where he made his Test debut. He was then picked in the 2011 Cricket World Cup squad, where he made his ODI debut against Ireland at Mohali. Russell was handed his T20I cap during the home series against Pakistan in April 2011. It should come as no surprise that a player of the caliber of Andre Russell has been a part of several franchises across the globe. In the Caribbean Premier League, he has been part of the Jamaica Tallawahs and the Trinbago Knight Riders. He was the mainstay of the Tallawahs during the 2013 CPL season, taking them to the CPL title in that season. Russell has been part of the Delhi and Kolkata franchises in the Indian Premier League. He played a key role in Kolkata’s title-winning campaign in 2014. He has also played for a few franchises in the Bangladesh Premier League, Pakistan Super League, and The Hundred. Andre Russell's performances have earned him significant recognition on the international stage. He was included in the ICC’s Team of the Tournament for the 2016 T20 World Cup, a testament to his all-round impact. In April 2019, Russell was named in the West Indies squad for the 2019 Cricket World Cup. During a match against Australia, he set a remarkable record, becoming the fastest batsman, in terms of balls faced, to reach 1,000 runs in 767 deliveries in One Day Internationals. On 9 July 2021, during the first T20I against Australia, Russell achieved another milestone by scoring his maiden T20I half-century. He blasted 51 runs off just 28 balls and was subsequently selected in the West Indies squad for the 2021 T20 World Cup, further cementing his place as one of the game's most explosive all-rounders. Andre Russell made a triumphant comeback to the West Indies side in 2023 after a two-year hiatus during the T20I series against England at home, where he marked his return with a standout Man of the Match performance in his first game back. In February 2023, Russell produced his highest-ever score in T20 internationals, blasting an explosive 71* off just 29 balls in the third T20I against Australia. His blistering innings not only showcased his immense power-hitting ability but also underscored his importance to the team in crucial situations. Russell's form throughout 2023 was rewarded when he was named in the West Indies squad for the 2024 ICC Men's T20 World Cup, His return to the national side, combined with his consistent performances both domestically and internationally, solidifies his role as a key figure in the Windies' plans for the big tournaments in the limited overs format. Having been a cornerstone of Kolkata’s lineup for several years, Russell continues to enjoy their trust and was retained for the 2025 IPL season at INR 12 crore after winning the title in the previous year with them. He has consistently been one of the most impactful players in the Indian T20 League, having crossed the 300-run mark in a single season several times. His explosive batting and ability to turn games on their head make him one of the most dangerous finishers in the tournament's history. This reputation ensures that expectations remain high for his performances.",
  "nationality": "West Indies",
  "career_span": {
    "Test": "2010-2010",
    "ODI": "2011-2019",
    "IPL": "2012-2025"
  }
}