{
  "id": "pprofile_63881",
  "type": "player_bio",
  "player": "Mustafizur Rahman",
  "full_name": "Mustafizur Rahman",
  "dob": "September 6, 1995",
  "role": "Bowler",
  "batting_style": "Left Handed",
  "bowling_style": "Left-arm fast medium",
  "teams": [
    "Bangladesh",
    "Asia XI",
    "Bangladesh A",
    "Khulna Division",
    "Chennai Super Kings",
    "Delhi Capitals",
    "Rajasthan Royals",
    "Mumbai Indians",
    "Bangladesh Under-19",
    "Sussex",
    "Sunrisers Hyderabad",
    "Rangpur Riders",
    "Bangladesh Central Zone",
    "Bangladesh South Zone",
    "Prime Bank Cricket Club",
    "Abahani Limited",
    "Mohammedan Sporting Club",
    "Dhaka Capitals",
    "Comilla Victorians",
    "Lahore Qalandars",
    "Durbar Rajshahi",
    "Bangla Tigers",
    "Shinepukur Cricket Club",
    "Team Abu Dhabi",
    "Tamim XI",
    "Dambulla Sixers",
    "Gazi Group Chattogram",
    "Dubai Capitals"
  ],
  "bio": "Mustafizur Rahman, the left-arm sensation hailing from a very small town called Satkhira, was born on September 6, 1995. He came to Dhaka to live his dream of becoming a fast bowler. Bursting onto the scene during BCB’s pace foundation, he was scouted for the 2014 Under-19 World Cup in UAE. His evident talent quickly garnered attention, propelling him into a regular role within Bangladesh's Under-19 squad. Representing Bangladesh in the Under-19 World Cup in 2014, he showcased his skills by claiming 9 wickets in six matches. Rahman started both his first-class and List-A career in 2014 and then got fast-tracked to tour West Indies with Bangladesh-A. Gradually, he earned the nickname 'The Fizz' for his diverse variations in his bowling, especially the slower off-cutters. He was fast tracked into his first national team selection in a T20I series against Pakistan in 2015. Rahman's breakthrough came during India's tour, marking the start of his ODI career with a memorable six-wicket haul. He followed this outstanding performance with another five-wicket haul in his second ODI, thereby becoming only the second bowler in ODI history to achieve two five-wicket hauls in their first two matches. In July 2015, following his success in limited-overs cricket, the southpaw received his maiden Test cap, marking his debut against South Africa. Remarkably, he made an immediate impact, earning the prestigious Man of the Match award for his outstanding performance. His remarkable performances caught the attention of Hyderabad, earning him an Indian Premier League contract for the 2016 season. By the end of the tournament, his exceptional skills further solidified his reputation as a rising star after winning the 'Emerging Player Award'. Mustafizur also impressed in the 2016 T20 World Cup for Bangladesh, picking up 9 wickets in 3 games. In the 2018 season, Mustafizur Rahman joined the Mumbai Indians franchise. However, the season proved to be challenging for the Bangladeshi cricketer, as he faced difficulties in meeting expectations. But he emerged as a more improved bowler in the ICC Cricket World Cup 2019 and ended up as the fourth-highest wicket-taker in the tournament with 20 wickets. Noting this, Rajasthan opted for him in 2021. He displayed consistent performance here as well, and in 2022, eventually, he got to serve Delhi for the next two seasons at a price tag of INR 2 crores. Simultaneously, Mustafizur Rahman continued to excel in both domestic and international cricket circuits. He did not take long to amass more than 100 wickets each in both T20Is and ODIs. Cut to the 2023 auctions of the Indian Premier League, the five-time champions Chennai decided to go with him at the base price of INR 2 crores. He did not get many games but his franchise won the title. In the 2024 season, he had to leave the tournament early due to international commitment and then went unsold for the next season. Rahman was also part of the 2021 and 2024 T20 World Cup squads for Bangladesh. Not only in India, he has played in many different franchise leagues across the world and has been a valuable asset for every team.",
  "nationality": "Bangladesh",
  "career_span": {
    "Test": "2015-2022",
    "ODI": "2015-2025",
    "IPL": "2016-2025"
  }
}