{
  "id": "pprofile_82969",
  "type": "player_bio",
  "player": "Umran Malik",
  "full_name": "Umran Malik",
  "dob": "November 22, 1999",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm fast",
  "teams": [
    "India",
    "India A",
    "Rest of India",
    "Kolkata Knight Riders",
    "Jammu and Kashmir",
    "Sunrisers Hyderabad",
    "India C"
  ],
  "bio": "Umran Malik is a remarkable right-arm fast bowler hailing from Jammu, India, celebrated for his incredible speed on the cricket field. Rising through the competitive cricket circuits of Jammu and Kashmir, Malik has captivated fans and selectors alike with his remarkable ability to consistently bowl at over 150 km/h, earning him the well-deserved title of 'Jammu Express'. His journey into the limelight began with the Sunrisers Hyderabad in the Indian Premier League. Making his debut in October 2021, Malik quickly made waves by delivering lightning-fast balls that set him apart from many Indian bowlers. His exceptional talent was evident, leading the team to keep him for subsequent seasons. In the 2022 IPL, he truly stood out by taking five wickets against Gujarat, earning the accolade of Emerging Player of the Tournament. In the 2022 season, Malik's performances were particularly noteworthy. He played 14 matches for Hyderabad, taking 22 wickets, making him the fourth-highest wicket-taker of the season. Following his impressive 2022 season, Malik continued to be a vital asset for the franchise. However, in the 2025 IPL season, he transitioned to the Kolkata team, bringing his fiery pace to their bowling lineup. This move was anticipated to bolster Kolkata's pace attack, adding significant depth and speed. However, his career has been affected by a lot of injuries, and unfortunately, he got injured just ahead of the start of the 2025 IPL season and was ruled out for the tournament. Malik's ascent to the international stage began when he debuted for India in a T20 International against Ireland on June 26, 2022. He made an immediate impact with impressive figures of 3/48, wrapping up his first eight T20Is with a total of 11 wickets. On November 25, 2022, he celebrated his One Day International debut by claiming his first ODI wicket, taking down Devon Conway against New Zealand. His raw speed and undeniable potential have drawn comparisons to some of the world's elite fast bowlers, adding a fierce edge to India's bowling arsenal. As he continues to hone his skills, cricket enthusiasts are not just waiting, they are eagerly anticipating the extraordinary contributions he is poised to make in both domestic and international cricket.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "2022-2023",
    "IPL": "2021-2024"
  }
}