{
  "id": "pprofile_66584",
  "type": "player_bio",
  "player": "Ruturaj Gaikwad",
  "full_name": "Ruturaj Dashrat Gaikwad",
  "dob": "January 31, 1997",
  "role": "Batsman",
  "batting_style": "Right Handed",
  "bowling_style": "Off break",
  "teams": [
    "India",
    "India A",
    "India B",
    "India Blue",
    "Rest of India",
    "West Zone",
    "Yorkshire",
    "Chennai Super Kings",
    "Maharashtra",
    "India Under-23",
    "India C",
    "Puneri Bappa"
  ],
  "bio": "Ruturaj Gaikwad was born on 31st January 1997 in Pune, Maharashtra, a state in Western India. His father, Dashrath Gaikwad, was an employee of the Defence Research Development Organisation (DRDO), and his mother, Sawita, was a teacher by profession. Despite being academic, Ruturaj's parents never forced him to pursue education over his passion for cricket. The naturally gifted opener started playing cricket at an early age and was soon outperforming his peers at the club level. This helped pave his way to represent Maharashtra, making his first-class debut in 2016. Early in 2017, he made his T20 debut in the Inter-State T20 Tournament and a few days later his List A debut in the Vijay Hazare Trophy. This tournament brought him into the limelight as he scored 444 runs in 7 matches, averaging 63.42. He ended the tournament as the third-highest run scorer, following which there were murmurs in the domestic circuit of a free-flowing batter who could play solid risk-free cricket and yet score runs at a quick pace. His consistent performance at the domestic level saw him emerge as an exciting talent, and he was integrated into the India A, India B, and India U-23 teams. Chennai identified his talent and picked him in the auction for the 2019 edition of the Indian Premier League. He made his debut for the franchise the following year, in 2020, where he was dismissed on a first-ball duck. He had an underwhelming start to his IPL career but MS Dhoni, the skipper of Chennai, persisted with him, and Ruturaj repaid the faith by scoring three half-centuries in the next three games to end the season on a high. The year 2021 saw the arrival of Ruturaj Gaikwad, a batter gifted with technique and temperament who could score quick runs through intricate strokeplay rather than power hitting. He scored his maiden Indian Premier League century that year against Rajasthan, making an unbeaten 101 off 60 deliveries. He ended the 2021 season as the highest run scorer, claiming the Orange Cap for his 635 runs and taking Chennai to their fourth title. Prior to the 2022 auction, the franchise decided to retain him for 6 crores. He made his T20I debut against Sri Lanka in July 2021. The 2021-22 season of the Vijay Hazare Trophy saw him score four hundred-plus scores, showing a rich reign of form. Ruturaj got good opportunities in white-ball cricket during the 2023-24 season but unfortunately didn't find a place in the ICC Men's ODI World Cup squad. He was handed the additional responsibility of leading the Chennai franchise for the 2024 season of the Indian Premier League after MS Dhoni announced he would be stepping down as skipper. In the 2024 edition, Chennai missed out on a playoff spot, finishing 5th in the standings.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "2022-2023",
    "IPL": "2020-2025"
  }
}