{
  "id": "pprofile_58482",
  "type": "player_bio",
  "player": "Jamie Overton",
  "full_name": "Jamie Overton",
  "dob": "April 10, 1994",
  "role": "All-Rounder",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm fast",
  "teams": [
    "England",
    "Northamptonshire",
    "Surrey",
    "Chennai Super Kings",
    "England Under-19",
    "Somerset",
    "Adelaide Strikers",
    "England Lions",
    "Karachi Kings",
    "England Cricket Board XI",
    "Team Abu Dhabi",
    "London Spirit",
    "Manchester Originals",
    "Gulf Giants"
  ],
  "bio": "Jamie Overton, a tall and fierce fast-bowler from England who can hit speeds around and above 150 clicks with the ability to get seam movement is a nightmare for batters. He is also no mug with the bat and can hold his own down the order. He rose to this point with a terrific spell against Australia in the 2012 U-19 World Cup. He made his first-class debut for Somerset in 2012. He also played his first List A game in the same year while playing his first T20 in 2015. In 2020, Overton switched alliances from Somerset to Surrey, but before moving, he scored his maiden first-class hundred in the Bob Willis Trophy. Overton first caught the eyes of the national selectors in 2013 playing for Somerset against the touring Australian side. He also made his credentials strong with a six-wicket haul against Middlesex, but a knee injury kept him out for the Lions tour of Sri Lanka. He has also played some impressive knocks with the bat and held the record for the fastest Championship half-century for a No. 11 in 2014. The next couple of seasons was riddled with injuries and he couldn't get a consistent run of games. After movie to Surrey in 2020, he hit top gear claiming 34 wickets in 10 games and 355 runs helping his side secure the title in 2022. He continued to work hard in the domestic circuit and was picked up by the Manchester Originals for the Men's Hundred. In 2023, he was named the Player of the Tournament for his all-round brilliance. He also played for the Adelaide Strikers in the Big Bash League and Gulf Giants in the ILT20. However, in 2023 while playing for the Giants, he suffered a back stress fracture that kept him out of the entire summer. 2022 was the year when Overton finally made his Test debut against New Zealand and scored a fantastic 97 in the first innings. After waiting a couple of years, and continuously performing with the white-ball, he finally played his first ODI and T20I in 2024 against West Indies and Australia respectively. He was also named in England's white-ball tour of India and the 2025 Champions Trophy squad.",
  "nationality": "England",
  "career_span": {
    "Test": "2022-2025",
    "ODI": "2024-2025",
    "IPL": "2025-2025"
  }
}