{
  "id": "pprofile_5090",
  "type": "player_bio",
  "player": "Karn Sharma",
  "full_name": "Karn Vinod Sharma",
  "dob": "October 23, 1987",
  "role": "Bowler",
  "batting_style": "Left Handed",
  "bowling_style": "Leg break googly",
  "teams": [
    "India",
    "Central Zone",
    "India A",
    "India B",
    "India Blue",
    "Indian Board Presidents XI",
    "India Green",
    "India Red",
    "Royal Challengers Bengaluru",
    "Chennai Super Kings",
    "Mumbai Indians",
    "Railways",
    "Uttar Pradesh",
    "Andhra",
    "Vidarbha",
    "Sunrisers Hyderabad",
    "DY Patil Group A",
    "Noida Kings"
  ],
  "bio": "Karn Sharma hails from Meerut, the home of industrial sports goods in India and is the third known cricketer from the place after swing architects Praveen and Bhuvneshwar Kumar. A leg spinner, Karn was picked up by Hyderabad in the 2014 Indian Premier League auctions for a whopping 3.75 crore. This, after he had a successful previous season with them in 2013, where he snapped 11 wickets from 13 matches at an ER of 6.60. He and Amit Mishra shared 32 wickets among them and pushed Hyderabad into the semis in the team’s maiden league outing. However, his domestic cricket saga was much earlier, 2007 to be precise, when he started representing Railways. His major break though came in the 2012/13 season, when he pocketed 21 wickets in just the 3 games that he played in that season and was the highest wicket-taker for his team. For the same, he was awarded by the BCCI as the ‘Best Under-25 Cricketer’. It was a season of highs for him, as he also achieved his first-class best of 8/97 against defending champions Rajasthan. In the 2014 Indian Premier League season, he justified his worth by netting a total of 15 wickets for Hyderabad. He had a modest 2015 season with 10 wickets but a forgettable one in 2016 where he went wicketless, even though his side clinched the honours that year. He was engaged by Mumbai for the 2017 season, where he delivered the goods by getting his career-best of 4/16 against Kolkata in the second Qualifier to put his team in the final. However, he was released after the season and was later lapped up by Chennai. Karn achieved a remarkable feat by securing a hat-trick of Indian Premier League titles, lifting the coveted silverware with Chennai in 2018, Mumbai in 2017, and Hyderabad in 2016. In his domestic cricket journey, Karn was initially recruited by Vidarbha for the 2017 season before Andhra snapped him up for the following year. However, he eventually returned to Railways in 2019, marking the starting point of his domestic career and has since been a pivotal member in his side’s success. On the Indian Premier League front, his appearances for Chennai were limited in the next couple of seasons since 2018 before being released by them. After warming the bench for the entirety of the 2022 Indian Premier League season with Bengaluru, Karn made a noteworthy comeback, taking 10 wickets from 7 appearances upon his return to the playing XI. With his extensive experience, Bengaluru chose to retain him for the 2024 season after which Mumbai purchased him ahead of the 2025 season.",
  "nationality": "India",
  "career_span": {
    "Test": "2014-2014",
    "ODI": "2014-2014",
    "IPL": "2009-2025"
  }
}