{
  "id": "pprofile_70746",
  "type": "player_bio",
  "player": "Jake Fraser-McGurk",
  "full_name": "Jake Matthew Fraser-McGurk",
  "dob": "April 11, 2002",
  "role": "Batsman",
  "batting_style": "Right Handed",
  "bowling_style": "Leg break googly",
  "teams": [
    "Australia",
    "South Australia",
    "Australia A",
    "Delhi Capitals",
    "Victoria",
    "Australia Under-19",
    "Melbourne Renegades",
    "Cricket Australia XI",
    "Northern Tide",
    "Melbourne Renegades Academy",
    "Dubai Capitals",
    "San Francisco Unicorns"
  ],
  "bio": "Jake Matthew Fraser-McGurk is an Australian cricketer who has quickly risen through the ranks to represent his country in One Day Internationals and Twenty20 Internationals. Known for his explosive batting, McGurk plays for South Australia, the Melbourne Renegades, Delhi, and the San Francisco Unicorns. His cricketing journey has seen him make an impact across various formats, earning accolades and establishing a reputation as one of the game's most promising young talents. McGurk's cricketing roots trace back to the Melbourne suburb of Mont Albert, where he began playing junior cricket at the age of 9 for the Boroondara Cricket Club. His natural ability and sharp cricketing instincts saw him progress through the ranks, making his first-class debut for Victoria in the 2019–20 Sheffield Shield season on November 12, 2019. Just five days later, he made his List A debut in the 2019–20 Marsh One-Day Cup, showcasing his potential early on. The following year, McGurk made his T20 debut for the Melbourne Renegades in the 2020–21 Big Bash League, further solidifying his place in Australian cricket. But it was in October 2023 that he truly made a name for himself, breaking the record for the fastest List-A hundred by scoring 100 runs off just 29 balls, surpassing AB de Villiers' previous record of 31 balls. This astonishing feat highlighted his ability to take on the best bowlers with incredible speed and flair. In addition to his success in domestic cricket, McGurk represented Australia on the international stage. He was named in the squad for the 2020 Under-19 Cricket World Cup, although his tournament was cut short after an unfortunate incident in which he was scratched by a monkey during a team trip to a nature reserve. Despite this setback, his future remained bright, and McGurk continued to rise through the ranks. The 2024 IPL season was another milestone in his career, as McGurk played for Delhi. On debut, he scored an impressive 55 off 35 balls against Lucknow. He finished the season with 330 runs in nine innings, maintaining a blistering strike rate of 234, with 32 fours and 28 sixes, further cementing his reputation as a powerful and aggressive batter. Delhi kept faith in the youngster as they roped him in yet again in the mega auction for the 2025 IPL season. In May 2024, McGurk was named as a reserve player in Australia’s squad for the 2024 ICC Men's T20 World Cup, a testament to his growing stature in Australian cricket. A few months later, he was included in the squad for a white-ball tour of England and Scotland. On September 4, 2024, McGurk made his T20I debut for Australia against Scotland. Though he was dismissed for a duck on his debut, making him the first Australian top-order batter to be dismissed for a duck on T20I debut, he quickly rebounded, scoring his maiden international half-century against England later that same month. Fraser-McGurk's journey is marked by impressive breakthroughs and the resilience to bounce back from challenges. His extraordinary ability to hit the ball to all parts of the field, combined with his adaptability and determination, positions him as one of the most exciting young talents in world cricket.",
  "nationality": "Australia",
  "career_span": {
    "Test": "",
    "ODI": "2024-2025",
    "IPL": "2024-2025"
  }
}