{
  "id": "pprofile_10130",
  "type": "player_bio",
  "player": "Ben Stokes",
  "full_name": "Benjamin Andrew Stokes",
  "dob": "June 4, 1991",
  "role": "All-Rounder",
  "batting_style": "Left Handed",
  "bowling_style": "Right-arm fast medium",
  "teams": [
    "England",
    "Canterbury",
    "Durham",
    "England A",
    "England XI",
    "Chennai Super Kings",
    "Rajasthan Royals",
    "England Under-19",
    "Melbourne Renegades",
    "England Lions",
    "Rising Pune Supergiant",
    "Northern Superchargers",
    "Team Morgan",
    "MI Cape Town"
  ],
  "bio": "Born in Christchurch, New Zealand, Benjamin Andrew Stokes or 'Ben Stokes' started his cricketing journey as an 18-year-old with Durham in England. He went on to make his first-class debut in 2010. He is a left-handed batting all-rounder who was the star performer for England in their recent ICC World Cup-winning campaign of 2019. He bowls right-arm medium-fast and is also an important bowler for them in the middle order. A product of the Durham Academy, Stokes scored a wonderful century against India in the 2010 Under-19 World Cup, before his entry into first-class cricket. He had a wonderful 2011, piling heaps of runs and taking wickets at the same time. A brilliant hundred with five sixes in an over against Hampshire, and a month later a maiden limited-overs ton proved his mettle on the domestic front. However, Stokes was struck by a broken finger injury, but he continued to play for the England Lions. He was then called up for England's ODI series against Ireland later that year. He made his debut against them in August 2011. He also made his T20I debut the same year in September against the Windies. Consistently in contention for the shorter formats for England, Stokes was selected in the England Test side for the Ashes Down Under, in 2013. Luck turned towards Stokes when Jonathan Trott was forced to return home due to stress-related illness after the first Test at the 'Gabba'. Stokes was handed his first cap as his replacement in the second Test at the Adelaide Oval. The cricketing fraternity saw what Stokes was made of in the third Test at the WACA where he scored his maiden Test ton while all the other English batsmen struggled. In the Sydney Test, he picked up his maiden 5-fer, taking six Aussie wickets albeit in a losing cause. Stokes was the silver lining in what was a disastrous series for England. Stokes did not have a good 2014 as he struggled for form and consistency throughout the year and was eventually replaced for some time by either Chris Woakes or Chris Jordan. He also missed out on the World Cup squad of 2015 as a result of his form. The tournament ended disastrously for England but that failure embarked the nation to change their playing style and the 'New England' project was set in motion. The plan was to play fearless attacking cricket and Stokes has been a major component of that project. The first major moment of Stokes' international career came when he retained his place in the England squad for the first Test against New Zealand at Lord's in 2015. After scoring 92 runs in the first innings, Stokes recorded the fastest ever Test century at Lord's and second fastest by an English batsman, taking just 85 deliveries to bring up his hundred. It was just the kick-start that his career required. He played another world-class innings in a Test match against South Africa. He came at the crease with England at 167/4 and went on to score the second fastest double century in Tests, off just 163 balls. He formed a 6th wicket partnership of 399 runs with Jonny Bairstow who himself scored unbeaten 150 runs. That series was huge for him in terms of his place in the team and he became permanent in the XI. In 2016, Stokes hit rock-bottom in his cricketing career. England reached the final of the 2016 T20I World Cup which was held in India. England was in pole position to win the cup with 19 runs required off the final over for West Indies to win and Stokes was handed the ball to defend the total. He ended up conceding four consecutive sixes off the first four balls and England were denied the trophy in the most heart-crushing fashion. However, another setback was to follow in Stokes' career in 2017. In the month of September, Stokes got involved in a controversy created by his actions. After celebrating an ODI victory in Bristol, Ben got into a fist-fight with two people outside a bar along with teammate Alex Hales. It damaged his reputation a lot as a player and he was omitted from the Ashes 2017-18 tour where England was humiliated 4-0. He was also charged with a suspension of 8 matches but the decision was later overturned by the Bristol Magistrates' Court. Ben Stokes finally had his moment in the sun when the 2019 World Cup came calling. The all-rounder showed immense form and contributed superbly with both bat and ball. The defining moment though was the World Cup final where Stokes scored unbeaten 84 runs to take his side to the Super Over where he hit 8 runs off 3 balls. He was chosen the Player of the Final but more importantly, he received the adulation from the world that a player like him deserved. Soon after that, Ben was rewarded for his maturity and was named the deputy to Joe Root for the 2019 Ashes. Stokes had to deal with a few personal issues and injuries also kept him in-and-out of the national team. He also opted out of the 2022 Indian T20 League and preferred to play county games. In the same year, when Joe Root stepped down from Test captaincy, Ben Stokes was given the charge of the Three Lions. He along with the new coach Brendon McCullum started a new era in English cricket, fondly termed as 'Baz Ball', He went on to beat New Zealand 3-0 in his first assignment and followed that with a Test win against India. On 18th July 2022, Ben shocked everyone by announcing his retirement from ODIs saying playing three formats has become 'unsustainable' for him.",
  "nationality": "England",
  "career_span": {
    "Test": "2013-2025",
    "ODI": "2011-2023",
    "IPL": "2017-2023"
  }
}