{
  "id": "pprofile_4531",
  "type": "player_bio",
  "player": "Murali Vijay",
  "full_name": "Murali Vijay Krishna",
  "dob": "April 1, 1984",
  "role": "Batsman",
  "batting_style": "Right Handed",
  "bowling_style": "Off break",
  "teams": [
    "India",
    "Essex",
    "India A",
    "India B",
    "India Blue",
    "India Green",
    "India Red",
    "Rest of India",
    "South Zone",
    "Punjab Kings",
    "Chennai Super Kings",
    "Delhi Capitals",
    "Somerset",
    "Tamil Nadu",
    "Lyca Kovai Kings",
    "Trichy Grand Cholas",
    "India Maharajas",
    "India Capitals",
    "New York Warriors",
    "Rest of Asian Stars"
  ],
  "bio": "Life is no bed of roses and Murali Vijay learnt that pretty early when he failed in his Board examinations and had to run away from his conservative upbringing to avoid ignominy. His cricketing career started pretty late though, going by competitive Indian standards. Aged 17, his major dash of cricket kicked off at college level, where he was spotted by Bharat Arun (who was then a coach with Tamil Nadu’s Ranji side). The latter ensured that the talented Vijay played at Ranji level for TN. His high in Ranji came in 2008/09 when he and Abhinav Mukund smashed a 462-run opening partnership against Maharashtra which is just 2 runs short of the all-time record of the highest opening stand in Ranji Trophy. In recognition of his efforts, Vijay was handed the Indian Test cap against Australia in the final game of the Border-Gavaskar Trophy in 2008. He was decent with the bat and impressed most with his fielding, especially in effecting the run-outs of Matthew Hayden and Michael Hussey. Murali Vijay is a player for all formats (even if his numbers for India in Limited Overs Internationals do not back that up). He has an elegant technique that is tempered with gentle pushes and taps to the ball, relying more on timing, suiting him well to red ball cricket. While at the same time, he can be a ruthless marauder of the white ball on any given day. Despite this, he has been in and out of the Test side frequently. His maiden Test hundred, coming against Australia in 2010, was a testament to his grit and patience. But in the subsequent innings, he failed to notch up a considerable score and was axed. Back in 2012/13 after strong domestic performances, Vijay managed a longer run in whites this time, with impressive performances against Australia, South Africa and England. He played the first two Tests against England in 2018 but was dropped after the second game after a pair and later sent back home, midway of the tour. He got a chance against Australia later in the same year but was dropped after 2 games, as he failed to perform once again. In the Indian T20 League, Murali Vijay has been a valuable prospect. He made his debut in the league for Chennai in 2009. In the franchise’s successful 2010 season, he collected 458 runs and was the fifth highest run-scorer in the tournament and second highest in the side. It is in this season where he got his league best of 127, tonking the ball over the ropes to long on and hoicking it over deep mid-wicket consistently throughout the game. He repeated his heroics in the 2011 finale, scoring 95 (52) batting first, which eventually won him the ‘Man of the Match’ as Chennai romped to a second consecutive league title. Vijay came to the fore again in the 2012 edition, when his 113 (58) helped Chennai trounce Delhi in Qualifier 2. He was purchased by Delhi in 2014 for 5 crores but it did not pan out as expected for the franchise, as Vijay joined Punjab in 2015 and was appointed captain later. He was bought back by Chennai in 2018 and continues to be with them since.",
  "nationality": "India",
  "career_span": {
    "Test": "2008-2018",
    "ODI": "2010-2015",
    "IPL": "2009-2020"
  }
}