{
  "id": "pprofile_66807",
  "type": "player_bio",
  "player": "Kamlesh Nagarkoti",
  "full_name": "Kamlesh Lachham Nagarkoti",
  "dob": "December 28, 1999",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm fast",
  "teams": [
    "India Emerging",
    "Leicestershire",
    "Kolkata Knight Riders",
    "Chennai Super Kings",
    "Delhi Capitals",
    "India Under-19",
    "Rajasthan",
    "India Under-23",
    "Jaipur Indians"
  ],
  "bio": "Kamlesh Nagarkoti is another one of the youth products coming through the ranks of Indian domestic cricket. He is a right-arm fast bowler who clocks speeds upwards of 140 kph regularly. He has great fitness and is very athletic on the field as well. To cap it off, he can bat too low in the order, which makes him a good player to have on any team. However, he faced rejection in the U-14 trials for Rajasthan but improved his skills and learned to swing the ball both ways to make the cut on the next attempt. He then became a regular on the age-group teams. Nagarkoti made his List A debut for Rajasthan in the 2017 Vijay Hazare Trophy. He impressed in his second-ever game, where he scored a fighting half-century and followed it up with a hat-trick to help his side to victory. Nagarkoti took 14 wickets in two youth Tests against England Under-19, including a match haul of 10 for 112 in the first Test in Chesterfield. His performance got him the chance to represent India at the 2018 U-19 World Cup. Nagarkoti impressed everyone, including a certain Ian Bishop. After a successful tournament and helping India win the title, he got himself a contract from Kolkata for the Indian T20 League. However, before the tournament, he got injured and could not play. He had to wait till 2020 to make his debut in the Indian T20 League. Injuries and a lack of opportunities put him behind the pecking order and his fellow teammates ahead. In 2022, he was bought by Delhi, but he again could not play much. He was retained by them for the 2023 season as well. Nagarkoti made his first-class debut in 2022 for Rajasthan and picked up four wickets in the match. Nagarkoti is still very young, and he needs to manage his workload and avoid any more injuries to get himself back on track. Freed by the barrage of injuries, and ready to bounce back in the arena, it was a long wait for Kamlesh Nagarkoti and was picked the Chennai Super Kings for the 2025 IPL season at the base price of INR 30 lacs.",
  "nationality": "India",
  "career_span": {
    "ODI": "2017",
    "IPL": "2020-2022"
  }
}