{
  "id": "pprofile_5407",
  "type": "player_bio",
  "player": "Harshal Patel",
  "full_name": "Harshal Vikram Patel",
  "dob": "November 23, 1990",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm medium",
  "teams": [
    "India",
    "India A",
    "India B",
    "North Zone",
    "Royal Challengers Bengaluru",
    "Punjab Kings",
    "Delhi Capitals",
    "India Under-19",
    "Gujarat",
    "Haryana",
    "Sunrisers Hyderabad",
    "India Under-23"
  ],
  "bio": "Harshal Patel is a right arm medium bowler and a right handed player, who played in the Under-19 Vinoo Mankad Trophy for Gujarat in 2008-09, capturing 23 wickets in seven matches of the season. His performances couldn't catch the state selector’s eyes, so he moved on to Haryana for better prospects. Patel was also part of the 2010 Under-19 World Cup squad. Patel has modelled himself around Glenn McGrath whom he admires for his consistent bowling. He was amongst three players who bagged a contract with Mumbai in Indian Premier League, 2011 but did not manage to get a game. His successful domestic trophy season earned him a contract with Bengaluru for the fifth edition of the IPL in 2012 and did well enough to be bought back by the same team in 2014. Harshal's career didn't take off the way he would have liked to but he continued to be a part of Haryana team in domestic cricket. After having a stint with Bengaluru, he was bought by Delhi in 2018 but prior to the 14th edition of the Indian Premier League, Harshal Patel returned to Bengaluru as he was traded by Delhi in 2021. This turned out to be his breakthrough season as he finished with 32 wickets and won the Purple Cap. His tally also included a hat-trick against Mumbai. This was also the joint most wickets in a single season, with Bravo the first to do so. This performance caught the eye of the selectors and finally, he was handed his first T20I cap against New Zealand, where he took two wickets and was awarded the player of the match award. In the 2022 Indian Premier League auctions, he was purchased by Bengaluru for 10.75 crores. In 2022, in a T20I match against South Africa, he took his then-best figures of 4/25. Harshal Patel has now established himself as a T20I specialist, and with his control over his slower variations and dipping yorkers, he is one of the first names in the Indian T20I team. However, the competition on the national side was so tough, even though he made the T20 World Cup squad for the years 2021 and 2022, but couldn't get any game time. He was then dropped from the team due to a lack of consistency and the emergence of new young fast bowlers. Patel picked up 14 wickets in 13 games for Bengaluru in the 2023 Indian Premier League but got his standards, it was an average season and he was released from the squad. However, he worked hard in the domestic circuit and was one of the key players for Haryana across all formats. He was also their leading wicket-taker in the Vijay Hazare Trophy 2023 with 19 wickets in 10 games including a three-wicket haul in the final to win the title. Looking at his form, another bidding war took place for him in the auction with Punjab ultimately bagging him for a huge amount of INR 11.75 crores. In the Indian Premier League 2024, while playing for Punjab, he won the Purple Cap by taking 24 wickets in 14 matches. His slower balls and dipping yorkers made him one of the most effective bowlers in the middle overs. He also shone in the Syed Mushtaq Ali Trophy 2024, where he picked up five wickets for just 12 runs in a match against Arunachal Pradesh. At the Indian T20 League 2025 auction, Hyderabad secured Harshal Patel for ₹8 crores. His ability to handle pressure in death-overs made him a valuable asset.",
  "nationality": "India",
  "career_span": {
    "IPL": "2012-2025"
  }
}