{
  "id": "pprofile_57041",
  "type": "player_bio",
  "player": "Jason Behrendorff",
  "full_name": "Jason Paul Behrendorff",
  "dob": "April 20, 1990",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Left-arm fast medium",
  "teams": [
    "Australia",
    "Australia A",
    "Royal Challengers Bengaluru",
    "Chennai Super Kings",
    "Mumbai Indians",
    "Middlesex",
    "Western Australia",
    "Sussex",
    "Australian XI",
    "Perth Scorchers",
    "National Performance Squad",
    "Toronto Nationals",
    "Surrey Jaguars",
    "Oval Invincibles",
    "Jaffna Kings",
    "Pretoria Capitals",
    "Western Australia XI",
    "MI New York",
    "Washington Freedom",
    "Texas Gladiators CC",
    "Ajman Bolts"
  ],
  "bio": "With the in-swing being his most potent delivery, Jason Paul Behrendorrf or simply DORRF is a tall left-arm pacer who has impressed many with his skill. Jason grew up in Canberra, the capital city of Australia but made a move to Western Australia to fulfil his lifelong dream of playing for Australia. At 6 feet 4, he is a lanky and accurate bowler and is known to bowl at any stage of the game as and when required. Behrendorff started his playing career with Australian Capital Territory. He represented them at U-17 and U-19 level. He first caught the attention of state selectors when he played for the Prime Ministers XI against the New Zealand national team in 2009. As a result, he was recruited to play for the 2009-10 season by Western Australia. He made his List A debut for Western Australia in the 2010-11 season. Due to injuries to the senior members of the squad, he kept on getting opportunities to make a mark for himself. On his Sheffield Shield debut in 2011, Dorff bagged figures of 4/76 playing against Victoria. Behrendorff was offered contracts with both Western Australia and the Perth Scorchers for the 2012–13 season due to his performances in the past year. Jason's breakout moment came in the 2014-2015 season playing in the Australian Big Bash League. Playing for Perth Scorchers, he was a pivotal part of the squad as they won consecutive BBL titles. He took 15 wickets in the tournament, just one behind top wicket-taker John Hastings. His wickets came at an average of 16.73 and an amazing economy of just 6.27 runs per over. This proved to be the launch-pad that Behrendorff's career needed. At the 2014 Allan Border Medal ceremony, he was named the 'Domestic Player of the Year'. The final push would be in 2017 when he bagged figures of 9/37 in the first innings against Victoria, the fifth-best figures ever in the Sheffield Shield. Due to the wide array of options Australia had in the pace department, Behrendorff was unable to break into the squad. Finally, in August 2017, he got his lucky break. Jason was named in the national squad to face India. He made his T20I debut against India in October 2017 and had to wait for two years for his ODI debut. Jason was also picked up in the 2019 ICC World Cup squad for Australia to partner Mitchell Starc. He took his first five-wicket haul against arch-rivals England in the group stage. However, England had the last laugh as they knocked out Australia in the semi-finals of the tournament. Following the World Cup, the 'Dorff' would be aiming to book his spot in all formats of the game for his national team.",
  "nationality": "Australia",
  "career_span": {
    "Test": "",
    "ODI": "2019-2022",
    "IPL": "2019-2023"
  }
}