{
  "id": "pprofile_3729",
  "type": "player_bio",
  "player": "Piyush Chawla",
  "full_name": "Piyush Pramod Chawla",
  "dob": "December 24, 1988",
  "role": "Bowler",
  "batting_style": "Left Handed",
  "bowling_style": "Leg break",
  "teams": [
    "India",
    "Central Zone",
    "India A",
    "India B",
    "India Blue",
    "Indian Board Presidents XI",
    "India Green",
    "India Red",
    "Rest of India",
    "Kolkata Knight Riders",
    "Punjab Kings",
    "Chennai Super Kings",
    "Mumbai Indians",
    "India Under-19",
    "Somerset",
    "Sussex",
    "Gujarat",
    "Uttar Pradesh",
    "Reliance 1",
    "Noida Kings",
    "India Champions"
  ],
  "bio": "Piyush Chawla's claim to fame was a Challenger Trophy game when as a 16-year-old, he had, arguably the games greatest ever batter - Sachin Tendulkar's stumps rattled with a googly. Many speculated him to take over the spin reins after Anil Kumble's retirement but sadly the youngster has flattered to deceive. The UP lad who made his domestic debut aged 17 consequently made it to India's 2006 Under-19 World Cup squad and after a stellar campaign, became one of India's youngest ever players to be handed a Test cap when he debuted against England in 2006. However, over the years, stiff competition and some lackluster performances resulted in him being shunted from the side but selectors continued to keep him in the loop. He was included in the 15-member Indian squad for the 2011 ICC Cricket World Cup, and while he played only a few games without making much impact, he will live to tell the tale of how he was a part of a winning team. In 2012, he was a surprise inclusion in the Test side for the New Zealand series as well as the Indian T20I squad for the World Twenty20 in Sri Lanka later that year. He returned to play his third Test, after 4 years, against England at Nagpur in December 2012 where he picked up 4/69 in the first innings. In August 2013, he joined Somerset as their overseas player for the last five weeks of the season. A natural leggie who is not afraid to give the ball air, Chawla's armoury also includes a good googly and a deceptive straighter one. A decent left-hander batter, Chawla is yet to prove his mettle in the international arena but he does have the potential to be a genuine all-rounder in the future provided that he works consistently on his game. He enjoyed a fair amount of success in the Indian Premier League playing for the Punjab franchise for six seasons from 2008 to 2013. For the 2014 edition, Kolkata shelled out an impressive 4.25 crores to acquire his services. From the 2017-18 Ranji Trophy season, Chawla switched from Uttar Pradesh to Gujarat and was the leading wicket-taker for them in that edition with 32 wickets in six games. In January 2018, Piyush was bought back by Kolkata in the mega-auction for the 2018 Indian Premier League through RTM. The leggie has been a very successful bowler in this tournament and that was the main reason he was the most expensive Indian purchase in the 2020 auction, with Chennai lapping him up by shelling out close to a million dollars ($0.95mn to be precise). In the following season, Chennai released him from the squad and Mumbai added him to their squad by spending 2.4 cr INR. After a slim outing, he remain unsold in 2022's auction but was purchased back by Mumbai for the 2023 season where he was a standout for Mumbai in a pretty slim campaign and will again be a part of the squad for the 2024 season.",
  "nationality": "India",
  "career_span": {
    "Test": "2006-2012",
    "ODI": "2007-2011",
    "IPL": "2008-2024"
  }
}