{
  "id": "pprofile_55316",
  "type": "player_bio",
  "player": "Sachin Baby",
  "full_name": "Sachin Baby",
  "dob": "December 18, 1988",
  "role": "Batsman",
  "batting_style": "Left Handed",
  "bowling_style": "Off break",
  "teams": [
    "India A",
    "India B",
    "South Zone",
    "Royal Challengers Bengaluru",
    "Rajasthan Royals",
    "Kerala",
    "Sunrisers Hyderabad",
    "Khelaghar Samaj Kallyan Samity",
    "Sheikh Jamal Dhanmondi Club",
    "Prime Doleshwar Sporting Club",
    "Lyca Kovai Kings",
    "KCA Eagles",
    "KCA Tigers",
    "KCA Lions",
    "AGs Office Recretaion Club",
    "Idukki",
    "Aries Kollam Sailors"
  ],
  "bio": "Sachin Baby is a name that has echoed through Kerala’s cricketing circles for over a decade. He comes from the village of Machiplavu near Adimali in Idukki, and he was named after the legendary Sachin Tendulkar. Perhaps it was destiny, or maybe just an aspiration set by his parents, but young Sachin took to cricket with great enthusiasm from an early age. He completed his schooling at Vishwadeepthi Public School and SNDP School, balancing his studies with his growing passion for the game. His domestic career began with Kerala in the 2009–10 Ranji Trophy, marking the start of an illustrious journey. He quickly made his presence felt in all formats, debuting in List A cricket in 2011 and T20s later that year. However, it was in the 2012–13 Vijay Hazare Trophy that he truly announced himself, scoring a stellar 298 runs in just seven matches. His maiden List A century in the quarter-finals played a crucial role in Kerala’s advancement, and soon, he found himself representing South Zone in the Deodhar Trophy. His consistency earned him a spot in the India A squad in 2013 and showed his rising stature in Indian domestic cricket. Sachin’s leadership qualities were evident early on, and in the 2014–15 Ranji Trophy, he was named Kerala’s captain. He celebrated the responsibility by scoring an unbeaten double-century, his first in first-class cricket. In the 2016–17 season, he recorded a career-best 250 against Services, cementing his reputation as a reliable middle-order batsman. Under his captaincy, Kerala achieved historic milestones, reaching their first-ever Ranji Trophy quarter-finals in 2017–18 and making it to the semi-finals the following season. One of his most remarkable feats came in the 2019–20 Vijay Hazare Trophy when he stitched a mammoth 338-run partnership with Sanju Samson against Goa, the highest 3rd-wicket List-A partnership in Indian cricket history. Sachin’s journey in the Indian Premier League (IPL) has been one of highs and lows. He was first picked by RR in 2013 but had limited opportunities to showcase his talent. A stint with RCB in 2016 saw him play 11 matches, scoring 119 runs. He later represented SRH in 2018 before returning to RCB in 2021. His IPL journey came full circle in the 2025 auction when he was once again picked by SRH for his base price of ₹30 lakh. Apart from mainstream domestic cricket, Sachin has also been a vital part of Kerala’s local T20 circuit. As the captain and icon player of Aries Kollam Sailors in the Kerala Cricket League (KCL), he led from the front, scoring two centuries and four half-centuries. His brilliant century in the final helped his team lift their maiden KCL Trophy, earning him the Man of the Match award. Despite years of toil and countless achievements, Sachin faced heartbreaks along the way. Kerala came agonizingly close to winning the Ranji Trophy multiple times, only to falter at the final stages. The 2024–25 season was particularly painful, as they lost their maiden final to Vidarbha. Playing in his 100th first-class match, Sachin was on the verge of a century when an uncharacteristic slog-sweep led to his dismissal on 98, shifting the game’s momentum. It was a moment he later described as a \"brain fade,\" one that might haunt him for years. Yet, true to his character, he took full responsibility, vowing to come back stronger.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "",
    "IPL": "2013-2025"
  }
}