{
  "id": "pprofile_13177",
  "type": "player_bio",
  "player": "Devon Conway",
  "full_name": "Devon Philip Conway",
  "dob": "July 8, 1991",
  "role": "Wicket-Keeper",
  "batting_style": "Left Handed",
  "bowling_style": "Right-arm medium",
  "teams": [
    "New Zealand",
    "Gauteng",
    "New Zealand A",
    "Wellington Firebirds",
    "Chennai Super Kings",
    "Somerset",
    "DP World Lions",
    "New Zealand XI",
    "New Zealanders",
    "Southern Brave",
    "Joburg Super Kings",
    "Texas Super Kings"
  ],
  "bio": "Devon Conway was born and brought up in South Africa, but later he made his move to New Zealand in 2017. He began his List A career in South Africa in 2009 by playing for Gauteng and later made his first-class debut for them the following month. After plying his trade for 8 years, Conway decided to make his move to New Zealand, hoping his experience in South Africa would help in New Zealand. Along with being a batter, he is also an occasional wicketkeeper. In the 2018-19 domestic season, he was awarded a contract with Wellington. Playing the Plunket Shield that season, Conway scored an unbeaten double-century, and he ended as one of the leading run-scorers in the tournament. He displayed his magic in the shortest format as well. He was named the Men’s Domestic Player of the Year. There was no stopping Devon Conway the next season as he was one of the leading run-scorers in the Super Smash, Ford Trophy, and the Plunket Shield. After being eligible to play for New Zealand in 2020, Devon Conway represented New Zealand in a T20I against West Indies. He made his Test debut against England at the iconic Lord’s. He had a dream start to his Test career as he scored a flawless double century and was named Man of the Match. Before making his Test debut, Conway represented New Zealand in an ODI against Bangladesh, and he notched up his maiden ODI ton in that series. In 2022, Devon Conway was acquired by Chennai for the Indian Premier League season, where he continued to impress, scoring three consecutive half-centuries. His strong performance in India carried over into 2023 when he was the leading run-scorer for Chennai in their title-winning campaign. Conway's form peaked during the ODI World Cup later that year, as he made a memorable impact with an unbeaten 152 in the opening game against England, guiding New Zealand to victory. However, his form dipped as the tournament progressed, with New Zealand bowing out in the semifinals. In 2024, Conway faced a setback when a thumb injury ruled him out of the IPL season. He recovered in time for the T20 World Cup but had a quiet tournament as New Zealand were knocked out in the group stage. Despite the disappointment, 2024 wasn't all doom and gloom for Conway. Later that year, he was part of the New Zealand squad that made history by whitewashing India in the Test series. In the absence of Kane Williamson, Conway stepped up, providing stability at the top of the order and playing a crucial role in the team's success. Following the 2024 season, Chennai released Conway but quickly secured his services once again at the 2025 IPL auction for INR 6.25 Crore.",
  "nationality": "New Zealand",
  "career_span": {
    "Test": "2021-2025",
    "ODI": "2021-2025",
    "IPL": "2022-2025"
  }
}