{
  "id": "pprofile_4195",
  "type": "player_bio",
  "player": "Matthew Wade",
  "full_name": "Matthew Scott Wade",
  "dob": "December 26, 1987",
  "role": "Wicket-Keeper",
  "batting_style": "Left Handed",
  "bowling_style": "Right-arm medium",
  "teams": [
    "Australia",
    "Tasmania",
    "Australia A",
    "Warwickshire",
    "Delhi Capitals",
    "Victoria",
    "Australia Under-19",
    "Hobart Hurricanes",
    "Melbourne Renegades",
    "Melbourne Stars",
    "Saint Lucia Kings",
    "Karachi Kings",
    "Australians",
    "Delhi Bulls",
    "Birmingham Phoenix",
    "London Spirit",
    "Dambulla Sixers",
    "Gujarat Titans",
    "Joburg Super Kings",
    "Sharjah Warriorz",
    "San Francisco Unicorns"
  ],
  "bio": "Matthew Wade is a left-handed wicket-keeper batter who played for Australia. He had a tough start to his life, having had to overcome testicular cancer at the age of 16. After that, he immediately focused on cricket and represented Australia in the 2006 U-19 World Cup that was held in Sri Lanka. Wade made his FC debut in 2007 for Victoria, where he made 83 runs in the first innings and took six catches in total. He also scored a crucial 96 to guide the Bushrangers to victory in the 2009-10 Sheffield Shield final and ended the season with 677 runs to his name and scored 533 runs the following season. It did not take long after that for his debut. He made his T20I debut against South Africa in 2011. He played his first ODI for Australia and it was against India. He scored 67 runs and was awarded the Player of the Match. For personal reasons, Brad Haddin returned home in 2012 and Wade got his Baggy Green in the West Indies. Wade grabbed the opportunity, scoring 106 in the third Test and then posted an unbeaten 102 against Sri Lanka in the 2013 New Year’s Test. Soon Wade's form dipped both as a batter and wicketkeeper on the tour of India, and Brad Haddin came back into the side as vice-captain for the Ashes. Wade though retained his position as ODI wicketkeeper for a period of time but was ultimately left out of the Australian 2015 Cricket World Cup squad. Then, the retirement of Haddin saw Peter Nevill being selected as the first-choice keeper, and Wade missed out as he struggled to perform consistently. In 2017, he scored his maiden ODI century while playing against Pakistan. But a back injury kept him on the sidelines for some time. He was named in the 2019 World Cup squad for Australia as cover for Usman Khawaja, who got injured in the knockout stages. Then, after some heroic performances in first-class cricket, he was recalled to the Test side for the 2019 Ashes as a specialist batter, with skipper Tim Paine doing the keeping. Matthew Wade scored 337 runs across 10 innings, and Australia drew 2-2 with England. Cricket Australia awarded Wade a central contract ahead of the 2020–21 season. In 2020, Wade captained Australia for the first time, leading the side in a T20I match against India at the SCG after Aaron Finch was ruled out due to injury. He was named in the Australian squad for the 2021 T20 World Cup, in which they went on to become the champions. Wade delivered a Player of the Match performance in the semi-final against Pakistan, where he smashed a quickfire 41 off just 17 balls, helping Australia to progress to the final. Wade is a regular in the Big Bash League and has been with Melbourne Renegades since 2011. However, he found no bidders in the 2014 Indian Premier League auctions after Delhi decided not to retain any of the players for the 7th edition. In 2022, Wade was bought by Gujarat and he was a part of the title winning team. Wade has never found it easy in his career. He always played catch-up with players above him. He announced his retirement from International cricket in October 2024.",
  "nationality": "Australia",
  "career_span": {
    "Test": "2012-2021",
    "ODI": "2012-2021",
    "IPL": "2011-2024"
  }
}