{
  "id": "pprofile_71151",
  "type": "player_bio",
  "player": "Anshul Kamboj",
  "full_name": "Anshul Kamboj",
  "dob": "December 6, 2000",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm medium",
  "teams": [
    "India",
    "India A",
    "North Zone",
    "Chennai Super Kings",
    "Mumbai Indians",
    "India Under-19",
    "Haryana",
    "India C"
  ],
  "bio": "Anshul Kamboj is a promising right-arm pacer and all-rounder from India, known for his skiddy deliveries and consistency in domestic cricket. He made his breakthrough in February 2022, playing for Haryana, and has since established himself as a key figure in the domestic circuit with his impressive performances. Kamboj first gained attention in the limited-overs format during the 2022 Syed Mushtaq Ali Trophy, where he took 7 wickets in 7 matches. This early success was followed by a standout performance in the 2023/24 Vijay Hazare Trophy, where he played a crucial role in Haryana’s maiden title victory. He took 17 wickets in 10 matches at an exceptional economy rate, showcasing his ability to control the game with the ball. His consistent performances in domestic cricket earned him a spot in the 2024 Indian Premier League Auction, where he was bought by Mumbai Indians. He also gained further recognition in the first-class circuit, getting selected for the 2024-25 Duleep Trophy. In the 2024 Ranji Trophy, Kamboj's bowling skills were on full display when he achieved a remarkable 10-wicket haul against Kerala, finishing with figures of 10/49. With this performance, he became only the third bowler in Ranji Trophy history to take a 10-wicket haul in a match, following in the footsteps of Bengal's Premangsu Chatterjee (1956/57) and Rajasthan’s Pradeep Sunderam (1985/86). His ability to swing the ball and adapt to different pitch conditions made him a pivotal bowler in the longer format. During the 2024/25 Ranji Trophy season, Kamboj took 74 wickets in 22 matches at an average of 22.66, further cementing his status as a consistent and skillful bowler in red-ball cricket. Recognizing his steady progress, Anshul Kamboj found a new home in the Indian Premier League. After a fierce bidding war, which saw MI, LSG and DC also show interest, the Chennai Super Kings secured his services for a significant INR 3.40 crores in the 2025 IPL Mega Auction, signaling his rising stature in cricket.",
  "nationality": "India",
  "career_span": {
    "Test": "2025-2025",
    "ODI": "",
    "IPL": "2024-2025"
  }
}