{
  "id": "pprofile_48607",
  "type": "player_bio",
  "player": "Keshav Maharaj",
  "full_name": "Keshav Athmanand Maharaj",
  "dob": "February 7, 1990",
  "role": "All-Rounder",
  "batting_style": "Right Handed",
  "bowling_style": "Slow left-arm orthodox",
  "teams": [
    "South Africa",
    "Dolphins",
    "KwaZulu Natal",
    "Lancashire",
    "South Africa A",
    "Yorkshire",
    "Rajasthan Royals",
    "South Africa Emerging",
    "Barbados Royals",
    "Pretoria Mavericks",
    "Durban Heat",
    "Fortune Barishal",
    "Durban's Super Giants",
    "Dubai Capitals",
    "Dallas Lonestars CC"
  ],
  "bio": "Marking his ancestry from the Indian state of Uttar Pradesh, and hailing from the Natal Province of South Africa, Keshav Maharaj boasts crafty bowling skills as a left-arm orthodox. At a time when South African cricket was beginning to embrace spin bowling with newfound appreciation, Keshav Maharaj emerged as a promising left-arm spinner from Northwood Boys High School, an institution that had previously produced the legendary Shaun Pollock. Keshav Maharaj's journey in professional cricket began remarkably early, making his first-class debut for KwaZulu-Natal as a teenage prodigy at just 16 years of age in the 2006-07 season. His talent continued to flourish, and by 2009-10, he had earned his place in the Dolphins squad, marking his progression through South Africa's domestic cricket structure. A significant milestone in his development came when he was selected for South Africa A's tour to Bangladesh in 2010. Maharaj made the most of this opportunity, by claiming an impressive haul of 13 wickets across two four-day matches against the Bangladesh Cricket Board team. After dominating the domestic circuit with exceptional performances in the 2014-15 and 2015-16 seasons, Keshav Maharaj earned his coveted Test cap for South Africa in 2016. Making his debut against Australia at Perth as the nation's 327th Test player, he announced his arrival with a three-wicket haul. His progression continued steadily, and in 2017, he reached his first significant milestone in Test cricket, claiming his maiden five-wicket haul against New Zealand. The year 2017 proved to be pivotal for Maharaj as he expanded his international repertoire, making his ODI debut against England and securing a spot in South Africa's Champions Trophy squad. However, it was in 2018 that he produced one of the most remarkable performances of his career. During the second Test against Sri Lanka, Maharaj etched his name in the record books with extraordinary figures of 9 for 129, not only his personal best but also the finest bowling figures by any visiting bowler in Test matches played in Sri Lanka and all of Asia. Also becoming the only second left-arm spinner after Rangana Herath to claim 9 wickets in a Test inning. 2021 proved to be a landmark year in Keshav Maharaj's career, filled with historic moments and new milestones. In June, he achieved something that had eluded South African cricketers for over six decades – a Test hat-trick. This feat was particularly special as it was only the second Test hat-trick by a South African bowler, coming 61 years after Geoff Griffin's achievement at Lord's in 1960. Even more remarkably, Maharaj's journey took an unexpected turn when he was selected for South Africa's 2021 T20 World Cup squad, despite having never played a T20 International. His T20I debut came in September that year against Sri Lanka, where he not only led the team as captain but also made an instant impact by claiming a wicket with his very first delivery in the format. He has remained as an inseparable part of the Proteas squad, featuring in almost every ICC tournament, including the World Cup 2023 where his career peak arrived as he not only became the Number 1 ranked ODI bowler in the ICC rankings but also proved to be very economical throughout the tournament, with wicket-taking consistency. He also featured in the ICC T20 World Cup 2024 where he yet again proved to be a crucial bowler. These accomplishments highlighted Maharaj's versatility as a spinner and his growing importance in South African cricket across all formats. Stepping into the franchise cricket, Maharaj has represented in almost all major franchise tournaments mapping the world, be it playing for Barbados Royals in the Caribbean Premier League, and also proving himself in the Bangladesh Premier League playing for the Fortune Barishal. He made his Indian T20 League debut in the year 2024 playing for the Rajasthan franchise. Growing as a key player, Maharaj has been given the leading duties for Durban’s Super Giants in South Africa’s own SA20 League.",
  "nationality": "South Africa",
  "career_span": {
    "Test": "2016-2025",
    "ODI": "2017-2025",
    "IPL": "2024-2024"
  }
}