{
  "id": "pprofile_64253",
  "type": "player_bio",
  "player": "Fabian Allen",
  "full_name": "Fabian Anthony Allen",
  "dob": "May 7, 1995",
  "role": "All-Rounder",
  "batting_style": "Right Handed",
  "bowling_style": "Slow left-arm orthodox",
  "teams": [
    "West Indies",
    "Jamaica Scorpions",
    "West Indies A",
    "Punjab Kings",
    "Mumbai Indians",
    "West Indies Under-19",
    "Adelaide Strikers",
    "Hobart Hurricanes",
    "Sylhet Strikers",
    "Sunrisers Hyderabad",
    "Jamaica Tallawahs",
    "St Kitts and Nevis Patriots",
    "Peshawar Zalmi",
    "West Indians",
    "Kerala Knights",
    "Multan Sultans",
    "Toronto Nationals",
    "Vancouver Knights",
    "CWI B Team",
    "Northern Warriors",
    "Delhi Bulls",
    "Deccan Gladiators",
    "Karnataka Tuskers",
    "Team Abu Dhabi",
    "Oval Invincibles",
    "Jaffna Kings",
    "Kandy Falcons",
    "Chennai Brave Jaguars",
    "Paarl Royals",
    "Abu Dhabi Knight Riders",
    "Dubai Capitals",
    "MI New York",
    "Antigua & Barbuda Falcons"
  ],
  "bio": "Dynamic with the bat, cunning with the ball, and electric in the field, this is how you can define Fabian Allen. A utility all-rounder in the shorter formats, Allen first caught the attention of West Indian national selectors after a successful stint at the ICC U-19 World Cup in 2014. His impressive performance paved the way for his debut in First-Class cricket in 2016 for his home team, Jamaica. Allen's career faced a major setback when he met with a life-threatening accident in 2016, but he showed remarkable resilience and determination. Three years later, he made a stunning comeback with a blazing knock against Sri Lanka at the 2019 World Cup, although it came in a losing cause. His performances earned him a central contract before the start of the 2019-20 season. The coronavirus pandemic disrupted many sporting events, but Allen was set to play for the St Kitts and Nevis Patriots in the CPL 2020. Unfortunately, he missed the tournament due to missing his flight. Despite this setback, Allen continued to work hard and remained in the selectors' plans until 2022. While he hasn't featured in the national team colours since then, he has made a significant impact in franchise leagues worldwide, including the Indian T20 League, Pakistan Super League, Caribbean Premier League, Bangladesh Premier League, and the ILT20. Notably, Allen tasted success with the St Kitts and Nevis Patriots during the 2021 CPL season, where he was a vital cog in their triumphant campaign. His all-round skills shone brightly as he took 9 wickets and scored 137 runs from 11 games, proving his worth as a versatile and valuable player in the T20 format. Having not played for the West Indies since 2022, Fabian Allen was in search of a breakthrough season to turn his fortunes around. However, Allen actively plays in several T20 leagues across different regions, honing his skills and gaining experience in various competitive environments, including in the Caribbean, the UAE, South Africa, India, and beyond.",
  "nationality": "West Indies",
  "career_span": {
    "Test": "",
    "ODI": "2018-2022",
    "IPL": "2021-2022"
  }
}