{
  "id": "pprofile_42946",
  "type": "player_bio",
  "player": "Dwaine Pretorius",
  "full_name": "Dwaine Pretorius",
  "dob": "March 29, 1989",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm medium fast",
  "teams": [
    "South Africa",
    "Namibia",
    "Northamptonshire",
    "North West Dragons",
    "South Africa A",
    "Chennai Super Kings",
    "South Africa Under-19",
    "DP World Lions",
    "Rangpur Riders",
    "South Africa Emerging",
    "Guyana Amazon Warriors",
    "St Kitts and Nevis Patriots",
    "Quetta Gladiators",
    "Peshawar Zalmi",
    "Cape Town Knight Riders",
    "Vancouver Knights",
    "Jozi Stars",
    "Paarl Rocks",
    "Edinburgh Rocks",
    "Team Abu Dhabi",
    "Welsh Fire",
    "Quinny’s Kites",
    "Colombo Strikers",
    "Galle Marvels",
    "Fortune Barishal",
    "Morrisville Samp Army",
    "Durban's Super Giants",
    "Seattle Orcas",
    "Dallas Lonestars CC",
    "Jaffna Titans"
  ],
  "bio": "A rough journey for Dwaine Pretorious to begin with, but smooth sailing from thereafter, a late bloomer, one might say. Pretorious hails from South Africa and is a right-arm pace bowler and a very handy lower-order batter. He began playing cricket for South Africa at the youth level itself. He was named in South Africa’s U-19 squad for the World Cup in 2008. However, a torn cartilage in his right knee resulted in him being left out of the entire tournament. Knee injuries at a young age did hamper his career at the start. As a result, he decided to quit cricket and concentrate on his studies. He ended up with a degree in accounting as well. But a few years down the line, Dwaine decided to give another go at the sport he was passionate about. He signed up with the North-West side for the 2010-11 domestic season and he got only one chance to play the game. But he grabbed that opportunity with both his hands and ended with 5 wickets by his name and scored 53 runs in that match. Thereafter he became a regular member of the squad for the following season. Owing to his impressive show, he was named the Amateur T20 Cricketer of the Year and he was roped in by Lions for the Champions League T20 in 2012. While everything was fine for the all-rounder, he injured his knee once again and had to undergo surgery. On his return, he changed his style of bowling. Instead of clocking 140 consistently, he concentrated more on the movement of the ball and the accuracy which did work in his favor. In 2014-15 he earned his first contract with the Lions. He proved his worth there and was named South African Cricketer’s Association MVP in 2015. Eight years after his youth World Cup, Dwaine finally got a chance to represent South Africa. He made his ODI debut against Ireland in September 2016. Soon, he went to represent his nation in the shortest format as well. In 2019, Pretorious received his Test cap against England at Centurion. An injury to Dale Steyn, allowed Dwaine to make his Test debut as well. The same year, he was also named in World Cup Squad ahead of Chris Morris, which surprised one and all. Over the years, Dwaine has cemented his spot in the limited-over format for South Africa but has not got many opportunities in red-ball cricket. The all-rounder was also acquired by Chennai for the Indian T20 League in 2022. He made his debut for them against Lucknow and grabbed two wickets as well..",
  "nationality": "South Africa",
  "career_span": {
    "Test": "2019-2020",
    "ODI": "2016-2022",
    "IPL": "2022-2023"
  }
}