{
  "id": "pprofile_65875",
  "type": "player_bio",
  "player": "Karim Janat",
  "full_name": "Karim Janat",
  "dob": "August 11, 1998",
  "role": "All-Rounder",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm medium",
  "teams": [
    "Afghanistan Under-19",
    "Afghanistan",
    "Prime Bank Cricket Club",
    "Sheikh Jamal Dhanmondi Club",
    "Comilla Victorians",
    "Afghanistan A",
    "Band-e-Amir Region",
    "Speen Ghar Region",
    "Band-e-Amir Dragons",
    "Boost Defenders",
    "Kabul Eagles",
    "Bangla Tigers",
    "Kabul Region",
    "Surrey Jaguars",
    "Kandahar Knights",
    "Rajputs",
    "Northern Warriors",
    "Chitwan Tigers",
    "Colombo Strikers",
    "Dambulla Sixers",
    "Fortune Barishal",
    "Gujarat Titans",
    "Hindukush Strikers",
    "Morrisville Samp Army",
    "Gulf Giants",
    "Sharjah Warriorz",
    "Cape Town Samp Army",
    "Joburg Bangla Tigers",
    "Hambantota Bangla Tigers"
  ],
  "bio": "Karim Janat, hailing from Kabul, is an Afghan bowling all-rounder. He first gained prominence as part of the Afghanistan squad for the 2016 U-19 World Cup, where his batting skills came to the fore, finishing as the highest run-getter for Afghanistan with 273 runs from six games, including a blistering 156-run knock against Fiji. The year 2016 continued to get better for Karim, as after returning home from the World Cup, he made his first-class debut later in the year. Despite having no prior experience of playing T20 cricket, he was handed his maiden T20I cap in December against UAE, and he did not disappoint. His all-round performance earned him the 'Player of the Match' award and helped Afghanistan secure a victory over the UAE. This impressive debut marked the beginning of his promising international career. Karim was rewarded for his exploits at the 2017 Ghazi Amanullah Regional One-Day Tournament, where he claimed 12 dismissals to finish as the joint-leading wicket-taker. Consequently, the Afghan selectors picked him for the ODI series against Zimbabwe in February 2017. He soon made his ODI debut against Zimbabwe but struggled, going wicketless and scoring just nine runs off 33 balls in his first outing. Karim continued to grow as a cricketer both in the domestic arena and with the national team. In 2023, he achieved a significant milestone by making his Test debut for Afghanistan. Karim earned his Test cap through a stellar all-round showing in the Ahmad Shah Abdali four-day tournament in 2022, where he amassed 561 runs at an average of 140.25, including two hundreds and four fifties. He also finished as the joint third-highest wicket-taker in the tournament with 18 scalps to his name. It was a dream come true for the all-rounder in 2023 when he made his Test debut against Bangladesh in June. He has since evolved as a cricketer and also featured in the 2024 T20 World Cup. He got that opportunity on the back of a brilliant run at the Qosh Tepa National T20 Cup, 2024, where he played a pivotal role in Band-e-Amir Region’s title-winning campaign. Karim was the leading wicket-taker and scored the second most runs for his side, and to top it all off, he produced a match-winning ton in the final of the competition to lead his team to cup glory. Karim will aim to make the most of his red-hot form as Afghanistan rub shoulders with top teams on the biggest stage. Admiring his impeccable record for the national team and in various domestic competitions, Janat finally secured an IPL contract. He was picked up by Gujarat Titans at his base price of INR 75 lakhs, marking a significant milestone in his career.",
  "nationality": "Afghanistan",
  "career_span": {
    "Test": "2023-2024",
    "ODI": "2017-2023",
    "IPL": "2025-2025"
  }
}