{
  "id": "pprofile_64511",
  "type": "player_bio",
  "player": "Avesh Khan",
  "full_name": "Avesh Khan",
  "dob": "December 13, 1996",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm fast medium",
  "teams": [
    "India",
    "Central Zone",
    "India A",
    "Indian Board Presidents XI",
    "India Red",
    "Royal Challengers Bengaluru",
    "Delhi Capitals",
    "Rajasthan Royals",
    "India Under-19",
    "Madhya Pradesh",
    "India C",
    "County Select XI",
    "Lucknow Super Giants",
    "Team A",
    "Bundelkhand Bulls"
  ],
  "bio": "Born in Indore, Avesh Khan is a right-arm pace bowler who has made a name for himself in the Indian domestic circuit. Avesh made his List A debut for Madhya Pradesh in the 2017-18 Vijay Hazare Trophy. In the 2018-19 Ranji Trophy season, Avesh finished as the leading wicket-taker for Madhya Pradesh, where he grabbed 35 wickets from seven games. He was also a part of India's U-19 World Cup squad in 2014 as well as in 2016, and since then, he has been very impressive with the ball. He is known for his variations and has different slower balls up his sleeves. Avesh made his Indian Premier League debut for Bengaluru in the 2017 edition. Ahead of the 2018 edition, he was picked to play for Delhi. He had a brilliant 2021 season with Delhi, where he grabbed 24 wickets, finishing as the leading wicket-taker for his side, and second overall in that edition. For the 15th season of the Indian Premier League, Avesh was signed by Lucknow, who won the bidding war against a couple of other franchises at the auction. After impressing one and all with his performances in the Indian Premier League, he was picked to play for India in the T20I series against West Indies in February 2022. He made his T20I debut for India in that series and later in the year, in the Caribbean, he was handed his maiden ODI cap. In May 2024, Avesh Khan was named as a reserve player in India’s squad for the 2024 ICC Men's T20 World Cup. Known for his ability to deliver in crucial moments, he has established himself as a valuable asset in the bowling attack. As he continues to refine his skills and gain experience, India’s fast-bowling future looks even brighter with his promising talent.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "2022-2023",
    "IPL": "2017-2025"
  }
}