{
  "id": "pprofile_64941",
  "type": "player_bio",
  "player": "Ryan Rickelton",
  "full_name": "Ryan David Rickelton",
  "dob": "July 11, 1996",
  "role": "Wicket-Keeper",
  "batting_style": "Left Handed",
  "bowling_style": "-",
  "teams": [
    "South Africa",
    "Gauteng",
    "Northamptonshire",
    "South Africa A",
    "Yorkshire",
    "Mumbai Indians",
    "South Africa Under-19",
    "DP World Lions",
    "Nelson Mandela Bay Stars",
    "Jozi Stars",
    "Deccan Gladiators",
    "MI Cape Town",
    "Seattle Orcas"
  ],
  "bio": "Ryan Rickelton is a top-order batter hailing from South Africa. He marked his debut for the South African cricket team on March 31, 2022. In addition to his proficiency as a wicketkeeper, Rickelton has represented the South Africa U-19 team. He subsequently made his debut in first-class cricket for Gauteng against Northerns in November 2015. Following impressive performances, including scoring 351 runs in eight matches during the 2017-18 Provincial One-day Cup and 562 runs in six matches for Gauteng in the 2017-18 Sunfoil Series, Rickelton received a selection to the Cricket South Africa Emerging squad in July 2018. In February 2022, Rickelton assumed the role of captain for the Imperial Lions in the 2021–22 CSA T20 Challenge. Furthermore, during the same year, he inked a contract with Northamptonshire to participate in that year's County Championship. At 25 years old, Rickelton received his first call-up to the senior national side for the T20I series against Pakistan. However, despite his selection, he didn't have the chance to display his skills in the shortest format of the game. November 2021 saw Rickelton's inclusion in South Africa's ODI squad for their series against the Netherlands. The subsequent month, he found himself named in South Africa's Test squad for the series against India. But it was in March 31, 2022, that Rickelton marked his Test debut for South Africa in a series against Bangladesh. In 2022, he had a stint with Northamptonshire, where he achieved two centuries and four fifties across four matches. Cricket South Africa worried about the risk of sending him on the Aussie tour in case he couldn't play due to an injury, but he proved them wrong by scoring four centuries in five weeks for the Lions. Ryan Rickelton's stellar performance in the 2022-23 List A domestic challenge paved the way for his ODI debut against the West Indies in March 2023. Although his initial matches yielded only 17 runs, he bounced back strongly, hitting a rich vein of form. His impressive form led to his selection as an opening batter for MI Cape Town in the inaugural SA20 season. In 2024, he topped the charts as the leading run-scorer in the SA20, marking a significant turning point in his career. It also earned him a spot in the squad for the 2024 T20 World Cup. However, he remained on the bench throughout the tournament. Ryan Rickelton's career skyrocketed as he consistently racked up runs for MI Cape Town, but it was in January 2025 that he truly stole the spotlight. He unleashed a stunning double century against Pakistan, smashing 259 runs at Newlands, leaving the opposition reeling. With an attacking caliber and the capability to set the stage ablaze from the get-go, Rickelton has proved himself to be an inseparable component in this Proteas squad.",
  "nationality": "South Africa",
  "career_span": {
    "Test": "2022-2025",
    "ODI": "2023-2025",
    "IPL": "2025-2025"
  }
}