{
  "id": "pprofile_67778",
  "type": "player_bio",
  "player": "Spencer Johnson",
  "full_name": "Spencer Henry Johnson",
  "dob": "December 16, 1995",
  "role": "Bowler",
  "batting_style": "Left Handed",
  "bowling_style": "Left-arm fast",
  "teams": [
    "Australia",
    "South Australia",
    "Australia A",
    "Surrey",
    "Kolkata Knight Riders",
    "Adelaide Strikers",
    "Brisbane Heat",
    "Italy",
    "Surrey Jaguars",
    "Oval Invincibles",
    "Gujarat Titans",
    "Los Angeles Knight Riders"
  ],
  "bio": "Spencer Henry Johnson is an Australian cricketer who plays for the national team in both ODI and T20I formats. A left-arm fast bowler, he has represented several domestic and international franchises, including South Australia, Brisbane Heat, Oval Invincibles, Los Angeles Knight Riders, Kolkata, Surrey and Gujarat. Johnson’s List A debut took place during the 2017–18 JLT One-Day Cup, where he represented South Australia in a match against Victoria on 12 October 2017. Although his bowling figures of 1/72 across 10 overs were modest and he didn’t get to bat, South Australia managed to win by 11 runs. After being dropped from South Australia’s squad ahead of the 2020–21 season, Johnson made a remarkable comeback by showcasing consistent performances in South Australian Premier Cricket. Despite being included in the Adelaide Strikers’ squad for the 2020–21 Big Bash League season, he didn’t get the opportunity to play. His BBL debut finally came with the Brisbane Heat during the 2022–23 season on 11 January 2023. Over the season, Johnson gained recognition as a reliable death bowler, contributing significantly to the Brisbane Heat’s title-winning campaign in the 2023–24 BBL final. Johnson’s first-class cricket journey began on 20 February 2023, where he made an instant impression with figures of 6/87 against Victoria. He followed this with an even better performance in his next game against Queensland, claiming 7/47. In August 2023, Johnson joined the Oval Invincibles in The Hundred competition in England. He had a stunning debut, taking 3/1 in a tight 20-ball spell against Manchester Originals. Earlier in March 2023, he was named in the Australia A squad for a tour of New Zealand leading up to the 2023 Ashes series, where he claimed 4/53 in the opening match in Lincoln. As a dual citizen of Australia and Italy, Johnson was initially set to represent Italy in the ICC Men’s T20 World Cup Europe Qualifier in July 2023. However, his growing profile earned him a spot in Australia’s T20I squad for the series against South Africa in August. He debuted in the opening match of the series, taking 2/33 in a commanding 111-run win. In February 2024, Johnson was named in Australia’s squad for the T20 series against the West Indies, where he delivered a strong performance in the second match, picking up 2/39. On 16 November 2024, he achieved a career milestone by securing his first international five-wicket haul during a T20I against Pakistan, with figures of 5/26 from four overs. His achievements also caught the eye of IPL selectors, where Kolkata picked him up for the 2025 season. With all the three premier fast bowlers for Australia sidelined, he got the call-up to represent Australia in the 2025 Champions Trophy. Spencer Johnson’s rise has been defined by perseverance and adaptability. His ability to deliver impactful performances in critical moments, especially in T20 cricket, has established him as a valuable player both domestically and on the international stage.",
  "nationality": "Australia",
  "career_span": {
    "Test": "",
    "ODI": "2023-2025",
    "IPL": "2024-2025"
  }
}