{
  "id": "pprofile_65295",
  "type": "player_bio",
  "player": "Glenn Phillips",
  "full_name": "Glenn Dominic Phillips",
  "dob": "December 6, 1996",
  "role": "All-Rounder",
  "batting_style": "Right Handed",
  "bowling_style": "Off break",
  "teams": [
    "New Zealand",
    "Auckland Aces",
    "Gloucestershire",
    "New Zealand A",
    "Rajasthan Royals",
    "Otago Volts",
    "New Zealand Under-19",
    "Sunrisers Hyderabad",
    "Barbados Royals",
    "Guyana Amazon Warriors",
    "Jamaica Tallawahs",
    "New Zealanders",
    "Welsh Fire",
    "Colombo Strikers",
    "Gujarat Titans",
    "Washington Freedom"
  ],
  "bio": "Born on December 6, 1996, Glenn Phillips is a versatile New Zealand batter known for his explosive power-hitting and athleticism. Originally hailing from South Africa, Phillips moved to New Zealand at a young age and quickly rose through the ranks with his impressive batting skills and consistency. Phillips' journey began as a promising batter and reliable wicketkeeper. He made his List A debut in the Ford Trophy in January 2015, leaving an immediate impact with his aggressive style of play. Representing New Zealand in the U-19 World Cup in 2016, he emerged as the second-highest run-scorer for his team, further solidifying his status as a rising star. In domestic cricket, Phillips made a spectacular debut for the Otago Volts in the Super Smash T20 competition, smashing 55 off 32 balls. His consistency throughout the tournament saw him finish as the leading run-scorer, earning him a spot in New Zealand's T20I squad. He made his T20I debut in February 2017 against South Africa, stepping in for the injured Martin Guptill, and impressed with a knock of 56 off 40 balls in just his fourth match. Although selected for the ODI squad against India in 2017, Phillips had to wait five years to make his 50-over debut. During this period, he continued to build his reputation as a power hitter. In 2020, he grabbed global attention with a stunning century in a T20I match against the West Indies, showcasing his ability to dismantle bowlers with ease. Earlier that year, Phillips achieved another milestone, earning his maiden Test cap during the Sydney Test. From 2020 onwards, Glenn made a significant impact in T20 leagues around the world. It all started with a standout season for Jamaica Tallawahs in the Caribbean Premier League, followed by an impressive run with Gloucestershire in the T20 Blast. His big break came at the 2022 T20 World Cup, where he stole the spotlight with a stunning century against Sri Lanka. Phillips finished as New Zealand’s highest run-scorer in the tournament, although they were knocked out in the semifinals. Riding on the back of his consistent performances in domestic cricket, Phillips made a successful return to the Test side in 2023. Seizing the opportunity, he showcased his all-round skills in challenging conditions during New Zealand's tour of Bangladesh. Whether with the bat or ball, Phillips proved his worth, further cementing his place in the side as a dynamic and dependable asset. Phillips continued to deliver on his promise, quickly becoming an integral part of New Zealand’s setup across all three formats. His exceptional fielding alone made him a must-have player in any side, and his all-round abilities became more evident with each passing year. During New Zealand’s historic tour of India, Glenn may not have had the best series with the bat, but he made sure to contribute significantly with his off-spin. His vital role added depth to the Kiwi attack, and his all-round skills helped New Zealand pull off a remarkable 3-0 whitewash, a feat never before achieved by an away side in India.",
  "nationality": "New Zealand",
  "career_span": {
    "Test": "2020-2024",
    "ODI": "2022-2025",
    "IPL": "2021-2023"
  }
}