{
  "id": "pprofile_64473",
  "type": "player_bio",
  "player": "Ben Dwarshuis",
  "full_name": "Benjamin James Dwarshuis",
  "dob": "June 23, 1994",
  "role": "Bowler",
  "batting_style": "Left Handed",
  "bowling_style": "Left-arm fast medium",
  "teams": [
    "Australia",
    "Australia A",
    "Durham",
    "Worcestershire",
    "Punjab Kings",
    "Delhi Capitals",
    "New South Wales",
    "Sydney Sixers",
    "Cricket Australia XI",
    "Islamabad United",
    "Birmingham Phoenix",
    "Northern Superchargers",
    "New South Wales XI",
    "Washington Freedom"
  ],
  "bio": "Benjamin James Dwarshuis, born in Kareela, New South Wales, is an Australian cricketer known for his sharp left-arm medium-fast bowling and hard-hitting lower-order batting. Hailing from the Sutherland Shire, Dwarshuis rose through the ranks of domestic cricket before making his mark on the international stage. He made his List A debut for New South Wales in the 2016–17 Matador BBQs One-Day Cup on October 7, 2016. His performances in domestic cricket earned him a place in Australia's T20I squad for the 2017–18 Trans-Tasman Tri-Series in January 2018, though he did not make his debut at the time. Later that month, he was bought by the Punjab franchise in the 2018 IPL auction, marking his entry into one of the world’s most competitive T20 leagues. Dwarshuis continued to make strides in T20 cricket, signing with Worcestershire County Cricket Club in March 2021 for the T20 Blast in England. Later that year, in September 2021, he joined Delhi for the second phase of the 2021 IPL in the United Arab Emirates, replacing Chris Woakes. His performances in the Big Bash League 2021-22 season were particularly impressive, as he claimed his maiden five-wicket haul in T20 cricket in January 2022. His consistent performances in domestic and franchise cricket earned him his long-awaited international debut. In February 2022, he was named in Australia's squad for a one-off T20I against Pakistan, making his T20I debut on April 5, 2022, in Lahore. Later that year, on October 3, 2022, he made his first-class debut for New South Wales against Western Australia in the Sheffield Shield. Dwarshuis continued to be a key figure in Australia’s T20 setup. In November 2023, he was selected in Australia's squad for the five-match T20I series against India. In the fourth T20I, he put up a strong performance, picking up 3 wickets for 40 runs in his 4 overs. His growing reputation as a T20 specialist saw him return to Worcestershire in December 2024, signing a deal to play for the club in the 2025 T20 Blast. A valuable all-rounder in the shorter formats, Ben Dwarshuis continues to build his career with impressive performances across domestic, franchise, and international cricket.",
  "nationality": "Australia",
  "career_span": {
    "Test": "",
    "ODI": "2024-2025",
    "IPL": ""
  }
}