{
  "id": "pprofile_10115",
  "type": "player_bio",
  "player": "Mayank Agarwal",
  "full_name": "Mayank Anurag Agarwal",
  "dob": "February 16, 1991",
  "role": "Batsman",
  "batting_style": "Right Handed",
  "bowling_style": "Off break",
  "teams": [
    "India",
    "India A",
    "India B",
    "India Blue",
    "Rest of India",
    "South Zone",
    "Royal Challengers Bengaluru",
    "Punjab Kings",
    "Delhi Capitals",
    "India Under-19",
    "Karnataka",
    "Sunrisers Hyderabad",
    "Belagavi Panthers",
    "Ballari Tuskers",
    "Hubli Tigers",
    "Rising Pune Supergiant",
    "Bengaluru Blasters",
    "Shamanoor Davangere Diamonds",
    "India C",
    "Indians",
    "Team A"
  ],
  "bio": "Hailing from Karnataka, the land that gave India Rahul Dravid, enters another rockstar but this time in the form of a mini-version of Virender Sehwag - Mayank Agarwal. He is known for his aggressive approach as he usually opens the innings for his team and gives a kick-start. Mayank established his name after having a successful run in the U-19 Cooch Behar Trophy in 2008-09 where he scored 432 runs in five matches. In the 2010 U-19 World Cup, Agarwal top-scored for his country although it still was a below-par performance. Later in 2012, he made his List A debut in Vijay Hazare Trophy. Mayank soon made his first-class debut in 2013 representing Karnataka against Jharkhand and scored 90 from 144 balls for his side. Due to his inconsistency, Mayank was often in and out of his state side. Agarwal's turning point of life came in the year 2017 as he scored his maiden triple hundred for Karnataka against Maharashtra in November 2017 and that brought him under the radar of the selectors. He continued his dream run as he became the highest run-scorer in the 2017-18 Ranji Trophy and followed it up with a magnificent Vijay Hazare Trophy in the same year as he amassed 723 runs in just eight matches to lead the batting charts. BCCI acknowledged his brilliant Ranji season by handing him the Madhavrao Scindia award. His amazing form was rewarded by the selectors when he was chosen in the Test squad to tour West Indies in September 2018. Though he didn't get to play in that series. Opportunity knocked once again for the Karnataka opener a few months later when Prithvi Shaw was ruled out due to an injury and Agarwal was called in as a replacement for the Australian tour. Finally, he made his Test debut against Australia in the Boxing Day Test at the MCG. It was a remarkable moment for him as his innings of 76 became the highest score by an Indian cricketer on debut in Australia. Initially ignored for the 2019 World Cup squad, Mayank Agarwal received an unexpected call to join the team in England when Vijay Shankar was ruled out of the tournament due to an injury. However, he was more of a backup and never got an opportunity to break into the playing XI. In Test cricket, Agarwal continued to show his skill and temperament. Against South Africa at home in 2019, he notched up his maiden Test century and zoomed it into a double-ton. Slowly but steadily he's cementing his place in the regular team and his triple century opening stand with Rohit Sharma would go a long way in helping him in his cause.",
  "nationality": "India",
  "career_span": {
    "Test": "2018-2022",
    "ODI": "2020-2020",
    "IPL": "2011-2025"
  }
}