{
  "id": "pprofile_64721",
  "type": "player_bio",
  "player": "Shahrukh Khan",
  "full_name": "Masood Shahrukh Khan",
  "dob": "May 27, 1995",
  "role": "Batsman",
  "batting_style": "Right Handed",
  "bowling_style": "Off break",
  "teams": [
    "India",
    "Punjab Kings",
    "Tamil Nadu",
    "Lyca Kovai Kings",
    "Siechem Madurai Panthers",
    "Trichy Grand Cholas",
    "Gujarat Titans",
    "Vijay CC",
    "Grand Slam Cricket Club"
  ],
  "bio": "Shahrukh Khan is a name in India that has been popularized by a famous Bollywood actor and it is refreshing to see a young cricketer come out of the shadow of this name and make a mark for himself. Born on 27th May 1995 as Masood in Chennai the capital city of the state of Tamil Nadu in Southern India, he adopted the name Shahrukh Khan at an early age. He played loads of cricket at different age levels for Tamil Nadu and showed his talent as a dangerous right-handed batter who could bowl handy right-arm off-spin. He proved his ability in the Under-19 Cooch Behar Trophy where he scored 624 runs and claimed 18 wickets but was still ignored for the 2014 Under-19 Cricket World Cup. This seemed to work in his favor as he made his List A debut in the Vijay Hazare Trophy at the start of 2014. About a month later, he made his T20 debut in the Syed Mushtaq Ali Trophy and showed his hitting prowess by scoring 21 in just 8 balls. Following this performance, he was picked by the Trichy franchise in the Tamil Nadu T20 League but had a tournament to forget and this resulted in him being dropped from the Tamil Nadu domestic side. He finally got going in the 2018 edition of the state T20 league as he had complied 325 runs in 9 games for the Kovai franchise. This helped him get back into the Tamil Nadu team and he made his first-class debut in the Ranji Trophy towards the end of 2018. He scored an unbeaten 92 in the first innings and followed it up with an attacking 34 in the second outing. He continued to ply his trade domestically and was part of the Tamil Nadu side that went unbeaten as they won the 2021 Syed Mushtaq Ali Trophy. He was bought by the Punjab franchise for the 2021 Indian Premier League for a sum of INR 5.25 crore and he was a crucial member of the team but could not hit the massive heights expected of him. Nonetheless, he was bought by the same franchise for the 2022 Indian Premier League as they paid INR 9 crore for his services. He had an ordinary campaign once again but was retained for the 2023 season. The 6 foot 6 inches batter still has a lot to prove but has ample ability to make it big on the world stage. While his contributions in the IPL may not have been as remarkable as his potential, Shahrukh Khan continued to impress as an all-rounder and captain in Tamil Nadu's local TNPL league. Leading the Lyca Kovai Kings, he guided them to the title and also took them to the final the following season, although they couldn't defend their crown. In 2024, he found a new home with Gujarat Titans, but his performance was inconsistent, managing only 127 runs with just one fifty. Despite this, Gujarat Titans retained him for the 2025 IPL season, trusting his finishing skills and ability to hit big shots.",
  "nationality": "India",
  "career_span": {
    "Test": "2023",
    "ODI": "2022",
    "IPL": "2021-2025"
  }
}