{
  "id": "pprofile_7797",
  "type": "player_bio",
  "player": "Mohammad Nabi",
  "full_name": "Mohammad Nabi Eisakhil",
  "dob": "January 1, 1985",
  "role": "All-Rounder",
  "batting_style": "Right Handed",
  "bowling_style": "Off break",
  "teams": [
    "Pakistan Customs",
    "Kent",
    "Leicestershire",
    "MCC",
    "Northamptonshire",
    "Kolkata Knight Riders",
    "Mumbai Indians",
    "Afghanistan",
    "Hobart Hurricanes",
    "Melbourne Renegades",
    "Afghan Cheetas",
    "Chattogram Challengers",
    "ICC Combined Associate and Affiliate XI",
    "Sylhet Strikers",
    "Sunrisers Hyderabad",
    "Rangpur Riders",
    "Saint Lucia Kings",
    "Jamaica Tallawahs",
    "Mohammedan Sporting Club",
    "St Kitts and Nevis Patriots",
    "Comilla Victorians",
    "Quetta Gladiators",
    "Karachi Kings",
    "Kabul Eagles",
    "Mis-e-Ainak Knights",
    "Bangla Tigers",
    "Pakhtoons",
    "Surrey Jaguars",
    "Balkh Legends",
    "Delhi Bulls",
    "London Spirit",
    "Colombo Strikers",
    "Dambulla Sixers",
    "Fortune Barishal",
    "Chennai Brave Jaguars",
    "Bukhatir XI",
    "Sharjah Warriorz",
    "Harare Bolts",
    "New York Lions CC",
    "Ajman Bolts",
    "Grand Cayman Falcons"
  ],
  "bio": "Mohammad Nabi is the name of the person who has represented Afghanistan across the world for so long since his debut in international cricket. He is a name synonymous with the Afghan national side as some fans from different countries have started following the Afghanistan team just because of him. He was born in Logar Province, Afghanistan, but his journey in cricket started in Peshawar, Pakistan, where his family had moved to escape war. At just 10 years old, he picked up a cricket bat, playing with friends who would later become Afghanistan's cricket stars. In 2003, he played his first competitive match, showing his talent with a top score of 61 runs. However, Afghanistan's cricket scene was tough as the players had to rely on gear borrowed from Pakistan and India. That didn't stop Nabi. In 2006, he caught the attention of former England captain Mike Gatting after scoring a century against the Marylebone Cricket Club. That performance earned him a place in England’s Young Cricketers program, and soon he made his first-class debut against Sri Lanka A in 2007. His international journey truly began when Afghanistan started rising through the ranks in world cricket. Nabi played a key role in Afghanistan’s success in the World Cricket League, helping them win Division Five in 2008 and moving up quickly. By 2009, Afghanistan had achieved ODI status, and in their first-ever ODI match against Scotland, Nabi scored 58 runs and won the Player of the Match award. This was just the beginning. He played in Afghanistan’s first T20 international in 2010, and when the team made their T20 World Cup debut the same year, Nabi was already one of their most important players. By 2013, he was named Afghanistan's captain and led the team in their first major ODI tournament, the 2014 Asia Cup. Under his leadership, Afghanistan stunned Bangladesh, marking their first-ever win against a Test-playing nation. He also led the team in the 2015 Cricket World Cup, but after Afghanistan won just one match, he stepped down from captaincy. His form struggled for a while but when Afghanistan played Zimbabwe in 2015, a coaching decision to push him up the order changed everything. He scored his maiden ODI century and led Afghanistan to a historic series win which was the first time an associate team had beaten a Full Member in a bilateral series. Nabi continued to play a crucial role in Afghanistan’s historic moments. He was part of their squad for their first-ever Test match against India in 2018. He also helped Afghanistan beat Pakistan for the first time in any format in 2023 with a stunning all-round performance. In 2024, he picked up his first-ever five-wicket haul in ODIs against Ireland. His records are incredible where he has helped Afghanistan defeat 45 different nations in international cricket, and has the fastest fifty by an Afghan player in T20Is. Beyond international cricket, Nabi became a global T20 star, playing in leagues around the world, including the Indian T20 League, PSL, BPL, BBL, CPL, and more. He made history in 2017 by becoming the first Afghan player to play in the Indian T20 League, signing with Sunrisers Hyderabad. Over the years, he represented teams like Kolkata Knight Riders and Karachi Kings in these leagues. He has been a crucial player in T20 leagues, often performing when it mattered most. While his career has been full of highs, Nabi also faced some controversies. Twice, he was found guilty of breaching the ICC Code of Conduct while playing against Ireland. Despite this, he remains one of the greatest cricketers Afghanistan has ever produced. Even as he stepped away from Test cricket in 2019 to focus on limited-overs cricket, his legacy as the man who helped Afghanistan rise from division cricket to the world stage remains untouched. In 2024, he played for Afghanistan in the T20 World Cup, proving that even at 39, Mohammad Nabi is still one of the most reliable all-rounders in world cricket.",
  "nationality": "Afghanistan",
  "career_span": {
    "Test": "2018-2019",
    "ODI": "2009-2025",
    "IPL": "2017-2024"
  }
}