{
  "id": "pprofile_67752",
  "type": "player_bio",
  "player": "Anuj Rawat",
  "full_name": "Anuj Rawat",
  "dob": "October 17, 1999",
  "role": "Wicket-Keeper",
  "batting_style": "Left Handed",
  "bowling_style": "-",
  "teams": [
    "India A",
    "Royal Challengers Bengaluru",
    "Rajasthan Royals",
    "India Under-19",
    "Delhi",
    "Gujarat Titans",
    "Canara Bank",
    "Bank of Baroda",
    "East Delhi Riders"
  ],
  "bio": "Anuj Rawat, a talented wicket-keeper batter, discovered his passion for cricket at a tender age. His journey into professional cricket began with a bang when he debuted for Delhi in the 2017-18 Ranji Trophy, showcasing his potential with a remarkable innings of 71 runs. Over the years, Rawat's versatility has been evident as he transitioned smoothly from middle-order batting to opening the innings for his domestic team, a move that proved to be highly successful. Notably, Rawat's standout moment in first-class cricket came against Madhya Pradesh, where he unleashed his batting prowess to notch an impressive 134 runs, establishing a milestone in his career. With a commendable average across all formats, Rawat's adaptability and ability to innovate on the field set him apart. In the T20 arena, Rawat has been a consistent performer, amassing over 600 runs in his initial 40 matches. His promising track record caught the attention of Rajasthan, who acquired his services for the 2021 Indian Premier League. Despite limited opportunities, Rawat made his mark, especially during his stint with Bengaluru in the subsequent season. His explosive innings of 66 runs off just 47 balls against Mumbai showcased his potential as a game-changer. Anuj Rawat's IPL journey began with Rajasthan Royals in the 2021 season. Although he struggled with the bat that year, his career took a turn when he joined Royal Challengers Bangalore (RCB) in 2022. Despite facing inconsistency in his selection for the playing XI, which often saw him warming the bench, 2022 proved to be his best year in the IPL. He scored 129 runs, including his only fifty to date, marking a standout performance. Rawat's prospects brightened with the introduction of the Impact Player rule in the 2023 Indian Premier League season, offering him the opportunity to make significant contributions for Bengaluru. Entrusted with the crucial finisher role, he delivered commendably despite limited opportunities to showcase his skills. Bengaluru's unwavering faith in him was evident as they opted to retain him for the upcoming 2024 edition. Fresh off an impressive performance in the 2024 DY Patil T20 Cup, where he smashed a scintillating century for Income Tax, Rawat's form and determination underscore his significance as a valuable asset to his team. With his talent and resilience, Rawat is poised to continue making a significant impact in the future, further solidifying his position in the cricketing landscape. Rawat also played a crucial role in leading Delhi to the semifinals of the Syed Mushtaq Ali Trophy, delivering a match-winning, unbeaten knock of 73 runs off just 33 balls to guide his team past Uttar Pradesh and into the next stage. Ahead of the 2025 IPL season auction, Royal Challengers Bangalore released Anuj Rawat and opted not to use the Right to Match (RTM) card. However, Rawat found a new home with Gujarat Titans, who secured him at his base price of INR 30 lakh.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "",
    "IPL": "2021-2024"
  }
}