{
  "id": "pprofile_18182",
  "type": "player_bio",
  "player": "Sisanda Magala",
  "full_name": "Sisanda Somila Bruce Magala",
  "dob": "January 7, 1991",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm fast medium",
  "teams": [
    "South Africa",
    "Border",
    "Eastern Province",
    "South Africa A",
    "Titans",
    "Chennai Super Kings",
    "Warriors",
    "DP World Lions",
    "Nelson Mandela Bay Stars",
    "Cape Town Blitz",
    "Nelson Mandela Bay Giants",
    "AB’s Eagles",
    "Sunrisers Eastern Cape",
    "Durban Wolves"
  ],
  "bio": "Not too long back, pace bowlers who could play the longest format of the game for extended periods held immense value but with the advent of modern-age cricket, bowlers with variations became a requirement. Sisanda Magala adapted his game to excel in bowling yorkers mixed up with well-disguised slower deliveries and began to prove his worth in limited-overs cricket. Born on 7th January 1991 in Port Elizabeth situated in the Eastern Cape province of South Africa, the right-handed fast bowler was recruited by the Eastern Province side towards the end of 2010 at the age of 19. He made his List A debut in the CSA Provincial One-Day Challenge and instantly impressed claiming three wickets for just 15 runs in the 5.2 overs he bowled. A couple of weeks later, he made his T20 debut in the CSA Provincial T20 Challenge followed by a first-class debut in the CSA Provincial Three-Day Challenge a couple of days later. He was used in short bursts in the longest format of the game and claimed three wickets across two innings. He continued to perform consistently over the next few years in the domestic circuit but had not done enough to get the national selectors interested. Sisanda came into the spotlight courtesy of his performance in the 2016 Africa T20 Cup as he ended the competition as the leading wicket-taker with 12 wickets. He made a case for himself as a longer-format player by taking 20 wickets in 8 games for the Warrior franchise in their first-class season. This got him involved with the South Africa A side and he remained on the fringes of national selection but had to continue to wait for his international bow. He continued to participate in the local T20 leagues and his performance was always above average. His efforts did not go in vain as he was included in South Africa’s white-ball squads to face England and South Africa in 2020 but he was unable to make his international debut due to concerns over his fitness. He opted to switch to the Lions franchise in an attempt to play in conditions that suited his style of play and this worked wonders for him as he ended the 2020-21 season as the leading wicket-taker in the domestic List A as well as T20 competitions. The selectors could no longer ignore his performances and he was included in the limited-overs squad to face Pakistan in the first half of 2021. He made his T20I debut almost 11 years after his domestic debut in the first game of the four-match series but could not translate his form on the world stage as he claimed just three wickets in the series. Toward the end of 2021, he made his ODI debut in a rain-curtailed game against the Netherlands before playing a couple of games against India at the start of 2022. He found himself side-lined once again but returned for the home ODI series against England at the start of 2023. Sisanda will be aware that his late introduction to world cricket leaves him very little time to prove himself but with his bowling abilities and power-hitting lower down the order, he can be a valuable asset to his side.",
  "nationality": "South Africa",
  "career_span": {
    "Test": "",
    "ODI": "2021-2023",
    "IPL": "2023-2023"
  }
}