{
  "id": "pprofile_19394",
  "type": "player_bio",
  "player": "Jonny Bairstow",
  "full_name": "Jonathan Marc Bairstow",
  "dob": "September 26, 1989",
  "role": "Wicket-Keeper",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm medium",
  "teams": [
    "England",
    "England A",
    "England XI",
    "Yorkshire",
    "Punjab Kings",
    "Mumbai Indians",
    "Melbourne Stars",
    "England Lions",
    "Sunrisers Hyderabad",
    "Peshawar Zalmi",
    "World XI",
    "Kerala Knights",
    "Team Abu Dhabi",
    "Welsh Fire",
    "Team Morgan",
    "Joburg Super Kings",
    "Sunrisers Eastern Cape",
    "Abu Dhabi Knight Riders"
  ],
  "bio": "One of the key members of England’s renaissance post their disastrous outing in the 2015 Cricket World Cup is Jonny Bairstow who also proved to be the catalyst that stopped their slide in Test cricket by personifying the use of Bazball, a positive approach under the captaincy of Ben Stokes and coach Brendon McCullum. Born on 26th November 1989 in Bradford in the West Yorkshire county of England, Jonathan who is fondly known as Jonny was the second son of former England wicket-keeper David Bairstow. He made an early mark in youth cricket as he won the Young Wisdens School Cricketer of the Year award in 2007 for an outstanding season in which he scored 654 runs. His talent was instantly recognized and he was promoted to play for the Yorkshire Second XI. Due to his consistent performances with the bat, he made his first-class debut for the Yorkshire senior side in the County Championship Division One midway through 2009. His unbeaten 82 in the second innings on a difficult pitch showed his fighting ability at an early age and he immediately cemented his place in the side as a wicket-keeper batter. A few days later he made his List A debut in the Pro40 Division One but was unfortunately dismissed on a golden duck. A year later he made his T20 debut in the Friends Provident T20 and became a regular for Yorkshire in all three formats. He was drafted into the England Lions squad and continued to impress the national selectors with his performance. Having failed to convert his numerous half-centuries into a bigger score, he finally notched up his maiden first-class century when he scored 205 against Nottinghamshire midway through 2011. This instantly propelled him into the national squad and he made his ODI debut against India a few months later where he scored an impressive 41 in 21 balls to be adjudged Player of the Match. A week later he made his T20I debut against West Indies and became a part of England’s white-ball squad as a pure batter. Almost a year later in 2012, he made his Test debut against West Indies, and even though he put on some decent performances over the next year, he found himself in the reserves as there were more established wicket-keepers as well as batters in the side. He was part of the squad for the 2012 ICC Men’s T20 World Cup but over the next few years, he played second fiddle to Jos Buttler and found his chances limited. However, England’s early exit in the 2015 Cricket World Cup changed the landscape of both English cricket and Jonny’s career. England’s hunt for change and fresh faces led them to choose Jonny as the first-choice wicketkeeper in red-ball cricket. He scored his maiden Test century which was also his first in international cricket against South Africa at the start of 2016. Over the next two years, he scored 3 more centuries before scoring his maiden ODI century against West Indies towards the end of 2017. His diminishing form in Test cricket coincided with his peaking in the game's shorter formats as he became the first England batter to score centuries in three consecutive 50-over games in 2018. This run-scoring momentum gathered pace at the right moment for England as they looked forward to seeking redemption in the 2019 Cricket World Cup. In the World Cup, he proved to be one of the deadliest opening batters and played a crucial role in leading England to their maiden title. He scored consecutive centuries against India and New Zealand and was awarded the Player of the Match award in both games. He represented the Hyderabad franchise in the 2019 Indian Premier League and impressed everyone with his extraordinary power-hitting as he notched up his maiden IPL century in just his third game. However, his dip in form in Test cricket resulted in him being omitted from the side in 2019 only to make a stellar comeback in 2021 scoring the only century for England in the Ashes series and helping his side to a draw in that game. He was part of England’s squad for the 2021 ICC Men’s T20 World Cup and had by then cemented his spot in the ODI and T20I sides. He was bought by the Punjab franchise for the 2022 Indian Premier League but began finding his form towards the latter part of the competition. England’s success in white-ball cricket hurt their performance in the longest format of the game. In 2022, a complete overhaul saw Ben Stokes given the reign of the Test side and he encouraged his team to play fearless cricket. Jonny was at the forefront of this change of approach and he justified the faith shown in him by scoring 4 hundreds in the summer taking his 2022 century tally to 6. He was ruled out of the 2022 ICC Men’s T20 World Cup after breaking his leg in a freak golf accident and it seemed like a massive blow to England’s chances, especially with the kind of form he was in but they went on to claim the title in his absence. His performances in 2022 resulted in him being awarded the Professional Cricketer’s Association Men’s Cricketer of the Year and also given the Cricket Writer’s Club Bob Willis Trophy. He was retained by the Punjab franchise for the 2023 Indian Premier League but was not able to recover in time and was replaced by Matthew Short. After recovering from his injury, he got straight back into the national team and was also part of the disappointing 2023 ICC Men's ODI World Cup campaign. Bairstow was also part of a controversial stumping from Alex Carey in the 2023 Ashes, which sparked a major debate across the cricketing world. However, a player of his caliber and his records made Punjab retain him once again for the 2024 Indian Premier League. However, he could not make much impact and went unsold for the next season. Bairstow played his 100th Test in the fifth match of the series against India and also completed 6000 runs in the format. But he was dropped after that series due to his declining form. Bairstow made his way into the team for the 2024 T20 World Cup where England were knocked out by India in the semi-final. He has proven his worth in all three formats of the game and can be considered one of the many talented players produced by England.",
  "nationality": "England",
  "career_span": {
    "Test": "2012-2024",
    "ODI": "2011-2023",
    "IPL": "2019-2025"
  }
}