{
  "id": "pprofile_66558",
  "type": "player_bio",
  "player": "Ajay Mandal",
  "full_name": "Ajay Jadav Mandal",
  "dob": "February 25, 1996",
  "role": "All Rounder",
  "batting_style": "Left Handed",
  "bowling_style": "Slow left-arm orthodox",
  "teams": [
    "Chennai Super Kings",
    "Delhi Capitals",
    "Chhattisgarh",
    "Chhattisgarh Blue"
  ],
  "bio": "Ajay Jadav Mandal, a promising all-rounder from India, has been making waves in the domestic cricket circuit with his impressive performances. Born on February 25, 1996, Mandal has showcased his prowess with both bat and ball, making him a valuable asset to any team. His journey began with a first-class debut for Chhattisgarh in the 2016-17 Ranji Trophy, where he quickly established himself as a key player. With a batting average in the mid-30s and a bowling average of under 30 in first-class cricket, Mandal has proven his mettle in the longer format of the game. His ability to score crucial runs and take vital wickets has been instrumental in Chhattisgarh's success in domestic tournaments. Mandal's standout performances include a remarkable 241* against Uttarakhand, showcasing his ability to play long innings and anchor the team's batting. His bowling has been equally impressive, with a best figure of 7/7 against Puducherry, highlighting his knack for taking wickets in crucial moments. In the shorter formats, Mandal has continued to impress, with a best performance of 5/10 against Assam in the Syed Mushtaq Ali Trophy. His all-round capabilities have not gone unnoticed, earning him a spot in the Chennai squad for the IPL 2023, although he did not get a chance to play. In terms of career statistics, Mandal has played about 40 first-class matches, scoring over 1,800 runs with four centuries and nine fifties. His bowling record is equally impressive, with well over 100 wickets at an average of under 30, including five five-wicket hauls. Mandal's leadership qualities and match-winning performances have been evident in domestic cricket, where he has often been the go-to player for Chhattisgarh in pressure situations. His ability to perform under pressure and deliver match-winning performances has been a hallmark of his career so far. Looking ahead, Ajay Mandal is set to continue his journey in domestic cricket with upcoming fixtures in the Ranji Trophy and other domestic tournaments. His performances in these tournaments will be crucial in determining his future prospects in Indian cricket. He will also be a part of the 2025 Indian Premier League with the Delhi side having picked him up at the mega auction. In conclusion, Ajay Mandal is a rising star in Indian cricket with the potential to make a significant impact on the international stage. His all-round abilities, combined with his determination and work ethic, make him a player to watch out for in the future.",
  "nationality": "India",
  "career_span": {}
}