{
  "id": "pprofile_10232",
  "type": "player_bio",
  "player": "Jason Holder",
  "full_name": "Jason Omar Holder",
  "dob": "November 5, 1991",
  "role": "All-Rounder",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm medium fast",
  "teams": [
    "West Indies",
    "Barbados Pride",
    "Northamptonshire",
    "Sagicor High Performance Centre",
    "West Indies A",
    "Worcestershire",
    "Combined Campuses and Colleges",
    "Kolkata Knight Riders",
    "Chennai Super Kings",
    "Rajasthan Royals",
    "Otago Volts",
    "West Indies Under-19",
    "Sydney Sixers",
    "Sunrisers Hyderabad",
    "Barbados Royals",
    "St Kitts and Nevis Patriots",
    "Comilla Victorians",
    "Islamabad United",
    "Khulna Tigers",
    "West Indians",
    "Lucknow Super Giants",
    "Morrisville Samp Army",
    "Durban's Super Giants",
    "Abu Dhabi Knight Riders",
    "Dubai Capitals",
    "Los Angeles Knight Riders"
  ],
  "bio": "It is always difficult to ignore a man who is 6'7\" tall and when you're talented as well then it just becomes impossible to ignore. That is what Jason Holer is. A tall and lanky all-rounder talented with both the bat and ball. Born in Barbados, Holder was impressive in youth level cricket. He was named in the 2010 Under-19 World Cup and big Jason did not disappoint. He finished the tournament as the leading wicket-taker for West Indies with 12 wickets and helped the young Caribbean side finish third in the tournament. His performance in the domestic level did not go unnoticed and he was selected as a replacement for Tino Best in 2012. Though Holder had to wait a year to make his debut against Australia in ODIs. Almost after a year, T20I and Test debut also followed. He did not make much of an impact in the series with the ball but scored some vital runs down the order. Although that was not enough as he sat out of the subsequent series against Bangladesh. Just around a year in international cricket and that too in a period of uncertainty in West Indies cricket, Holder was given the toughest job. With a lot of senior players in a standoff against the West Indies board, Holder was tasked with the mammoth job of leading the side in ODIs and Tests. There was a lot of criticism, in the beginning, the way Holder led the side and his decision making came in question but the selectors backed him and Holder led the side in the 2015 World Cup. After a disappointing loss against Ireland, West Indies did manage to reach the quarter-final but lost out to eventual finalists and co-hosts, New Zealand. Holder continued to impress as a player and skipper more in the longest format of the game than in white-ball cricket. He has led the Test side from the front and his all-round display in the home series against England, Holder's overall display blew England away and he reached the top of the charts as he was ranked number 1 in ICC's Test rankings for all-rounders. Holder led West Indies in the 2019 World Cup. Although they started their campaign with a stunning victory over Pakistan, their tournament lost gas and they could muster only one more win which came in their final game of the campaign against Afghanistan. After failing to lead West Indies from the front, Holder was axed as the ODI skipper later on in the year. He, however, continues to be a vital part of the Test and ODI teams.",
  "nationality": "West Indies",
  "career_span": {
    "Test": "2014-2024",
    "ODI": "2013-2023",
    "IPL": "2013-2023"
  }
}