{
  "id": "pprofile_4176",
  "type": "player_bio",
  "player": "Ambati Rayudu",
  "full_name": "Ambati Thirupathi Rayudu",
  "dob": "September 23, 1985",
  "role": "Batsman",
  "batting_style": "Right Handed",
  "bowling_style": "Off break",
  "teams": [
    "India",
    "Hyderabad Heroes",
    "ICL India",
    "Central Zone",
    "Elite Group B",
    "India A",
    "India B",
    "India Emerging",
    "India Green",
    "India Red",
    "India Seniors",
    "Rest of India",
    "South Zone",
    "West Zone",
    "Chennai Super Kings",
    "Mumbai Indians",
    "India Under-19",
    "Hyderabad",
    "Andhra",
    "Vidarbha",
    "Baroda",
    "St Kitts and Nevis Patriots",
    "Delhi Bulls",
    "Bharat Legends",
    "New York Strikers",
    "MI Emirates",
    "Texas Super Kings",
    "Chhattisgarh Warriors",
    "VVIP Uttar Pradesh",
    "Delhi Devils",
    "Indian Royals",
    "India Champions",
    "Konark Suryas Odisha",
    "India Masters"
  ],
  "bio": "Ever since he started training at the National Cricket Academy in 2001, Ambati Rayudu was touted as India's next great batting hope. He is a right-handed middle-order batsman with a compact cricketing technique. Rayudu debuted in the 2001/02 Ranji season and in the next season, he scored a double century and a century in a match against Andhra Pradesh. His contribution of 177 runs in the Under-19 team's tour to England in 2002 helped his team chase a huge total of 305. Subsequently, in 2004, he captained the Indian U-19 team in the Cricket World Cup and used to be a regular part of the India A squad. After starting his Ranji career with Hyderabad, he then switched to Baroda mainly due to his differences with the Hyderabad team management. He then participated in the rebel league in 2007 which led to a ban on him by the BCCI. Following an amnesty offered by the BCCI, this promising batsman returned to domestic cricket in 2009. He was a part of the Indian T20 League where he played for Mumbai in the 2010 season and performed well, earning praise from critics. Later, in 2011, Mumbai once again signed him for the fourth season. Rayudu finally made his India debut in an ODI series against Zimbabwe in 2013. He made an unbeaten 63 on debut, becoming the third-oldest Indian at that time (27 years and 304 days) to score a half-century on his ODI debut. He was also one of the five players who got retained by the Mumbai franchise in 2014 for the coming season of the Indian T20 League. In the next year, Rayudu became the fourth-oldest Indian to score a maiden ODI century. Rayudu was also named in the Indian squad for the 2015 World Cup but did not feature in any game. Other than being a middle-order batsman, Rayudu was also a part-time wicketkeeper for the Mumbai franchise. He played a vital role for Mumbai in clinching the tournament thrice. After playing for a decade in the same franchise, Rayudu got picked by Chennai in the auction for the 2018 Indian T20 League. Apart from playing in the India T20 League, Rayudu kept getting opportunities in the national colors whenever the big boys were rested and he always grabbed those chances and scored runs for India. In the 2018 Indian T20 League, Rayudu, who was a middle-order batsman for Mumbai, got a chance to open for Chennai and he came out booming in that spot proving himself as a versatile player who can adjust in any batting position. He was the 4th highest run scorer of the season. He then helped them to win the title in 2019 and further won another one in 2021. He has been retained by Chennai for the 2023 season as well, but his opportunities could be limited. Following a successful 2018 Indian T20 League season, Rayudu was called up by the national selectors to solve India's no.4 woes and given a number of chances he got, he proved himself as a perfect fit for that spot. However, he missed the bus as the selectors ignored him in favor of Vijay Shankar for the 2019 World Cup squad leading to a sarcastic tweet from Rayudu stating - 'Just Ordered a new set of 3d glasses to watch the world cup'. He was however named as one of the three standbys for the showpiece event. During the 2019 World Cup, a few Indian players got injured but Rayudu was ignored in favor of the likes of Rishabh Pant and Mayank Agarwal. Leading to this, Ambati announced his retirement from all forms of international cricket, thereby putting an end to a career marred by the lack of opportunities.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "2013-2019",
    "IPL": "2010-2023"
  }
}