{
  "id": "pprofile_56964",
  "type": "player_bio",
  "player": "Pat Cummins",
  "full_name": "Patrick James Cummins",
  "dob": "May 8, 1993",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm fast",
  "teams": [
    "Australia",
    "Australia A",
    "Kolkata Knight Riders",
    "Delhi Capitals",
    "Mumbai Indians",
    "New South Wales",
    "Australia Under-19",
    "Australian XI",
    "Perth Scorchers",
    "Sydney Sixers",
    "Sydney Thunder",
    "Sunrisers Hyderabad",
    "Australians",
    "San Francisco Unicorns"
  ],
  "bio": "Patrick Cummins made an instant impact as a 17-year-old on the Australian domestic scene. In his first match, he was drafted into the New South Wales side in a Big Bash match against Tasmania. Cummins ended the game with figures of 3-29 from his four overs. The teenage sensation came back to haunt Tasmania at Hobart, in the Big Bash, bagging his career-best figures of 4/16. He ended the series with 11 wickets in six matches, hence becoming the highest wicket-taker of the 2010-11 Big Bash season. Cummins’ efforts paid rich dividends as he became one of the few fresh faces in Australia’s Twenty20 squad for their tour to South Africa in 2011. On his international debut in the 1st T20I, his figures of 3-25 were deemed impressive enough to grant him a Test call-up for the series against South Africa. His debut was a memorable one as he bagged 7 wickets and subsequently the Man of the Match award. Incidentally, all his debuts in the three formats came against the same opponent, South Africa. The tall, lanky lad was a part of Australia’s Under-19 squad in the Quadrangular series and was then named in the T20I squad ahead of the 2012 World Twenty20. Later that year, he was signed up by the Sydney Sixers ahead of the Champions League T20. In 2014, Pat Cummins played for the Kolkata franchise as he got his first taste of the Indian Premier League. Cummins always came across as a very promising bowler but his career in the initial stages was plagued by injuries. Once he recovered from a stress fracture in his back, Australia included him in the Test squad as a replacement for Ryan Harris during the 2015 Ashes, however, he didn't get the chance to play. Finally, after a wait of more than five years, Pat got to play a Test match in 2017 when Mitchell Starc pulled out due to injury. Since then, Cummins has not looked back and has become an integral member of the national team in all formats of the game. His fitness has improved immensely and it's reflected in his performance as well. Seeing his progress, Australia appointed him as one of the two vice-captains alongside Travis Head in Tests in 2019. Cummins repaid the faith shown in him by picking the most number of wickets in the 2019 Ashes. He was also Australia's second-most successful bowler during the World Cup in 2019. Owing to his recent success, there was a war of bids for him ahead of the 13th season of the Indian Premier League and Cummins was eventually bagged by Kolkata for INR 15.5 crore, making him the most expensive foreign buy at the League players' auction. The biggest personal honour for Cummins came when he was made a full-time Australian Test captain for the 2021-22 Ashes series. Australia dominated the Ashes and it was followed by a historic series win against Pakistan in 2022. Pat Cummins is a rare talent who has almost all the attributes of a great fast bowler and is surely one of the top fast bowlers going around in world cricket. Pat Cummins had a stellar 2023, both as a captain and as a player as he led the national side to the World Test Championship title by defeating India in the Final at Lord's and then helped Australia retain the Ashes by drawing the series against England a couple of months later. But his biggest achievement came when almost against all odds, he led the Australian side to the ICC Men's World Cup title against hosts and undefeated India in the Final and Cummins has written his name in cricketing royalty. In December 2023 and January 2024, Pat Cummins captained Australia to a retention of the Benaud–Qadir Trophy, leading his team to a dominant 3-0 series victory against Pakistan. During the Second Test at the MCG, Cummins registered his second career 10-wicket haul and surpassed the milestone of 250 Test dismissals. In May 2024, he was named in Australia's squad for the 2024 ICC Men's T20 World Cup, where he became only the second cricketer to take two hat-tricks in consecutive international matches. Adding to his legacy, Cummins led Australia to their first Border-Gavaskar Trophy series win since 2015, securing a 3-1 triumph in the 2024-25 series against India at home. He played a crucial role, picking up 25 wickets and contributing 159 runs. However, during the series, Cummins suffered an ankle injury, ruling him out of the 2025 Champions Trophy, which he was set to lead.",
  "nationality": "Australia",
  "career_span": {
    "Test": "2011-2025",
    "ODI": "2011-2024",
    "IPL": "2014-2025"
  }
}