{
  "id": "pprofile_88542",
  "type": "player_bio",
  "player": "Arshin Kulkarni",
  "full_name": "Arshin Atul Kulkarni",
  "dob": "February 15, 2005",
  "role": "All Rounder",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm medium",
  "teams": [
    "India Under-19",
    "Maharashtra",
    "India A Under-19",
    "Maharashtra U-19",
    "India F Under-19",
    "Lucknow Super Giants",
    "Eagle Nashik Titans"
  ],
  "bio": "Arshin Kulkarni, a promising all-rounder from India, has been making waves in the cricketing world with his dynamic performances. At just 19 years old, Kulkarni has already showcased his potential in various domestic formats, particularly in the Ranji Trophy and the Vijay Hazare Trophy. His right-handed batting and right-arm medium bowling have been instrumental in his team's successes, and his ability to contribute with both bat and ball makes him a valuable asset. Kulkarni's recent performances in the Vijay Hazare Trophy have been noteworthy, with a batting average of over 95 and a strike rate of over 80. He scored a century against Punjab, amassing 107 runs off 137 balls, and followed it up with a solid 90 against Vidarbha. His bowling has also been effective, highlighting his ability to maintain pressure on the opposition. In the Ranji Trophy, he has shown his prowess with the bat, scoring 87 against Jammu and Kashmir, and with the ball, taking a couple of wickets against Services. While Kulkarni is yet to make his mark on the international stage, his performances in domestic cricket have caught the attention of selectors. His all-round capabilities were on display during the ICC Under-19 Cricket World Cup, where he scored a century against the USA Under-19 team and took crucial wickets against Nepal Under-19. Kulkarni's journey in the IPL with the Lucknow has been a learning curve. Although his opportunities have been limited, he has shown glimpses of his talent. His stint in the Maharashtra Premier League with the Eagle Nashik Titans was more fruitful, where he scored a blistering 117 against Puneri Bappa and took 4 wickets in the same match, showcasing his match-winning abilities. As Arshin Kulkarni continues to develop his skills, the cricketing fraternity eagerly awaits his transition to the international arena. Kulkarni's journey promises to be an exciting one, and his performances will be closely watched by fans and selectors alike.",
  "nationality": "India",
  "career_span": {
    "IPL": "2024"
  }
}