{
  "id": "pprofile_68361",
  "type": "player_bio",
  "player": "Dominic Drakes",
  "full_name": "Dominic Conneil Drakes",
  "dob": "February 6, 1998",
  "role": "All-Rounder",
  "batting_style": "Left Handed",
  "bowling_style": "Left-arm medium fast",
  "teams": [
    "West Indies",
    "Barbados Pride",
    "Warwickshire",
    "West Indies A",
    "Yorkshire",
    "Chennai Super Kings",
    "Victoria",
    "Barbados Royals",
    "St Kitts and Nevis Patriots",
    "Bangla Tigers",
    "Multan Sultans",
    "Delhi Bulls",
    "West Indies Emerging Team",
    "Colombo Strikers",
    "Gujarat Titans",
    "Dubai Capitals",
    "Gulf Giants",
    "Settlers",
    "Team Weekes",
    "Los Angeles Knight Riders",
    "Clarion County Eagles",
    "New York Lions CC"
  ],
  "bio": "Dominic Conneil Drakes, son of the former West Indian fast bowler Vasbert Drakes, was born on 6th February 1998 in Barbados. Drakes is a left-arm fast-medium bowler who is known for his variations and prowess in the shortest format of the international game. He plays for Barbados in the West Indies domestic circuit and, in 2022, signed with English County side Yorkshire. Dominic Drakes made his first-class debut for Barbados in the 2017-18 Regional Four Day Competition and soon played his first List A game as well. Ahead of the 2018 Caribbean Premier League, Drakes was named as one of five players to watch out for in the tournament. He made his T20 debut for Barbados Tridents in the tournament but moved to St Kitts and Nevis Patriots in 2019. On 15th September 2021, Drakes scored an unbeaten 48 runs off 24 balls in the final of the 2021 CPL, which helped St Kitts and Nevis Patriots to earn their first CPL title. He was also named the Player of the match. The following month, Dominic was added to the Chennai squad for the 2021 Indian T20 League, replacing Sam Curran, who was ruled out due to injury. In February 2022, he was bought by the Gujarat franchise but didn't play a single game. Drakes is considered to be one of the bright young stars coming from the Caribbean Island and he will be eager to leave his mark at a higher level.",
  "nationality": "West Indies",
  "career_span": {
    "Test": "",
    "ODI": "2023-2023",
    "IPL": ""
  }
}