{
  "id": "pprofile_65291",
  "type": "player_bio",
  "player": "Rovman Powell",
  "full_name": "Rovman Powell",
  "dob": "July 23, 1993",
  "role": "Batsman",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm medium fast",
  "teams": [
    "West Indies",
    "Jamaica Scorpions",
    "West Indies A",
    "Combined Campuses and Colleges",
    "Kolkata Knight Riders",
    "Delhi Capitals",
    "Rajasthan Royals",
    "Barbados Royals",
    "Jamaica Tallawahs",
    "Dhaka Capitals",
    "Comilla Victorians",
    "Quetta Gladiators",
    "Peshawar Zalmi",
    "West Indians",
    "Bangla Tigers",
    "Multan Sultans",
    "Northern Warriors",
    "Delhi Bulls",
    "Trent Rockets",
    "Kandy Falcons",
    "New Jersey Stallions",
    "Dubai Capitals",
    "Los Angeles Knight Riders"
  ],
  "bio": "Rovman Powell is a Jamaican cricketer. He is primarily a middle-order batter and an occasional medium-pace bowler. He has been representing West Indies in ODIs since 2016 but it took him close to five years to secure his place in the team. Powell came into the spotlight when he made his List A debut at the start of 2015 and was named the Player of the Match in his very first competitive game. He highlighted his all-round abilities, picking up 3 wickets and scoring 31 crucial runs and rose to prominence. Driven by a successful domestic campaign, he made his international debut in an ODI match against Sri Lanka. Even in his first international outing, he showcased his hitting ability and scored a quickfire 44 of 29 balls. He played an important role in Jamaica's victory in the semi-final of the Super50 Cup in 2016. Even though Jamaica lost in the final, Powell's all-round performance made him a star in the Caribbean. In the 2017 season, Powell was roped in by the Kolkata franchise in the Indian T20 League owing to his hitting abilities, but he did not get any chance to play a game for them. In February 2018, he was named as one of the ten players to watch out for ahead of the 2018 Cricket World Cup Qualifier tournament. Post the conclusion of the Qualifier tournament, the ICC titled Powell the rising star of the West Indies. Powell exposed himself to several franchise cricket competitions and proved his worth. In 2022, Powell scored his maiden T20I century against England. In the same year, he was also signed by Delhi for the Indian T20 League. An exciting player with a talent for power-hitting, Powell has made a name for himself and is often looked at as a handy finisher.",
  "nationality": "West Indies",
  "career_span": {
    "Test": "",
    "ODI": "2016-2023",
    "IPL": "2022-2025"
  }
}