{
  "id": "pprofile_65430",
  "type": "player_bio",
  "player": "Venkatesh Iyer",
  "full_name": "Venkatesh Rajasekaran Iyer",
  "dob": "December 25, 1994",
  "role": "All-Rounder",
  "batting_style": "Left Handed",
  "bowling_style": "Right-arm medium",
  "teams": [
    "India",
    "Central Zone",
    "Lancashire",
    "Kolkata Knight Riders",
    "Madhya Pradesh",
    "DY Patil Group A",
    "Gwalior Cheetahs",
    "Indore Pink Panthers"
  ],
  "bio": "Venkatesh Iyer is a left-handed batting all-rounder representing India. Born in Indore, Iyer began his professional career when he made his T20 debut for Madhya Pradesh against Saurashtra during the 2014-15 Syed Mushtaq Ali Trophy season. Later in the year, he represented Madhya Pradesh in the List A format during the 2015-16 Vijay Hazare Trophy. Three years later, in 2018, Iyer made his first-class debut for Madhya Pradesh against Hyderabad in the 2018-19 Ranji Trophy. The Kolkata franchise showed faith in him and acquired his services for the 2021 Indian Premier League season. He had a brilliant debut season and played a key role in Kolkata's journey to the final. After the Indian Premier League season, Iyer received his maiden call-up to the national side for the T20I series against New Zealand. He made his T20 debut in that series and would later go on to make his ODI debut against South Africa in January 2022. Having been retained by Kolkata ahead of the auction for the 2023 Indian Premier League, Iyer will hope to continue his bat for the side and put in a good performance. Venkatesh Iyer bats in the lower order for India and Madhya Pradesh but at the same for his franchise side, he is used at the top of the order. He is an attacking batter, and his height makes him one of the toughest players to bowl at. He is a decent operator with his medium-pace bowling and will only get better with time. Venkatesh Iyer is a left-handed batting all-rounder representing India. Born in Indore, Iyer began his professional career when he made his T20 debut for Madhya Pradesh against Saurashtra during the 2014-15 Syed Mushtaq Ali Trophy season. Later in the year, he represented Madhya Pradesh in the List A format during the 2015-16 Vijay Hazare Trophy. Three years later, in 2018, Iyer made his first-class debut for Madhya Pradesh against Hyderabad in the 2018-19 Ranji Trophy. The Kolkata franchise showed faith in him and acquired his services for the 2021 Indian Premier League season. He had a brilliant debut season and played a key role in Kolkata's journey to the final. After the Indian Premier League season, Iyer received his maiden call-up to the national side for the T20I series against New Zealand. He made his T20 debut in that series and would later go on to make his ODI debut against South Africa in January 2022. Having been retained by Kolkata ahead of the auction for the 2023 Indian Premier League, Iyer scored over 400 runs in that season. He then backed it up 370 runs in the folliwing season, including a fifty in the final as Kolkata lifted their third title. He was once again retained ahead of the 2025 IPL auction. Venkatesh Iyer bats in the lower order for India and Madhya Pradesh but at the same for his franchise side, he is used at the top of the order. He is an attacking batter, and his height makes him one of the toughest players to bowl at. He is a decent operator with his medium-pace bowling and will only get better with time.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "2022-2022",
    "IPL": "2021-2025"
  }
}