{
  "id": "pprofile_65723",
  "type": "player_bio",
  "player": "Mukesh Kumar",
  "full_name": "Mukesh Kumar",
  "dob": "October 12, 1993",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm medium",
  "teams": [
    "India",
    "East Zone",
    "India A",
    "India B",
    "Rest of India",
    "Delhi Capitals",
    "Bengal",
    "East Bengal Club",
    "Barrackpore Bashers",
    "Sobisco Smashers Malda",
    "Team B"
  ],
  "bio": "Mukesh Kumar is another product of the recent emergence of pace bowlers in India. He is a right-arm fast bowler who rose through the ranks of domestic cricket. Kumar made his first-class debut for Bengal in 2015 against Haryana. He played his first List A game in the same year as well. Kumar worked on himself and performed well for Bengal, especially in the Ranji Trophy. His breakthrough came in the 2021-22 season when he picked up 20 wickets in nine innings and helped Bengal reach the semifinal. However, he slowly started to learn new variations and adjusted his bowling to suit the limited-overs format as well. After looking at his consistent performances, he was added to the squad for India in the series against South Africa in late 2022. In 2023, he was part of the Indian T20I team against Sri Lanka and New Zealand but could not get any games. Before the New Zealand series, he took nine wickets in three unofficial four-day matches against New Zealand A. Kumar was also bought by Delhi for the 2023 Indian Premier League and heading into the 2025 season, he will once again be a part of the Delhi franchise in the IPL. In June 2023, Kumar's international career reached new heights when he was named in the Indian squad for all three formats for the tour of the West Indies. His selection for the tour was a testament to his consistency and potential as a cricketer, providing him with an opportunity to test his skills against top-quality opposition on the international stage. Kumar made his Test debut for India in the second Test of the series against West Indies on July 20, 2023, at Queen's Park Oval, Port of Spain, Trinidad. His debut performance was commendable, as he picked up his maiden Test wicket – that of Kirk McKenzie – and showcased his ability to bowl with pace and control. In subsequent matches, Kumar also made his ODI and T20I debuts for India, further solidifying his position in the national team setup. Mukesh Kumar's rise from humble beginnings to representing India on the international stage is a testament to his talent, dedication, and hard work. With his ability to bowl with pace and accuracy, Kumar has emerged as a potent force in Indian cricket, earning recognition for his performances in domestic and international cricket. As he continues his cricketing journey, Kumar remains committed to achieving greater heights and making significant contributions to Indian cricket, inspiring aspiring cricketers and leaving a lasting legacy in the sport.",
  "nationality": "India",
  "career_span": {
    "Test": "2023-2024",
    "ODI": "2023-2023",
    "IPL": "2023-2025"
  }
}