{
  "id": "pprofile_66044",
  "type": "player_bio",
  "player": "Shivam Dube",
  "full_name": "Shivam Dube",
  "dob": "June 26, 1993",
  "role": "All-Rounder",
  "batting_style": "Left Handed",
  "bowling_style": "Right-arm medium",
  "teams": [
    "India",
    "India A",
    "India Emerging",
    "West Zone",
    "Royal Challengers Bengaluru",
    "Chennai Super Kings",
    "Rajasthan Royals",
    "Mumbai",
    "ARCS Andheri",
    "Shivaji Park Lions",
    "BPCL",
    "Team A"
  ],
  "bio": "Born in Mumbai, Shivam Dube is a kind of cricketer who adds three-dimensional value to the teams he represents. At the early age of 14, Shivam struggled with his fitness and lack of financial support. He though didn't give up and worked hard to get selected for Mumbai Under-23. In the 2015-16 season of the Syed Mushtaq Ali tournament, Shivam made his T20 debut and soon after, he played his first List A game. He had a dream Ranji debut in 2017-18 where he picked up a five-wicket haul. A couple of good seasons with Mumbai gave Dube the exposure and he grabbed eyeballs after hitting five sixes in an over against Baroda in the 2018 Ranji Trophy. With 23 wickets, Shivam had a very successful season and soon received a contract from Bengaluru to represent them in the 2019 edition of the Indian Premier League. The year 2019 proved to be very fruitful for Dube has he made his debut for the national team. His first appearance in T20Is was against Bangladesh and then he got his ODI cap against West Indies. In 2020, during India's tour of New Zealand, Shivam had a day to forget as he conceded 34 runs in an over. It was with the Chennai team in the 2022 season that Dube truly flourished, showcasing a more aggressive style of play and becoming a vital part of the team. Dube's impact was evident during Indian Premier League 2023, playing a vital role in Chennai's title-winning campaign. 2024 started on a promising note for Dube where he was the highest run-scorer for India in the T20I series against Afghanistan. His rare blend of batting power and seam bowling skills earned him a place in India’s squad for the 2024 T20 World Cup, where the team emerged as eventual winners. Shivam Dube marked his international return in spectacular fashion in January 2025, making a significant impact in the T20I series against England. In the fourth T20I at Pune, he delivered a match-winning performance, smashing 53 runs off just 34 balls to earn the Player of the Match award. Dube followed up with another impactful all-round performance in the fifth T20I. He provided explosive batting down the order, scoring a quick-fire 30 runs off just 13 balls. He then showcased his bowling prowess, claiming 2 wickets for only 11 runs in his two-over spell, demonstrating his value as a genuine all-rounder for the Indian team. Shivam Dube was among the five players retained by Chennai Super Kings ahead of the IPL 2025 season. CSK demonstrated their faith in their core group by also retaining Ruturaj Gaikwad, Matheesha Pathirana, Ravindra Jadeja, and the legendary MS Dhoni. Smashing over 1,100 runs at a remarkable strike rate for Chennai Super Kings, in just three seasons—representing the lion's share of his 1,500 career IPL runs—this retention clearly validates Dube's immense value to the franchise. His explosive batting prowess has transformed CSK's middle order, providing the team with a designated power-hitter capable of bowling some crucial overs with the ball as well.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "2019-2024",
    "IPL": "2019-2025"
  }
}