{
  "id": "pprofile_11229",
  "type": "player_bio",
  "player": "Sunil Narine",
  "full_name": "Sunil Philip Narine",
  "dob": "May 26, 1988",
  "role": "All-Rounder",
  "batting_style": "Left Handed",
  "bowling_style": "Off break",
  "teams": [
    "West Indies",
    "Surrey",
    "West Indies A",
    "Kolkata Knight Riders",
    "Trinidad & Tobago Red Force",
    "Cape Cobras",
    "West Indies Under-19",
    "Melbourne Renegades",
    "Sydney Sixers",
    "Fortune Barishal(old)",
    "Guyana Amazon Warriors",
    "Trinbago Knight Riders",
    "Dhaka Capitals",
    "Comilla Victorians",
    "Quetta Gladiators",
    "Lahore Qalandars",
    "Bangla Tigers",
    "Montreal Tigers",
    "Surrey Jaguars",
    "Bravo XI",
    "Deccan Gladiators",
    "Oval Invincibles",
    "Soca Kings",
    "QPCC I",
    "New York Strikers",
    "Durban's Super Giants",
    "Abu Dhabi Knight Riders",
    "Los Angeles Knight Riders"
  ],
  "bio": "With multiple limited-overs tournaments on the rise across the globe, franchises are in search of mystery spinners who can bowl in the Powerplay as well as provide breakthroughs once the field restrictions are eased. Sunil Narine has been one of the most successful mystery spinners in world cricket. Born on 26th May 1988 in Arima in Trinidad and Tobago, Sunil Narine first grabbed the attention of the selectors when he took all 10 wickets in a trial match. He soon got a summon to the Trinidad & Tobago squad in January 2009. He further came into the limelight in the now-defunct Champions League Twenty20 in 2011 while representing Trinidad and Tobago. 2011 was a breakthrough year for the right-arm spinner, as consistent performances in that year earned him a maiden call-up to the West Indies ODI squad. He was selected for the ODI series against India, where he made his ODI debut in Ahmedabad. In 2012, he made his T20I and Test debuts for the West Indies.With multiple limited-overs tournaments on the rise across the globe, franchises are in search of mystery spinners who can bowl in the Powerplay as well as provide breakthroughs once the field restrictions are eased. Sunil Narine has been one of the most successful mystery spinners in world cricket. Narine played a vital role in the West Indies’ title-winning campaign in the 2012 T20 World Cup. He has appeared in various franchise leagues across the globe. In the Indian Premier League, Sunil Narine has been a permanent fixture of the Kolkata franchise, helping them to league titles in 2012 and 2014. The mystery spinner has also plied his trade in several other T20 leagues in the world and remains one of the wily bowlers in the business. Narine went on to open the innings for the Kolkata franchise in 2017 and transformed into a phenomenal striker of the ball having scored more than 1000 runs so far in the Indian Premier League at a strike rate of above 160. He has been consistently retained by his side and has been an integral part of the cricket setup in Kolkata. Having released him ahead of the 2022 auction, the Kolkata franchise went back for their main man paying INR 6 crore for his services, and they have retained him ahead of the 2023 edition. He repaid their faith with a steller campaign in 2024 helping them win thier third title. Narine was also named as the MVP, scoring 488 runs and picking up 17 wickets. He was once again retained by Kolkata for the 2025 season. Sunil Narine can outfox the batters with his bag of tricks, with teams allowing him to express himself in the first six overs as an opener. His multi-dimensional skills make him a valuable asset to any team.",
  "nationality": "West Indies",
  "career_span": {
    "Test": "2012-2013",
    "ODI": "2011-2016",
    "IPL": "2012-2025"
  }
}