{
  "id": "pprofile_66053",
  "type": "player_bio",
  "player": "Rachin Ravindra",
  "full_name": "Rachin Ravindra",
  "dob": "November 18, 1999",
  "role": "All-Rounder",
  "batting_style": "Left Handed",
  "bowling_style": "Slow left-arm orthodox",
  "teams": [
    "New Zealand",
    "Durham",
    "New Zealand A",
    "Wellington Firebirds",
    "Chennai Super Kings",
    "New Zealand Under-19",
    "New Zealand XI",
    "New Zealanders",
    "Manchester Originals",
    "Washington Freedom"
  ],
  "bio": "Rachin Ravindra is an exciting cricketer from New Zealand who quickly made a name for himself on the international stage. His journey from the streets of Wellington to a sensational World Cup debut is a testament to his immense talent and unwavering dedication. Born in Wellington to parents of Indian New Zealander origin, Ravindra was raised in a cricket-loving family. His father, Ravi Krishnamurthy, a software architect, played club-level cricket in Bengaluru before moving to New Zealand in 1997. It was in this environment that Rachin’s passion for the game was nurtured. Interestingly, Ravindra’s first name is a clever combination of two cricketing legends - Rahul Dravid and Sachin Tendulkar - a nod to the sport that would become central to his life. This unique naming choice may have foreshadowed the bright future that awaited him. Ravindra’s cricket journey began at the age of five when he started playing hardball cricket in Wellington. However, what truly set him apart was his annual trips to Bengaluru, where he played in local club cricket. These visits to the land of cricketing legends allowed him to refine his skills, adapt to different playing conditions, and mature as a cricketer. Ravindra’s rise to prominence continued as he represented New Zealand in the 2016 and 2018 Under-19 World Cups, where his exceptional performances earned him the title of 'rising star' of the 2018 squad by the International Cricket Council. The year 2018 marked a pivotal point in his career when he secured a contract with Wellington for the 2018-19 season. Later that year, Ravindra made his List A debut for New Zealand A against Pakistan A. He followed this up with his first-class debut for the same team, again against Pakistan A. His rapid ascent continued, culminating in his first century in List A cricket while playing for Wellington against Auckland in the 2019–20 Ford Trophy. In March 2020, he scored his maiden first-class century during the Plunket Shield season, further showcasing his versatility across formats. Ravindra’s consistent performances earned him a contract with Wellington for the 2020–21 season, cementing his place as a valuable all-rounder. Later that year, he was named to the New Zealand A squad for practice matches against the West Indies, signalling his readiness for the international stage. The year 2021 was a turning point in Ravindra’s career. In April, he was called up to the New Zealand Test squad for their series against England, marking his entry into international cricket. Ravindra’s adaptability was evident when he was selected for New Zealand’s T20I squad for their tour of Bangladesh in August 2021. His T20I debut came in September against Bangladesh, marking a significant milestone in his white-ball career. Later that year, he made his Test debut against India, solidifying his place in the New Zealand team. Ravindra’s journey took another exciting turn in June 2022 when he signed with Durham County Cricket Club to play in the County Championship in England. In his debut match, he scored a remarkable double century, amassing 217 runs against Worcestershire, further cementing his reputation as a reliable and versatile batter. In March 2023, Ravindra made his ODI debut for New Zealand against Sri Lanka, proving his adaptability to the 50-over format. His journey reached new heights in 2023 when he was named in New Zealand’s squad for the World Cup. His World Cup debut was nothing short of spectacular - batting at number three in the opening match against England, he scored an unbeaten 123 runs off just 96 balls, setting a record as the fastest century by a New Zealand player in World Cups. Ravindra’s contributions didn’t end there - he followed up with centuries against Australia (116 off 89) and Pakistan (108 off 94), solidifying his status as a key player for New Zealand. With three centuries in his debut World Cup, he became the first player in history to achieve such a feat. He ended the tournament with 578 runs from 10 matches, at an average of 64.22. Ravindra’s rise to prominence made him a household name in New Zealand cricket. His all-round abilities, ability to perform under pressure, and knack for making significant contributions when it matters most made him a key prospect for the future of New Zealand cricket. In the 2024 Indian Premier League auction, Ravindra was picked up by Chennai for INR 1.80 crores, following his stellar World Cup performances. Rachin Ravindra cemented his status as an indispensable component of the New Zealand team across all formats. While his selection for the ICC T20 World Cup 2024 was a foregone conclusion, the tournament proved disappointing for the Kiwis who suffered early elimination following crucial losses to Afghanistan and West Indies. Ravindra featured in three of the four matches but struggled to make a significant impact. His fortunes changed dramatically when New Zealand toured India for a three-Test series in October 2024. Ravindra emerged as the second-highest run-scorer of the series, amassing 276 runs across 6 innings, highlighted by a magnificent 164 in the decisive third Test. However, consistency remained elusive as he later stumbled against England in a three-Test series, managing just 129 runs at a modest average of 21.50 without registering a single half-century. The IPL 2025 auction brought its own drama. Initially released by Chennai Super Kings, Ravindra nearly found himself joining Punjab Kings before CSK exercised their Right to Match (RTM) card at the last moment, securing his return to the yellow brigade for INR 4 crores. Ravindra began 2025 in blistering form, hammering 125 runs in a three-match T20I series against Sri Lanka on home soil. His top score of 79 proved instrumental in New Zealand clinching the series 2-1. During the Triangular Series in Pakistan—featuring the hosts, South Africa, and New Zealand—which served as preparation for the ICC Champions Trophy 2025, Ravindra's momentum was halted by a facial injury sustained while attempting a catch in the deep, forcing his withdrawal from the remainder of the tournament. The injury sidelined him for New Zealand's Champions Trophy opener against Pakistan, but Ravindra returned with a vengeance. On his Champions Trophy debut against Bangladesh, he crafted a splendid century, becoming the first player in history to score debut hundreds in both the ODI World Cup and Champions Trophy. Ravindra finished as the tournament's leading run-scorer with 263 runs in four matches at a remarkable average of 65.75, including two centuries, one of which came in the semifinal against South Africa. Though his 37 off 29 balls in the final against India couldn't prevent defeat, Ravindra's extraordinary performance throughout the tournament earned him the well-deserved Player of the Tournament accolade.",
  "nationality": "New Zealand",
  "career_span": {
    "Test": "2021-2025",
    "ODI": "2023-2025",
    "IPL": "2024-2025"
  }
}