{
  "id": "pprofile_3676",
  "type": "player_bio",
  "player": "MS Dhoni",
  "full_name": "Mahendra Singh Dhoni",
  "dob": "July 7, 1981",
  "role": "Wicket Keeper",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm medium",
  "teams": [
    "India",
    "Asia XI",
    "East Zone",
    "India A",
    "India Blue",
    "Indian Board Presidents XI",
    "India Seniors",
    "Rest of India",
    "Chennai Super Kings",
    "Jharkhand",
    "Rising Pune Supergiant"
  ],
  "bio": "MS, Mahi, MSD, Thala, Captain Cool, Mahendra Singh Dhoni! Footballer in school, later Traveling Ticket Examiner, Cricketer, Army man, Businessman! The more things seem clear about Dhoni, the more enigmatic (even Bharat Sundaresan couldn’t unravel much in his book, as he himself accepted in the closing chapters) he remains. The man has offered us so many moments to cherish both on the field and off it. The most raved of it all has to be the six that won the 2011 World Cup (needless to say Ravi Shastri’s voice served as the most perfect accompaniment one could wish for). It was a gamble they said when he promoted himself up the order, ahead of Yuvraj Singh. But that was characteristic of MS, always prone to the route not taken and stumping (another characteristic feature) us all on almost every occasion. Things did go wrong at times but that never deterred the man from trusting his instincts. He was the same in pleasure and pain, victory or gain, always managing to stay in the present. Cool as a cucumber they say and so was he. All these qualities kept paying rich dividends for him, the team and the country. The acme of it all – the night of 2nd April 2011 – lifting the World Cup after 28 years. Born in Ranchi, his is a tale of grit, determination, non-conformism and stupefying levels of self-belief. In his early years, he started making waves in the local cricketing circles – a young frail-looking lad clearing the ropes with ease! Despite his talents, his background meant that the journey for him would be arduous. He was upto the task though, slowly but surely. Joining the Railways Ranji team, he began work as a Traveling Ticket Examiner (TTE) at the Kharagpur Railway Station. Soon, things started falling in place for this prodigious wonder as scouts from BCCI’s Training Research Development Wing (whose purpose was to spot talent from the financially backward regions) took note of his skills and soon he was in India A team’s tour to Kenya. His stupendous showing there (a first glance for the world into his power-hitting abilities) got him drafted into the Indian team’s tour to Bangladesh in 2004. However, things were not all smooth at the start. A duck in his debut ODI and a succession of low scores followed, but the then-captain Sourav Ganguly vested his faith in him and decided to give more opportunities to the youngster. Dhoni lived up to all of this. In just his 5th ODI, he registered the famous 148 against Pakistan at Vishakhapatnam. Before the year could end, he hammered a ferocious 183* against Sri Lanka in Jaipur to chase down 299 with ease. There was a deja vu of sorts as in just his 5th Test, Dhoni scored 148 against Pakistan, this time at Faisalabad, in January 2006, to save the match for India and once again displayed his skills at the big stage when it mattered the most. Soon, Dhoni would become a permanent member of the side with his USPs being a much-feared lower-order pinch-hitter who could take any opposition to the cleaners and a man with astute keeping faculties. Dhoni is a very different cricketer when on the field. In batting, Dhoni is able to rock onto the back foot and muscle the ball with his wrists (remember that flat six over deep mid-wicket against Ben Hilfenhaus?). The no-look six against Elliot in 2009 was a prime example of his stillness, both when receiving the line of the ball and at contact. His late high bat lift allowed him to generate enormous power. The ‘Helicopter Shot’? Simply out of this world (we meant the ball too). For his unique thinking powers (remember him asking Sachin to bowl wide to Afridi and then the batter gets stumped by Dhoni in the very next ball), he was recommended by senior players like Sachin, Dravid and Ganguly to take over the captaincy after Dravid stepped down as so. There was absolutely no looking back since then. The 2007 T20 World Cup, 2008 CB Series, the first Test series win in New Zealand in 2009, Asia Cup in 2010, 2011 World Cup, the Test series in West Indies in 2011, Champions Trophy in 2013, Asia Cup T20I in 2016 etc. (seriously, end of thinking capacity here!). All lay at Dhoni’s feet. And then there’s the Indian Premier League, where he has been captaining Chennai since inception. Under him, they won the league titles in 2010, 2011 and in 2018, after making a comeback into the league. Chennai has been the only team to qualify for the playoffs in each edition of their appearance in the league. They have appeared in the finals a record 8 times in the 10 editions that they have played. During Chennai’s absence in 2016 and 2017, he played for Pune and led them into the 2017 League final, where they lost to Mumbai by just one run. Even though he retired early (rather shockingly) from Tests towards the end of 2014, Dhoni enjoyed an unbeaten run in Test series since his captaincy debut and catapulted India to the No.1 rank for the first time. Under him, India extended their domination in home Tests, and drew a series in South Africa (which they were almost close to sealing; had they done so, it would have been a maiden series win for India in South Africa). However, he had his challenges too. After the 2011 World Cup triumph, Dhoni’s captaincy came under question when India registered continuous losses in England and Australia. Rumours regarding his sacking started doing the rounds but all this was soon quelled when Dhoni made some tough calls and himself led the way in the 2013 Border-Gavaskar trophy with his 224 in Chennai. India made a clean sweep of the series at home. Since getting run out against New Zealand in the semi-final of the 2019 World Cup, Dhoni took a long break and his retirement was the hottest topic. On 15th August 2020, Dhoni took to social media and announced his retirement from all forms of international cricket. He posted an emotional video on Instagram thanking everyone and wrote - “Thanks a lot for ur love and support throughout, from 1929 hrs consider me as Retired!” If there’s anything that Dhoni taught us, it is to keep believing. And he continues to do that whenever he is at the crease as MS will continue to play for Chennai in the Indian Premier League. Not only that but after a subdued 2022 Indian Premier League under the captaincy of Ravindra Jadeja, Dhoni took the reigns back and led Chennai to their fifth title in 2023. Dhoni is once again set to be a part of the Chennai squad for the 2024 season but he has stepped down from captaincy, paving the way for Ruturaj Gaikwad to take over the team.",
  "nationality": "India",
  "career_span": {
    "Test": "2005-2014",
    "ODI": "2004-2019",
    "IPL": "2008-2025"
  }
}