{
  "id": "pprofile_3910",
  "type": "player_bio",
  "player": "Kieron Pollard",
  "full_name": "Kieron Adrian Pollard",
  "dob": "May 12, 1987",
  "role": "All-Rounder",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm medium",
  "teams": [
    "West Indies",
    "South Australia",
    "Northamptonshire",
    "Stanford Super Stars",
    "Surrey",
    "Mumbai Indians",
    "Trinidad & Tobago Red Force",
    "Cape Cobras",
    "West Indies Under-19",
    "Somerset",
    "Adelaide Strikers",
    "Melbourne Renegades",
    "Dhaka Gladiators",
    "Barbados Royals",
    "Saint Lucia Kings",
    "Trinbago Knight Riders",
    "Dhaka Capitals",
    "Karachi Kings",
    "Peshawar Zalmi",
    "West Indians",
    "Bloem City Blazers",
    "World XI",
    "Kerala Knights",
    "Multan Sultans",
    "Toronto Nationals",
    "Pollard XI",
    "Deccan Gladiators",
    "London Spirit",
    "Southern Brave",
    "Welsh Fire",
    "Scarlet Ibis Scorchers",
    "QPCC I",
    "New York Strikers",
    "MI Cape Town",
    "MI Emirates",
    "MI New York",
    "West Indies Champions"
  ],
  "bio": "A towering Trinidadian, Kieron Pollard is one of the hardest hitters of the cricket ball and is also a useful medium-pace bowler. Pollard's feats on the domestic circuit and his remarkable display in the 2009 Champions League T20 made him a nation-wide household name. Although he has a decent first-class record, he is seen by many as an ideal cricketer in the limited-over formats. Pollard's impressive domestic performances caught the eye of the national selectors, which then resulted in his ODI debut in 2007. A debut in a World Cup was followed by a recall for the ODI series against New Zealand in 2008. Pollard scores a high proportion of his runs in boundaries, smashing the ball to all corners of the ground. He has produced some stunning innings for Trinidad and it was during the 2009 Champions League T20 that he grabbed attention of billions around the world with a 18-ball 54 for Trinidad and Tobago. He then went on to sign for Mumbai in the Indian T20 League in 2010. He scored his maiden ODI century against India in 2011 in Chennai but unfortunately it ended up in a losing cause. His impact on T20 elevated his status in this format and in the inaugural season of the Caribbean Premier League, he was made captain of the Barbados side where the team did fairly well. Since then, he has produced moments of brilliance sporadically for West Indies but has been consistently doing well for Mumbai in the Indian T20 League. An injury forced him to miss the ICC WT20 in Bangladesh in 2014 but his credentials in the shortest format of the game were enough for him to be retained by the Mumbai franchise for the 2014 edition of the Indian T20 League. He continued to be a vital member of the Mumbai unit while his international career was mostly on and off. Following a disappointing performance at the World Cup and thereafter a complete whitewash against India, Cricket West Indies (CWI) decided to sack Jason Holder and Carlos Brathwaite as skippers of ODI and T20I teams and named Kieron Pollard as captain in limited-overs cricket. The kind of success that Kieron has enjoyed in CPL as a captain is something West Indies would be expecting from him at the international stage.",
  "nationality": "West Indies",
  "career_span": {
    "Test": "",
    "ODI": "2007-2022",
    "IPL": "2010-2022"
  }
}