{
  "id": "pprofile_65630",
  "type": "player_bio",
  "player": "Richard Gleeson",
  "full_name": "Richard James Gleeson",
  "dob": "December 2, 1987",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm fast medium",
  "teams": [
    "England",
    "Lancashire",
    "Northamptonshire",
    "Warwickshire",
    "Chennai Super Kings",
    "Mumbai Indians",
    "Melbourne Renegades",
    "England Lions",
    "Rangpur Riders",
    "Marylebone Cricket Club",
    "Peshawar Zalmi",
    "North",
    "Maratha Arabians",
    "Delhi Bulls",
    "Deccan Gladiators",
    "Team Abu Dhabi",
    "London Spirit",
    "Manchester Originals",
    "Northern Superchargers",
    "Lancashire CCC",
    "Durban's Super Giants",
    "Joburg Super Kings",
    "Sunrisers Eastern Cape",
    "Gulf Giants",
    "Harare Bolts",
    "Hambantota Bangla Tigers"
  ],
  "bio": "Richard James Gleeson, born on December 2, 1987, in Blackpool, Lancashire, is an English cricketer known for his lightning right-arm pace bowling. At the age of 34, Richard James Gleeson made a thunderous international debut, and within his first eight balls, he orchestrated a stunning display of skill and composure by dismissing the Indian stalwarts like Rohit Sharma, Virat Kohli and Rishabh Pant. Richard Gleeson made his first-class debut for Northamptonshire on August 15, 2015, in a match against the Australians. He then made his List A debut for the county the next year in 2016, against Lancashire in the Royal London One-Day Cup. In the early stages of his career, Gleeson was a part-time player for Northamptonshire, appearing in matches on a game-by-game basis while balancing a full-time coaching role for schools and cricket clubs under the Lancashire Cricket Board. However, in July 2016, he secured a three-year contract with the county, marking a significant step forward in his professional career. That same year, he also ventured into T20 cricket, signing with the Rangpur Riders for the 2016 Bangladesh Premier League. By the end of the 2018 season, Gleeson made the move from Northamptonshire to Lancashire, continuing to build his career in the county circuit. In May 2022, during the T20 Blast, Gleeson claimed his maiden five-wicket haul in T20 cricket. In July 2022, Richard Gleeson’s dream was realized as he was called up to England’s Twenty20 International (T20I) squad for their highly anticipated home series against India. A moment that capped years of hard work, his inclusion was a testament to his relentless hard work. Gleeson has showcased his talents in numerous franchise leagues around the world. He plays for Chennai in the Indian Premier League and is a key player in England's own The Hundred Men's Competition, while also participating in diversity of other leagues across the globe.",
  "nationality": "England",
  "career_span": {
    "Test": "",
    "ODI": "",
    "IPL": "2024-2025"
  }
}