{
  "id": "pprofile_68237",
  "type": "player_bio",
  "player": "Simarjeet Singh",
  "full_name": "Simarjeet Singh",
  "dob": "January 17, 1998",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm fast medium",
  "teams": [
    "India",
    "Chennai Super Kings",
    "Mumbai Indians",
    "Delhi",
    "Sunrisers Hyderabad",
    "Central Delhi Kings",
    "East Delhi Riders"
  ],
  "bio": "Simarjeet Singh was born on January 17, 1998, in Delhi. The tall, skiddy pacer, who previously served as a net bowler with the Delhi Capitals. Simarjeet Singh participated in the Vijay Hazare Trophy in 2018, and subsequently made his first-class debut for Delhi during the 2018-2019 season. Simarjeet Singh made his T20 debut on November 11, 2019, and represented Delhi in the 2019-20 Syed Mushtaq Ali Trophy. Simarjeet Singh's Ranji debut occurred against Hyderabad in November 2018, which didn't unfold as ideally as anticipated. However, despite the modest start, he progressively improved and secured a regular spot in the Delhi domestic team. He has 65 wickets behind his name in the List A and First class cricket combined so far. Notably, he served as a net bowler for the Indian Premier League franchise Delhi, where his rapid pace caught the attention of onlookers. With the ability to clock speeds of 140 clicks, the right-arm quick also accompanied the Indian team as a net bowler during their tour of Sri Lanka in July 2021. In September 2021, Singh was included in the Mumbai squad for the remainder of the 2021 Indian Premier League season, stepping in for the injured Arjun Tendulkar. During the 2022 Indian Premier League Mega Auction, Simarjeet Singh was acquired by the Chennai team at the base price of 20 lakh, and he has been part of the franchise since then and till now as he yet again donned the yellow jersey in the 2024 IPL season. However, with the mega auction taking place ahead of the 2025 season, Simarjeet got a new home in the form of Hyderabad who picked him up.",
  "nationality": "India",
  "career_span": {
    "Test": "",
    "ODI": "",
    "IPL": "2022-2025"
  }
}