{
  "id": "pprofile_67589",
  "type": "player_bio",
  "player": "Devdutt Padikkal",
  "full_name": "Devdutt Babunu Padikkal",
  "dob": "July 7, 2000",
  "role": "Batsman",
  "batting_style": "Left Handed",
  "bowling_style": "Off break",
  "teams": [
    "India",
    "India A",
    "Rest of India",
    "South Zone",
    "Royal Challengers Bengaluru",
    "Rajasthan Royals",
    "India Under-19",
    "Karnataka",
    "Ballari Tuskers",
    "Hubli Tigers",
    "Lucknow Super Giants",
    "Gulbarga Mystics",
    "India D"
  ],
  "bio": "Spotted at a very young age and known for his flamboyant batting, Devdutt Padikkal's name quietly started to make rounds in Indian domestic cricket. The left-handed batter, who is also a handy off-spinner, was born in Edapal, Kerala. His exploits during a couple of seasons for the Ballari Tuskers in the Karnataka Premier League dropped the spotlight on him, and he also made a few handy contributions playing for Karnataka at the U-19 level. In the 2018-19 season of the Ranji Trophy, Paddikkal made his debut for Karnataka and struck a couple of half-centuries in his first few appearances to showcase his talent. Seeing his raw talent and potential, Bengaluru wasted no time in securing his services during the auction for the 2019 edition of the Indian Premier League. Representing Karnataka in the 2019–20 Vijay Hazare Trophy, Devdutt Padikkal finished with 609 runs and was the leading run-scorer. The 2020 edition of the Indian Premier League turned out to be the breakthrough season for him as he amassed 473 runs and finished as the leading run-scorer for Bengaluru. In the following season, Padikkal achieved another milestone by scoring his maiden IPL hundred. After being released by Bengaluru, he joined the Rajasthan team for the 2022 season. Amidst his T20 exploits, he earned recognition in the international arena, making his T20I debut for India against Sri Lanka in 2021. In November 2023, Padikkal's journey took a new turn as he was traded to Lucknow ahead of the 2024 season. The start of 2024 was a fruitful one for him as solid performances in the domestic circuit led to a call-up for the Test series against England, and eventually, he made his debut in the fifth and final Test in Dharamshala, where he scored his maiden half-century in the first innings. The 2024 IPL season was one to forget for Devdutt, as he managed only 38 runs in 7 innings for Lucknow before being released at the end of the season. Later that year, he earned a spot in India's squad for the Border-Gavaskar Trophy in Australia. Padikkal featured in the series opener in Perth, which turned out to be India's only Test win on that tour, but he was left out of the XI for the remainder of the series. During the 2025 IPL auction, which coincided with the Australia tour, Padikkal was bought by Bengaluru for INR 2 crore, marking his return to his former franchise. His fortunes took a turn for the better upon his return, as he joined Karnataka for the Vijay Hazare Trophy. He made an immediate impact, scoring a century against Baroda in the quarterfinal, followed by a crucial fifty in the semifinal, as Karnataka went on to clinch the title.",
  "nationality": "India",
  "career_span": {
    "Test": "2024-2024",
    "ODI": "",
    "IPL": "2020-2025"
  }
}