{
  "id": "pprofile_57823",
  "type": "player_bio",
  "player": "Lizaad Williams",
  "full_name": "Lizaad Buyron Williams",
  "dob": "October 1, 1993",
  "role": "Bowler",
  "batting_style": "Left Handed",
  "bowling_style": "Right-arm medium fast",
  "teams": [
    "South Africa",
    "Rocks",
    "Northamptonshire",
    "South Africa A",
    "South African Invitation XI",
    "Titans",
    "Western Province",
    "Delhi Capitals",
    "Mumbai Indians",
    "Cape Cobras",
    "South Africa Under-19",
    "DP World Lions",
    "Stellenbosch Kings",
    "Jozi Stars",
    "Nelson Mandela Bay Giants",
    "Joburg Super Kings"
  ],
  "bio": "Lizaad Buyron Williams is a South African cricketer who plays for Northerns. He made his international debut for South Africa in April 2021. Williams, who bowls right-arm fast was signed up with a rookie contract for the 2012–13 season after displays for Boland in List A cricket. In August 2017, he was named in Stellenbosch Monarchs' squad for the first season of the T20 Global League. However, in October 2017, Cricket South Africa initially postponed the tournament until November 2018, with it being cancelled soon after. In June 2018, Williams was named in the squad for the Cape Cobras team for the 2018–19 season. In September 2018, he was named in Boland's squad for the 2018 Africa T20 Cup. In October 2018, he was named in Nelson Mandela Bay Giants' squad for the first edition of the Mzansi Super League T20 tournament. In September 2019, he was named in the squad for the Jozi Stars team for the 2019 Mzansi Super League tournament. Later the same month, he was named in Boland's squad for the 2019–20 CSA Provincial T20 Cup. In March 2021, Williams was named in South Africa's limited overs squads for their series against Pakistan. He made his T20I debut for South Africa, against Pakistan, on 10 April 2021. Later the same month, he was named in Northerns' squad, ahead of the 2021–22 cricket season in South Africa. In May 2021, Williams was named in South Africa's Test squad for their series against the West Indies. In May 2021, Williams was named in South Africa's ODI squad for their series against Ireland. He made his ODI debut on 16 July 2021, for South Africa against Ireland, and took a wicket with his first delivery. In September 2021, Williams was named as one of three reserve players in South Africa's squad for the 2021 ICC Men's T20 World Cup. In March 2022, Williams was named in South Africa's Test squad for their series against Bangladesh. He made his Test debut on 31 March 2022, for South Africa against Bangladesh. He got his first test wicket against Bangladesh. He was also added in the squad for the ICC Cricket World Cup in 2023. He was later picked up by Delhi in the 2024 Indian Premier League auction after which Mumbai roped him ahead of the 2025 season.",
  "nationality": "South Africa",
  "career_span": {
    "Test": "2022-2022",
    "ODI": "2021-2024",
    "IPL": "2024-2024"
  }
}