{
  "id": "pprofile_113017",
  "type": "player_bio",
  "player": "Aniket Verma",
  "full_name": "Aniket Umashankar Verma",
  "dob": "February 5, 2002",
  "role": "All Rounder",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm medium fast",
  "teams": [
    "Madhya Pradesh",
    "Sunrisers Hyderabad",
    "Bhopal Leopards"
  ],
  "bio": "Aniket Umashankar Verma, born on February 5, 2002, in Jhansi, Uttar Pradesh, is a promising young cricketer who has been making waves in the Indian domestic circuit. A right-handed batsman and a right-arm medium-fast bowler, Verma has already established himself as a player to watch out for. At just 23 years old, he has showcased immense potential, representing Madhya Pradesh in domestic cricket and securing a place in the prestigious Sunrisers Hyderabad squad for the Indian Premier League (IPL). His journey from a small town in Uttar Pradesh to professional cricket is a testament to his dedication, talent, and hard work. Born in the historic city of Jhansi, Aniket Verma developed a passion for cricket at a young age. Like many aspiring cricketers in India, he honed his skills in local tournaments and age-group cricket. His dedication to the sport and consistent performances in junior cricket earned him a place in the Madhya Pradesh cricket team, marking the beginning of his professional journey. Aniket Verma made his domestic debut for Madhya Pradesh in the Syed Mushtaq Ali Trophy on December 3, 2024, against Hyderabad in Rajkot. His debut match, however, did not go as planned, as he failed to score any runs. While this initial setback could have deterred some, Verma remained undeterred and continued to work on his game. His true breakthrough came in the Madhya Pradesh T20 league, where he displayed his explosive batting ability. In just six innings, Verma amassed 273 runs at a staggering strike rate of 195, maintaining an impressive average of 54.6. The highlight of his performance was a record-breaking century, where he reached 100 runs in just 30 balls—one of the fastest centuries in the history of the tournament. This innings not only caught the attention of selectors but also proved his ability to dominate the shorter format of the game. Recognizing his exceptional talent, Sunrisers Hyderabad secured Aniket Verma for the IPL 2025 season. While he has yet to make his IPL debut, his inclusion in one of the most competitive T20 leagues in the world speaks volumes about his potential. The IPL has been a launching pad for many young cricketers, and Verma’s selection by Sunrisers Hyderabad indicates that he is being groomed for bigger challenges ahead. For a young player like Verma, rubbing shoulders with some of the best cricketers in the world in the IPL will provide invaluable experience. Learning from seasoned campaigners and facing high-pressure situations will undoubtedly aid in his overall development as a cricketer. Aniket Verma is known for his aggressive batting style, making him a valuable asset in the shorter formats of the game. His ability to play explosive innings and accelerate the scoring rate has set him apart as a power hitter. His natural stroke-making ability, combined with his fearless approach, makes him a formidable player in T20 cricket. While his primary strength lies in his batting, Verma also possesses the skills of a handy right-arm medium-fast bowler. Though his bowling statistics are limited, his ability to contribute with the ball adds another dimension to his game. As he continues to develop his all-round abilities, he has the potential to evolve into a match-winning player for his teams. One of the most remarkable performances of Verma’s career came in a recent match where he played a sensational innings, scoring 123 runs off just 41 balls. This innings, which included a staggering 13 sixes, demonstrated his ability to take on the opposition’s bowling attack and single-handedly turn the game in his team’s favor. Such performances have further solidified his reputation as a power hitter capable of producing match-winning knocks. With his burgeoning career, Aniket Verma is poised to make significant contributions to Indian cricket in the coming years. His exceptional performances in domestic cricket have set a strong foundation for greater achievements. The IPL will provide him with the perfect platform to showcase his talent on a larger stage, and if he continues to perform at the same level, he could soon be knocking on the doors of the Indian national team.",
  "nationality": "India",
  "career_span": {
    "IPL": "2025"
  }
}