{
  "id": "pprofile_5153",
  "type": "player_bio",
  "player": "Varun Aaron",
  "full_name": "Varun Raymond Aaron",
  "dob": "October 29, 1989",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm fast",
  "teams": [
    "India",
    "Durham",
    "East Zone",
    "India A",
    "India B",
    "India Green",
    "India Red",
    "Leicestershire",
    "Rest of India",
    "Royal Challengers Bengaluru",
    "Punjab Kings",
    "Delhi Capitals",
    "Rajasthan Royals",
    "Jharkhand",
    "Baroda",
    "Gujarat Titans",
    "India Champions",
    "Big Boys"
  ],
  "bio": "Varun Aaron is a right-arm fast bowler from Jharkhand. He has represented the state’s Under-19 team. In 2008, he was one of the two MRF Indian Under-19 prospects to be picked to play at the Australian Centre of Excellence. With impressive bowling figures in the List A and first-class levels, he has also proved to be a handy batsman. He showed glimpses of his pace when he bowled at a threatening speed of 153 km/h in the Vijay Hazare Tophy finals against Gujarat in March 2011. He was picked up subsequently by Delhi ahead of the Indian T20 league in April 2011, considering his ability to be a reliable pacer. Aaron then got an opportunity to play in the Emerging Players tournament held in Australia in the same year, where he impressed with his wicket-taking abilities. His efforts paid rich dividends as he received a surprise international call-up for India's ODI series against England later that year, replacing the injured Ishant Sharma but did not get a game. In the subsequent return series in India, Aaron was picked again and made his debut in the 4th ODI against England, picking up three quick wickets. Following that, he was included in the Test team to face West Indies at home but lost out on a place in the first two Tests to Vidarbha pacer Umesh Yadav. He got his chance in the third Test against Mumbai when he replaced Yadav. He picked up the wicket of centurion, Darren Bravo in the first innings. Aaron continues to be in contention for a spot in the national team. In the Indian T20 league, 2014, Bengaluru bought him to bolster their bowling attack. He was also a part of the Punjab franchise two seasons before Rajasthan bought him in the 2019 auction.",
  "nationality": "India",
  "career_span": {
    "Test": "2011-2015",
    "ODI": "2011-2014",
    "IPL": "2011-2022"
  }
}