{
  "id": "pprofile_4308",
  "type": "player_bio",
  "player": "Steve Smith",
  "full_name": "Steven Peter Devereux Smith",
  "dob": "June 2, 1989",
  "role": "Batsman",
  "batting_style": "Right Handed",
  "bowling_style": "Leg break googly",
  "teams": [
    "Australia",
    "Australia A",
    "Worcestershire",
    "Delhi Capitals",
    "Rajasthan Royals",
    "New South Wales",
    "Australia Under-19",
    "Sussex",
    "Australian XI",
    "Kochi Tuskers Kerala",
    "Pune Warriors India",
    "Sydney Sixers",
    "Antigua Hawksbills",
    "Comilla Victorians",
    "Rising Pune Supergiant",
    "Australians",
    "Toronto Nationals",
    "Welsh Fire",
    "Washington Freedom"
  ],
  "bio": "Few stories in modern cricket rival Steven Smith’s meteoric rise from a promising leg-spinner to one of the greatest batters of all time. His journey is a tale of perseverance, reinvention, and sheer determination. Smith made his domestic debut in the 2007–08 season as a leg-spinner who could contribute with the bat. However, despite showing glimpses of potential with the ball, his inconsistency kept him in and out of the Australian squad. After making his international debut in 2010, Smith was dropped following Australia's 2010–11 Ashes defeat and found himself struggling for a permanent place in the team. Recognizing his limitations as a bowler, Smith shifted his focus entirely to batting. His breakthrough came in 2013, when he was recalled as a specialist batter for Australia’s tour of India. His ability to handle spin impressed the selectors, earning him a place in the 2013 Ashes squad in England, where he registered his maiden Test century. Smith’s defining moment came during the 2014–15 Test series against India, where he amassed four centuries in as many Tests and stepped in as captain for the injured Michael Clarke. This stellar performance cemented his place as Australia’s premier Test batter, earning him the No. 1 Test ranking. In the 2015 Ashes, Smith silenced his critics with two centuries, including a double hundred at Lord’s, though Australia lost the series. Later that year, he was appointed permanent Test captain. His leadership and batting flourished, and in 2017, Smith produced one of his finest performances in India, scoring a fighting century on a turning track in Pune to lead Australia to an unexpected victory. Smith’s prowess wasn’t limited to red-ball cricket. In the 2015 ODI World Cup, he became the first player to record five consecutive 50-plus scores, playing a pivotal role in Australia’s triumph. His unique batting style, characterized by fidgety movements, quick footwork, and sharp reflexes made him one of the toughest batters to dismiss. Smith’s career took a dramatic turn in 2018 when he was banned for a year due to the ball-tampering scandal in South Africa. However, he used the time away to rebuild his game and returned stronger than ever in the 2019 Ashes in England. Amid hostile crowds, Smith announced his comeback with back-to-back centuries in the first Test, finishing the series with 774 runs at an average of 110.57, reaffirming his dominance. Following the COVID-19 pandemic, Smith’s form fluctuated, but he found his rhythm again in the 2020–21 Border-Gavaskar Trophy, scoring a defiant 131 at the SCG. In November 2021, he returned to a leadership role as vice-captain under Pat Cummins. Smith’s adaptability continued to shine. In 2023, he led Australia to a famous victory in Indore as stand-in captain and played a crucial role in Australia’s ICC World Test Championship triumph, scoring 121 runs in the final against India. With this, he became the first men’s cricketer, along with David Warner and Mitchell Starc to win the ICC Cricket World Cup, ICC Men’s T20 World Cup, and ICC World Test Championship. Smith’s form in white-ball cricket saw a dip, leading to his omission from Australia’s 2024 T20 World Cup squad. However, he continued his dominance in Test cricket. During the 2024–25 Border-Gavaskar Trophy, he overtook Steve Waugh for the second-most Test centuries by an Australian, registering his 33rd and 34th Test tons in Brisbane and Melbourne. In January 2025, he was named Test captain for the Warne-Muralitharan Trophy against Sri Lanka. In the first Test at Galle, Smith became the 14th player to reach 10,000 Test runs, marking the milestone with his 35th Test century. He followed it up in the second Test by surpassing Ricky Ponting’s record for most Test catches by an Australian and becoming Australia’s leading run-scorer in Asia. His 36th Test hundred, his fourth in five matches, further solidified his legacy. Steven Smith’s career is a testament to resilience and adaptation. From being labelled a part-time spinner to becoming one of the most prolific batters in cricket history, his journey has been nothing short of extraordinary. As he continues to break records and lead Australia, there is little doubt that by the time he retires, he will be regarded as one of the greatest batters the game has ever seen.",
  "nationality": "Australia",
  "career_span": {
    "Test": "2010-2025",
    "ODI": "2010-2025",
    "IPL": "2012-2021"
  }
}