{
  "id": "pprofile_63846",
  "type": "player_bio",
  "player": "Matthew Short",
  "full_name": "Matthew William Short",
  "dob": "November 8, 1995",
  "role": "All-Rounder",
  "batting_style": "Right Handed",
  "bowling_style": "Off break",
  "teams": [
    "Australia",
    "Australia A",
    "Punjab Kings",
    "Victoria",
    "Australia Under-19",
    "Adelaide Strikers",
    "Melbourne Renegades",
    "National Performance Squad",
    "Cricket Australia XI",
    "Islamabad United",
    "Northern Superchargers",
    "San Francisco Unicorns",
    "Washington Freedom"
  ],
  "bio": "Matthew William Short, a talented Australian international cricketer, has emerged as a key figure in both ODI and T20I formats for the national team. Known for his powerful right-handed batting at the top of the order and effective right-arm off-break bowling, Short represents Victoria at the state level, and has played for Adelaide Strikers in the Big Bash League, and San Francisco Unicorns in Major League Cricket. He has also represented teams like the Melbourne Renegades, Punjab and Washington Freedom in his career. Short’s cricketing journey began with his one-day debut on July 20, 2014, for the Australia National Performance Squad against South Africa A in the Quadrangular Series. He made his first-class debut on October 29, 2015, for Cricket Australia XI in a tour match against New Zealand. A milestone in his early career came in November 2017, when he scored his maiden first-class century against England in a tour match at Townsville. Short’s standout performance included an unbeaten 134 in the second innings, complemented by taking 4/103 with the ball. In 2019, Short showcased his talent overseas, playing club cricket for Coggeshall Town CC in England. His dominant batting performances yielded 1,100 runs at an average of 55. Upon his return to domestic cricket, Short’s career took a transformative turn during the 2021–22 BBL season. Moving up to open the batting, he amassed 493 runs with 26 sixes, making him one of the league’s standout players. Short’s rise continued in the 2022–23 BBL season when he captained the Strikers in Peter Siddle’s absence. On January 5, 2023, he delivered a historic performance, scoring his maiden BBL century, an unbeaten 100 off 59 balls, while leading the Strikers to the highest successful run chase in BBL history. His all-round contributions, including 4 overs with figures of 1/34, further cemented his status as a match-winner. At the Australian Cricket Awards later that month, Short was named the BBL12 Player of the Tournament. His IPL journey began in March 2023 when he joined Punjab as a replacement for Jonny Bairstow. That same year, Short made his international debut in a T20I against South Africa on August 30, 2023. In the second match of the series, he smashed his maiden international half-century, scoring 66 off 30 balls to guide Australia to victory. Short featured in all three matches as Australia completed a 3-0 sweep of South Africa. Short's ODI debut followed soon after on September 22, 2023, against India. A defining moment in his T20I career came on November 23, 2023, when he claimed his first international wicket by dismissing Yashasvi Jaiswal. In May 2024, he was named as a reserve player for Australia’s squad in the ICC Men's T20 World Cup and later earned selection for a white-ball tour against England in September 2024. During the second T20I of the tour, Short took a sensational five-wicket haul, finishing with record figures of 5/22. In the fifth ODI of the series, he notched his maiden ODI half-century off just 23 balls, showcasing his ability to deliver under pressure. Matthew Short’s journey from domestic stalwart to international cricket has been defined by his fearless batting, adaptability, and contributions as an all-rounder. With his ability to perform in high-pressure situations, Short continues to establish himself as a crucial player in Australia’s white-ball setup and a rising star on the global cricketing stage.",
  "nationality": "Australia",
  "career_span": {
    "Test": "",
    "ODI": "2023-2025",
    "IPL": "2023-2023"
  }
}