{
  "id": "pprofile_10085",
  "type": "player_bio",
  "player": "Glenn Maxwell",
  "full_name": "Glenn James Maxwell",
  "dob": "October 14, 1988",
  "role": "All-Rounder",
  "batting_style": "Right Handed",
  "bowling_style": "Off break",
  "teams": [
    "Australia",
    "Australia A",
    "Hampshire",
    "Lancashire",
    "Surrey",
    "Warwickshire",
    "Yorkshire",
    "Royal Challengers Bengaluru",
    "Punjab Kings",
    "Delhi Capitals",
    "Mumbai Indians",
    "Victoria",
    "Australian XI",
    "Melbourne Renegades",
    "Melbourne Stars",
    "Australians",
    "London Spirit",
    "Washington Freedom"
  ],
  "bio": "Nicknamed the 'Big Show' for his ability to hit big sixes without any fuss, Glenn Maxwell is one of the most attractive batter around the world, especially in the limited-overs format. His aggressive batting style at any position from an opener to the No.7 slot, handy off-spin bowling and delightful fielding put him into the mould of a perfect all-rounder. He is also great at judging slower balls and, most commonly uses his ‘swivel slog sweep’ to send the ball deep into the stands. The all-rounder shot to fame in 2011 when he scored a record 19-ball half century to lead Victoria to an unlikely victory against Tasmania. But it was his knock of 110 off 52 balls with nine fours and eight sixes for Australian Institute of Sports in the Emerging Player tournament that caught the eyes of Delhi selectors, who signed him as a replacement player for Travis Birt for the fifth Indian Premier League edition in 2012. In 2013, the Aussie was a surprise pick in the Indian Premier League player auction by Mumbai, who bought him at a whopping million US dollars, making him the league's newest million dollar baby. However, he warmed the bench for most parts of the season and played a few games at the end of the tournament. He made his ODI, T20I and Test debuts in the space of five months in 2012/13 but one can safely say that the 2014 Indian Premier League was the making of him, after which he became a household name across the world. The Big Show played a significant role in Australia’s World Cup win in 2015. He scored a 51-ball century against Sri Lanka, fastest-ever by an Australian and second fastest in the history of the tournament. However, after the success with Australia in that tournament he waned beyond explanation and soon lost his place in not only the ODI side but also the state side Victoria. With criticisms coming from all quarters accusing him of reckless play, Maxwell smashed an unbeaten 65-ball 145 in a T20I match against Sri Lanka in September 2016 to win back critics and eventually a place in the ODI team. He also returned to the Test team against India in 2017 and got a century in Ranchi to further demonstrate what a special talent he is. With that effort, he became one of the few players to score a century in each of the formats of international cricket. In 2019, he was sold to Delhi but then returned to play for Punjab again in the Indian Premier League 2020 after they bought him for a mindboggling Rs 10.75 cr. The performance of Maxwell often leaves a lot to be desired but such is his aura and potential that he remains the blue-eyed boy of franchise teams. He may not have set the stage on fire consistently but his demand has been always high in the auction market. In one such auction before the 14th season of the Indian Premier League, Maxwell was bought for a whopping amount of 14.25 cr INR by Bengaluru and was one of their key players for the next couple of years. Maxwell’s records speak volumes about his prowess. In the 2023 World Cup, he set the record for the fastest century in tournament history, reaching the landmark in just 40 balls against the Netherlands. In the same tournament, he produced an unforgettable 201-run knock against Afghanistan, further cementing his status as a player capable of extraordinary feats under pressure. Additionally, Maxwell is the only male Australian cricketer to score a double century in ODIs, achieving this milestone during the 2023 World Cup. He became the second player in men's T20I cricket, after Rohit Sharma, to score four centuries and set the record for the most T20I centuries by an Australian. He also tied the record for the fastest century by an Australian batsman in a T20I, reaching it in 47 balls. Additionally, he holds the record for the most centuries scored while chasing in T20I history, with three out of four centuries coming in pressure situations. In February 2024, against West Indies, he scored his 5th T20I century equaling Rohit Sharma for the record of most T20I centuries in a career. Maxwell had a fantastic BBL 2024/25 campaing smashing over 300 runs in 9 games. He was then named in Ausralian squad for the 2025 Champions Trophy. Maxwell's contributions go beyond his individual brilliance. His ability to adapt to various roles, be it as a finisher, an anchor, or a part-time bowler makes him a critical asset for any team he represents. As Australia’s cricket journey continues, Glenn Maxwell remains a cornerstone of their limited-overs strategy, a player capable of turning games on their head with his extraordinary skill and talent.",
  "nationality": "Australia",
  "career_span": {
    "Test": "2013-2017",
    "ODI": "2012-2025",
    "IPL": "2012-2025"
  }
}