{
  "id": "pprofile_67285",
  "type": "player_bio",
  "player": "Sherfane Rutherford",
  "full_name": "Sherfane Eviston Rutherford",
  "dob": "August 15, 1998",
  "role": "Batsman",
  "batting_style": "Left Handed",
  "bowling_style": "Right-arm fast medium",
  "teams": [
    "West Indies",
    "West Indies A",
    "Royal Challengers Bengaluru",
    "Kolkata Knight Riders",
    "Delhi Capitals",
    "Mumbai Indians",
    "Guyana Harpy Eagles",
    "Sydney Thunder",
    "Sylhet Strikers",
    "Sunrisers Hyderabad",
    "Barbados Royals",
    "Guyana Amazon Warriors",
    "St Kitts and Nevis Patriots",
    "Quetta Gladiators",
    "Karachi Kings",
    "Peshawar Zalmi",
    "Khulna Tigers",
    "Bangla Tigers",
    "Montreal Tigers",
    "Surrey Jaguars",
    "CWI B Team",
    "Northern Warriors",
    "Delhi Bulls",
    "Deccan Gladiators",
    "Colombo Strikers",
    "Galle Marvels",
    "New Jersey Somerset Cavaliers",
    "St Louis Americans",
    "Gujarat Titans",
    "Pretoria Capitals",
    "Desert Vipers",
    "Abu Dhabi Knight Riders",
    "Los Angeles Knight Riders",
    "San Francisco Unicorns",
    "Dallas All Stars"
  ],
  "bio": "Sherfane Rutherford is a menacing left-handed batter who made a mark in the 2018 Global T20 League in Canada. Playing for West Indies B in the tournament, he was the third highest run-getter, with 230 runs to his name. It included a mind-boggling 134* (66), which is by far the highest individual score in the League as well. He was absolutely bludgeoning with the bat and his performance there earned him a Caribbean T20 League contract with Guyana. He was bought by Delhi in the 2019 Indian Premier League auctions but traded to Mumbai in 2020 after an ordinary season. Given his hitting ability, it is only a matter of time before Sherfane reigns successful in the shorter format of the game. For now though, he will look to make an indelible impression in the Blue and Gold when he would don the same in the coming 2020 Indian Premier League. Sherfane made his T20 debut for Guyana in the 2018 domestic West Indies T20 league. Sherfane went on to play across the globe for different sides of various countries in the shorter format. Sherfane made his T20I debut against Bangladesh on 22nd December 2018. Sherfane is a talented left-handed dasher and he like other Caribbean players is an explosive batter by nature and does have a bright future ahead of him. After an impressive 2023 season domestically and internationally, he was picked up by Kolkata in the 2024 Indian T20 League auction. He was an obvious pick for the 2024 T20 World Cup, but despite not making much of an impact with the bat, his potential continued to ascend. In 2024, Rutherford scored his maiden One Day International century, making an impressive 113 for the West Indies in their five-wicket victory over Bangladesh. His innings included seven fours and eight sixes. Rutherford also showcased his quickfire batting skills during a solid BBL season with Sydney Thunder. In one memorable match, needing 15 runs off the final over to chase down 178, he took on veteran seamer Andrew Tye, smashing three boundaries to lead his side to victory. In addition to the IPL, Rutherford’s cricketing resume spans various franchise tournaments across the globe, filling the calendar year. He plays in the Lanka Premier League, is a key player in the PSL, and features for the Desert Vipers in the International League T20. Rutherford also represents the San Francisco Unicorns and is a vital part of the Sylhet Strikers in the Bangladesh Premier League. His global presence in franchise cricket highlights his versatility and widespread appeal. A true globetrotter in the world of T20 cricket, Rutherford continues to make his mark wherever he plays. Recognizing his potential as a reliable finisher capable of adding 20-30 crucial runs in the final overs of a T20, Gujarat Titans secured him for INR 2.6 crore for the 2025 IPL season.",
  "nationality": "West Indies",
  "career_span": {
    "Test": "",
    "ODI": "2023-2025",
    "IPL": "2019-2025"
  }
}