{
  "id": "pprofile_71447",
  "type": "player_bio",
  "player": "Akash Deep",
  "full_name": "Akash Deep",
  "dob": "December 15, 1996",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm fast medium",
  "teams": [
    "India",
    "East Zone",
    "India A",
    "Rest of India",
    "Royal Challengers Bengaluru",
    "Bengal",
    "Mohun Bagan AC",
    "Lucknow Super Giants",
    "Servotech Siliguri Strikers",
    "Team A"
  ],
  "bio": "Akash Deep, a gifted right-arm fast-medium bowler, possesses the ability to generate substantial seam movement and deliver impactful performances with both ball and bat. Originating from Bihar, he transitioned to Bengal due to the constraints imposed by the Bihar Cricket Association. His T20 debut for Bengal in the 2018-19 Syed Mushtaq Ali Trophy marked the beginning of a promising career trajectory. Since his debut, Akash has been a consistent performer for Bengal across all formats, earning a reputation as a vital asset for the team. Notably, his exceptional bowling prowess played a pivotal role in Bengal's journey to the Ranji Trophy final on two occasions. Akash's remarkable knack for taking wickets did not go unnoticed, catching the attention of Bengaluru's scouting team. While he initially missed out on playing opportunities during the Indian Premier League, he made a memorable debut in the 2022 season, clinching three wickets against Kolkata. In a remarkable turn of events at the start of 2024, Akash's journey took a significant leap forward despite a challenging domestic season for Bengal. Selected for India A's red-ball series against the England Lions, he seized the opportunity with both hands. Through impactful performances in the series, Akash showcased his potential as a formidable pace bowler. His stellar showing caught the attention of the Indian selectors, who fast-tracked him to the senior squad for India's marquee Test series against England at home. On 23rd February 2024, the day of his Test debut, Akash's journey came full circle as he received his maiden Test cap before the start of the fourth Test at Ranchi. Hailing from Baddi, a place approximately 200 kilometres away from Ranchi, where he made his Test debut, the occasion held profound significance for the budding cricketer. Making the most of his maiden outing in India colours, Akash delivered a dream start with the ball, claiming the wickets of England's top three batters in the first inning. His pivotal contribution played a crucial role in India's victory in that Test, subsequently sealing the series in their favour.",
  "nationality": "India",
  "career_span": {
    "Test": "2024-2025",
    "ODI": "",
    "IPL": "2022-2025"
  }
}