{
  "id": "pprofile_61505",
  "type": "player_bio",
  "player": "Sheldon Cottrell",
  "full_name": "Sheldon Shane Cottrell",
  "dob": "August 19, 1989",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Left-arm fast medium",
  "teams": [
    "West Indies",
    "Jamaica Scorpions",
    "Leeward Islands Hurricanes",
    "Sagicor High Performance Centre",
    "West Indies A",
    "Punjab Kings",
    "Trinidad & Tobago Red Force",
    "Sylhet Strikers",
    "West Indies Cricket Presidents XI",
    "Rangpur Riders",
    "Antigua Hawksbills",
    "St Kitts and Nevis Patriots",
    "West Indians",
    "World XI",
    "Multan Sultans",
    "Vancouver Knights",
    "Deccan Gladiators",
    "Team Abu Dhabi",
    "Dambulla Sixers",
    "Surrey Kings",
    "Surrey Risers",
    "Manipal Tigers",
    "Morrisville Samp Army",
    "Desert Vipers",
    "Bethesda Golden Eagles",
    "Dallas All Stars",
    "Cape Town Samp Army",
    "Premium Americans",
    "West Indies Champions"
  ],
  "bio": "A fast, muscular Jamaican soldier, Sheldon Cottrell made quite an impression when he picked up 17 wickets in a four-day domestic, regional competition in 2012/13. A pacer with a left-arm slingy action, his angle can cause problems from both the sides of the wicket. Cottrell was one of the most promising talents in the inaugural edition of the Caribbean Premier League. He was named in the West Indies A tour of India in 2013 but had to pull out due to injury. The selectors kept faith in him and hence he was included in the West Indies national squad, where he went on to make his debut in the first Test at Eden Gardens with Kemar Roach unfit. Sheldon Cottrell has a unique style of celebration after a wicket. He comes up with an upright salute which has caught the eye-balls of many cricket followers around the world. Cottrell's initial career was marred with inconsistent performances and it took him some time to nail his spot. A 4-fer against Bangladesh in the winter of 2018 in Sylhet proved to be the turning point. Not only did he become consistent after that but also started to spearhead the West Indian pace attack. Sheldon was one of the fewest positives for West Indies during the ICC Cricket World Cup 2019 where he picked up 12 wickets.",
  "nationality": "West Indies",
  "career_span": {
    "Test": "2013-2014",
    "ODI": "2015-2021",
    "IPL": "2020-2020"
  }
}