{
  "id": "pprofile_3355",
  "type": "player_bio",
  "player": "Shane Watson",
  "full_name": "Shane Robert Watson",
  "dob": "June 17, 1981",
  "role": "Batsman",
  "batting_style": "Right Handed",
  "bowling_style": "Right-arm fast medium",
  "teams": [
    "Australia",
    "Queensland",
    "Tasmania",
    "Australia A",
    "Canterbury",
    "Hampshire",
    "Royal Challengers Bengaluru",
    "Chennai Super Kings",
    "Rajasthan Royals",
    "New South Wales",
    "Australia Under-19",
    "Brisbane Heat",
    "Sydney Sixers",
    "Sydney Thunder",
    "Rangpur Riders",
    "Saint Lucia Kings",
    "Dhaka Capitals",
    "Islamabad United",
    "Quetta Gladiators",
    "Sindhis",
    "Amsterdam Knights",
    "Deccan Gladiators",
    "Australia Legends",
    "Gilchrist XI",
    "World Giants",
    "Bhilwara Kings",
    "Texas Chargers",
    "Australia Masters"
  ],
  "bio": "Shane Watson's well-built body, reminiscent of a wrestler or perhaps a boxer is just the tip of the iceberg when he meets one's eye on a cricket field. As intimidating as his presence or fitness may be, Watson was probably one of the most injury-prone cricketers but at the same time, he transpired into one of the leading all-rounders of his era. Born in Queensland, 'Watto' first started playing for Tasmania at the age of 20. Topping the bowling charts in the Pura Cup and good middle-order performances led to his selection for Australia's tour of South Africa in early 2002. Though he did not live up to the expectations then, Ponting and the selectors opined that he was on a learning curve and it would only be a matter of time before he came good. He continued to be a regular member of the ODI team before an injury caused him to miss the 2003 ICC Cricket World Cup. He made a comeback a year later and started playing as a bowling all-rounder. Watson made his Test debut against Pakistan in 2005, scoring 31 in the first innings and taking a wicket. A dislocated shoulder while fielding in a Test against West Indies resulted in him missing the remainder of the season. Later, in the 2006 ICC Champions Trophy, Watson was given the chance to open the batting with Adam Gilchrist. The move paid rich dividends as he performed quite well with both bat and ball in the tournament, bagging the MOTM award in the finals which Australia won. In 2007, another injury blighted his progress and questions were raised about his ability to handle the workload expected from an all-rounder. The 2008 edition of the Indian T20 League proved to be a turning point in his career. He was instrumental in Rajasthan's win in the inaugural season, being adjudged the Player of the Tournament. Since then, he regularly featured in Australia's Test, ODI and T20I squads and was a consistent performer. In 2013, when Clarke got injured, he became Australia's 44th captain in Tests but faced a humiliating defeat against India in Delhi. After the end of their disastrous Test tour to India in 2013, he gave up the vice-captaincy role. The following year, he was signed by the Sydney Sixers ahead of the first-ever Big Bash League and the Champions League T20. Watson kept on delivering his art. One of his most memorable ODI innings came against Bangladesh in 2011, when he thrashed the opposition bowlers, scoring an unbeaten 185, which included 15 fours and 15 sixes - a record at that time. The 2014 season of the Indian T20 League saw Shane Watson not only retained by his franchise, Rajasthan but also made the captain as Rahul Dravid retired after the 2013 season. It was the best replacement, as Watson was an established player himself and the one who enjoyed leadership. He had a consistent season, which resulted in yet another Player of the Tournament award, thereby becoming the first player to win this twice in the Indian T20 League. In 2015 BBL, he helped the Sydney Thunder win the league under his guidance and in the following year was signed by Bengaluru as Rajasthan faced a ban for two years. Shane Watson retired from the longest format of the game after Australia lost the 2015 Ashes and was ignored by the selectors in most of the ODIs on the same tour. He though continued to play in the T20 format and also led his country against India in January 2016 in the absence of Aaron Finch. There he scored an unbeaten 124 and received the Man of the Match award for it but in a losing cause. The same year in the World T20, he decided to hang up his boots from international cricket at the end of the campaign. His stint in the international arena was overshadowed by the brilliant Australian team of the early 2000s and his injuries. Yet, he came through and will be remembered as one of the finest all-rounders of the game, especially in the shorter formats. Post-retirement, in the 2017 Indian T20 league, Watson was appointed as the captain of Bengaluru for the first few matches during the absence of regular captain Virat Kohli. In 2018, when Rajasthan and Chennai returned to the League after serving their ban, Rajasthan did not retain Watson and he was bought by Chennai for that season. In the finals, after being unable to get off the mark in the first 10 balls, Watson showed great fightback and ended up with a hundred in that innings, which was his fourth ton in the Indian T20 League. His knock helped Chennai in winning the title for the third time and he was awarded the Man of the Match in that game. Watson has been a regular in various T20 Leagues across the globe like the Pakistan Super League, Big Bash League, Caribbean Premier League and a few more.",
  "nationality": "Australia",
  "career_span": {
    "Test": "2005-2015",
    "ODI": "2002-2015",
    "IPL": "2008-2020"
  }
}