{
  "id": "pprofile_4661",
  "type": "player_bio",
  "player": "Adil Rashid",
  "full_name": "Adil Usman Rashid",
  "dob": "February 17, 1988",
  "role": "Bowler",
  "batting_style": "Right Handed",
  "bowling_style": "Leg break",
  "teams": [
    "England",
    "ICC World XI",
    "South Australia",
    "England A",
    "England XI",
    "MCC",
    "Yorkshire",
    "Punjab Kings",
    "England Under-19",
    "Adelaide Strikers",
    "England Lions",
    "Sunrisers Hyderabad",
    "Dhaka Capitals",
    "Cape Town Knight Riders",
    "World XI",
    "Punjabi Legends",
    "Multan Sultans",
    "Delhi Bulls",
    "Team Abu Dhabi",
    "Northern Superchargers",
    "Team Buttler",
    "Pretoria Capitals",
    "Sharjah Warriorz",
    "UP Nawabs"
  ],
  "bio": "An Englishman with a Pakistani origin, Adil Rashid grabbed instant eyeballs when he first played for Yorkshire in 2006, picking six wickets on his debut. His leg-spin was a rare phenomenon, especially at the first-class level and that alone enhanced his reputation as a bowler. Primarily an all-rounder, Rashid contributed heavily with the bat as well when he was part of England’s Under-19 team and put up an impressive performance in a Test match against India. But, it was his unusual bowling that brought him to the limelight. A stress facture in the back forced him to remodel his action, which then became side-on. Since then, he was a regular headline in England’s domestic circuit. With a fair amount of first-class experience, he was then added to the national squad for Test series in India, followed by a tour to the West Indies. He caught the selectors’ eye with a prolific 2009 domestic season, which ultimately led to his T20I debut in the World Twenty20 in June. In the same year, he went on to make his ODI debut against Ireland. However, despite a promising start to his career and a useful combination of leg-spin and lower order batting, Rashid failed to cement a permanent place in the English side and was subsequently dropped from the Bangladesh touring squad in early 2010. He then earned a call-up to the ODI side as a replacement for Michael Yardy, who opted out of the 2011 ICC Cricket World Cup. In 2012, he was included in Yorkshire’s T20 squad ahead of the Champions League T20 in South Africa. Rashid's breakthrough came in 2015 when he returned to England’s white-ball setup under Eoin Morgan’s aggressive ODI revolution. That year, he also earned his Test debut against Pakistan in the UAE, where he took a five-wicket haul in the second innings of his first match. Despite flashes of brilliance, Rashid’s Test career remained inconsistent, and he played only sporadically in red-ball cricket. It was in limited-overs cricket that Rashid truly flourished. He became a key figure in England’s historic 2019 Cricket World Cup-winning squad, playing all 11 matches and taking crucial wickets, including dismissing Kane Williamson in the final. His wrist spin remained a potent weapon in England’s white-ball dominance, and he was once again instrumental in their 2022 T20 World Cup triumph, finishing as one of the tournament’s best spinners. In 2024, he became England’s highest wicket-taking spinner in both ODIs and T20Is and continues to be a vital asset in major tournaments. He was also part of the England squad for the T20 World Cup that year and the Champions Trophy in 2025.",
  "nationality": "England",
  "career_span": {
    "Test": "2015-2019",
    "ODI": "2009-2025",
    "IPL": "2021-2023"
  }
}