{
  "type": "team_profile",
  "team_name": "Chennai Super Kings",
  "team_id": "1108",
  "owner": "Chennai Super Kings Cricket Limited",
  "home_ground": {
    "name": "MA Chidambaram Stadium",
    "city": " Chennai"
  },
  "titles": [
    {
      "name": "Indian Premier League",
      "count": "5",
      "years": [
        " 2010",
        " 2011",
        " 2018",
        " 2021",
        " 2023"
      ]
    }
  ],
  "bio": "Owned by The India Cements Ltd., Chennai Super Kings (CSK) have been one of the most dominant forces in the Indian Premier League (IPL) since its inception in 2008. Drawing inspiration from the rich cultural heritage of Tamil Nadu, CSK embodies the spirit of the fearless rulers of the golden Tamil era. The franchise has stayed true to its cultural roots, bringing the same grit and passion to the cricket field that has defined the region for centuries. Under the stewardship of the iconic MS Dhoni, who took on the dual roles of captain and leader, Chennai Super Kings have remained a formidable contender in the IPL. From the very beginning, they showcased their dominance - finishing as finalists in the inaugural season, followed by semi-finals in the second, and securing their first championship in 2010. The pinnacle of their success came in 2011, when they made history by becoming the first team to successfully defend their title, a feat that set them apart as a powerhouse in the league. With a balanced blend of experienced Indian talent and international stars, CSK became a team to reckon with, not just in the IPL, but globally, winning the prestigious Champions League T20 in 2010 and cementing their place as a top-tier team. Despite a setback in 2011 when they failed to defend the CLT20 title, CSK remained consistent in the IPL. The franchise retained most of its core for the 2012 season, including the costly acquisition of Ravindra Jadeja, although they fell short of the title and finished as runners-up to Kolkata Knight Riders. 2013 saw them once again make it to the final, only to be bested by Mumbai Indians in a thrilling contest. After a two-year suspension due to off-field issues, CSK made a triumphant return to the IPL in 2018, where they reclaimed their title with a squad brimming with experience and leadership under Dhoni's guidance. Their chances of a back-to-back victory in 2019 were dashed by Mumbai in yet another IPL final, but the team had already proven that their legacy was far from over. The 2020 season, however, was a nightmare for Chennai, with an aging squad and an alarming series of losses that almost saw them finish at the bottom of the table. Critics began to write them off, citing the age of their core players as a potential downfall. But in true Chennai Super Kings fashion, they bounced back in 2021, finishing second on the points table with nine wins. They went on to clinch their fourth IPL title, defeating Kolkata Knight Riders in a memorable final that reminded everyone of their resilience and pedigree. Heading into the 2022 season, CSK underwent a shake-up with the mega auction, but they managed to retain their core players - Dhoni, Ravindra Jadeja, and Ruturaj Gaikwad. In a surprising turn, Dhoni stepped down as captain, passing the baton to Jadeja. However, the season ended in disappointment as the team finished ninth in the group stage, a rare misstep for the mighty Chennai side. The 2023 season was a redemption story for CSK, as they staged a remarkable comeback after enduring injuries to key players. Despite these setbacks, Chennai defied the odds, securing eight victories and a playoff spot. Their journey to the final was marked by a thrilling victory over Gujarat Titans in the Qualifier, setting up a high-stakes rematch in the final. After rain delays added intensity to the clash, it was Ravindra Jadeja who delivered a match-winning performance in the final, guiding CSK to their fifth IPL title in a heart-stopping finish. As the 2024 season loomed, CSK made strategic moves in the transfer market, bringing in New Zealand’s Rachin Ravindra and Daryl Mitchell, both of whom had impressed during the 2023 ICC Men's World Cup. Shardul Thakur also rejoined the franchise, adding further depth to the squad. With MS Dhoni’s tenure as captain nearing its end, the franchise entered a new era with Ruturaj Gaikwad taking the reins. However, the 2024 season proved to be challenging, as Chennai finished just outside the playoffs in fifth place with seven wins and seven losses. This marked a rare failure to reach the knockout stages, reminiscent of their struggles in 2020 and 2022. The 2025 IPL Mega Auction presented CSK with another opportunity to revamp their squad. They retained key players like Ruturaj Gaikwad, Ravindra Jadeja, Shivam Dube, and Matheesha Pathirana, and amidst speculation that Dhoni had played his final season in 2024, the legend himself surprised everyone by announcing he would return for one more season, much to the delight of fans and the franchise alike. CSK's auction moves made headlines, with the signing of Ravichandran Ashwin marking a significant homecoming for the veteran spinner, further strengthening the team’s spin department, especially on the spin-friendly pitches of Chepauk. Additionally, they made a bold move by securing Afghanistan’s Noor Ahmed for INR 10 crores - their most expensive buy of 2025. This acquisition added a new dimension to their bowling attack."
}