{
  "type": "team_profile",
  "team_name": "Punjab Kings",
  "team_id": "1107",
  "owner": "K.P.H. Dream Cricket Private Limited",
  "home_ground": {
    "name": "Maharaja Yadavindra Singh International Cricket Stadium",
    "city": " Mullanpur"
  },
  "titles": [],
  "bio": "Jointly owned by Bollywood actress Preity Zinta, Karan Paul of the Apeejay Surendra Group, and Mohit Burman, the Punjab Kings (formerly Kings XI Punjab) made an impressive debut in the Indian Premier League. In their inaugural season, they finished second on the points table, thanks in large part to Shaun Marsh, who was a one-man army for the team. However, despite the promising start, the franchise struggled to maintain that momentum in the following two seasons, failing to live up to expectations. In 2011, with seasoned Australian cricketer Adam Gilchrist taking the reins as captain, Punjab showed signs of resurgence. Gilchrist's leadership brought renewed hope, and the team battled hard throughout the season, but they still fell short of qualifying for the playoffs. The 2012 auction saw the franchise make several key changes to their squad, acquiring players like former Pakistani cricketer Azhar Mahmood (who had English citizenship), Ramesh Powar, and James Faulkner. Dinesh Karthik was traded to Mumbai Indians in exchange for Rajagopal Sathish. Despite a quiet start, Punjab bounced back in the second half of the season, but once again, they faltered when it mattered most, finishing in 6th place. The real turning point for Punjab came in 2014. The franchise made a significant impact, thanks to the explosive Australian all-rounder Glenn Maxwell, who had been acquired in the auction. Maxwell's dazzling form, amassing 552 runs, propelled Punjab to the top of the table. They ultimately finished as runners-up, losing a thrilling final to Kolkata Knight Riders, but the season marked their best performance to date. However, consistency remained elusive for Punjab in subsequent seasons. In the 2018 auction, they made several high-profile acquisitions, including Chris Gayle, KL Rahul, and Aaron Finch. Under Ravichandran Ashwin's captaincy, they started the tournament on a strong note but couldn't maintain the momentum, once again finishing in 6th place. The following season saw a similar result, with Punjab finishing in the same position, but KL Rahul’s impressive individual performance, scoring nearly 600 runs, earned him the captaincy in 2020. KL Rahul flourished as a batter, amassing 670 runs in 2020, but the team’s fortunes did not improve. In fact, Punjab finished 6th for three consecutive seasons starting from 2019. Heading into the 2022 mega auction, the franchise made the bold decision to release KL Rahul and retain only Mayank Agarwal and Arshdeep Singh. They made significant acquisitions, including Kagiso Rabada, Shikhar Dhawan, Jonny Bairstow, Shahrukh Khan, and Liam Livingstone. Despite these signings, Punjab once again found themselves finishing 6th on the points table, continuing their streak of falling short of a playoff berth. With KL Rahul’s departure, Shikhar Dhawan took over the captaincy in 2023, but the results remained largely unchanged, and Punjab finished in 6th place yet again. In an attempt to shake things up, Punjab broke the bank for young English all-rounder Sam Curran, acquiring him for a then-record INR 18.5 crore, making him the most expensive player in IPL history at the time. They also added promising Indian talents and Zimbabwe’s Sikandar Raza to the squad. However, inconsistency plagued their campaign, and they finished 8th, missing the playoffs once more. For the 2024 season, Punjab retained most of their core players but made several key acquisitions, including Harshal Patel for INR 11.75 crore, Rilee Rossouw for INR 8 crore, and Chris Woakes for INR 4.2 crore. Unfortunately, their fortunes didn’t change, and they once again fell short of making the playoffs. Heading into the 2025 IPL mega auction, Punjab opted for a complete squad overhaul, retaining just two players - Prabhsimran Singh and Shashank Singh. They made a bold move, spending INR 110.15 crore to rebuild their squad. The centerpiece of their new-look team was Shreyas Iyer, who was acquired for INR 26.75 crore and named captain. Iyer had led Kolkata Knight Riders to the IPL title in 2024, and Punjab hopes that his leadership and winning pedigree will turn their fortunes around. In addition to Iyer, Punjab secured key acquisitions such as Arshdeep Singh (RTM) and Yuzvendra Chahal, both snapped up for INR 18 crore each, signaling the franchise’s intent to build a balanced and competitive team for the 2025 season."
}