{
  "type": "team_profile",
  "team_name": "Lucknow Super Giants",
  "team_id": "2954",
  "owner": "RPSG Sports Private Limited",
  "home_ground": {
    "name": "Bharat Ratna Shri Atal Bihari Vajpayee Ekana Cricket Stadium",
    "city": " Lucknow"
  },
  "titles": [],
  "bio": "Lucknow Super Giants (LSG), one of the newest additions to the Indian Premier League, made a grand debut in the 2022 season. Founded in 2021, the team is based at the BRSABV Ekana Cricket Stadium in Lucknow. Owned by the RPSG Group, which previously ran the Pune franchise between 2016 and 2017, LSG quickly made its mark in the IPL with a strong roster and solid performances. In their inaugural season, LSG appointed KL Rahul as captain and former Zimbabwean cricketer Andy Flower as head coach. The franchise made strategic acquisitions to build a competitive squad, adding seasoned players like Quinton de Kock, Marcus Stoinis, Jason Holder, Manish Pandey, and Deepak Hooda. They also recruited emerging talents such as Ravi Bishnoi and Avesh Khan, enhancing their bowling attack. The presence of former Indian cricketer Gautam Gambhir as mentor further strengthened the team’s leadership, bringing in valuable experience and guidance. LSG impressed in their first two seasons, consistently finishing third in the league stages. However, they were eliminated in the Eliminator matches in both 2022 and 2023, first by Royal Challengers Bangalore and then by Mumbai Indians, which prevented them from reaching the playoffs. At the start of the 2024 season, LSG saw a significant change in their leadership structure. Gautam Gambhir, their mentor, departed to rejoin Kolkata Knight Riders, a team he had previously led to two IPL titles. The 2024 season, however, proved to be a challenging one for LSG. Despite strong individual performances, they finished seventh in the league stage with a 50% win-loss record of seven wins and seven losses. This marked their first failure to reach the playoffs since their inception, and the franchise was left reflecting on what went wrong after two promising seasons. In preparation for the 2025 season, LSG underwent a complete overhaul, starting with a change in captaincy. Rishabh Pant, who had been a standout performer for Delhi Capitals, was picked and appointed as the new captain. He became the highest-paid player in the IPL, commanding a whopping INR 27 crore. The coaching staff was also revamped, with South African cricket legend Lance Klusener joining as an assistant coach to complement the leadership of head coach Justin Langer."
}