{
  "team_name": "Delhi Capitals",
  "team_id": "1109",
  "owner": "JSW GMR Cricket Pvt Ltd",
  "home_ground": {
    "name": "Arun Jaitley Stadium",
    "city": " Delhi"
  },
  "titles": [],
  "bio": "As the capital city of India, Delhi was expected to be one of the most successful teams in the Indian Premier League, but it has yet to live up to that expectation. The pressure is mounting for the team to rise to the occasion and deliver. Delhi was one of the eight original teams in the IPL, owned jointly by the GMR and JSW groups. Delhi's IPL journey began on a promising note in the inaugural season. Under the leadership of the explosive Virender Sehwag, the team made it to the knockout stages, playing with the same fearless spirit Sehwag was known for. With a star-studded lineup featuring AB de Villiers, Gautam Gambhir, Tillakaratne Dilshan, and Glenn McGrath, they seemed destined to claim the title. However, a dramatic collapse in the semi-finals against Rajasthan Royals ended their campaign prematurely. In the 2009 season, Delhi, captained by Gautam Gambhir, topped the table, showcasing their dominance. Yet again, they faltered in the semi-finals, falling short of reaching the final. Despite strong performances in the early years, Delhi's fortunes took a downward spiral in subsequent seasons. In 2010 and 2011, they were eliminated in the group stages, with the latter season seeing them finish at the bottom of the points table. To bolster their squad, Delhi made high-profile acquisitions, bringing in players like Kevin Pietersen, Mahela Jayawardene, and Ross Taylor. They managed to bounce back in 2012, topping the group stages once again. However, they failed in the final hurdle, losing both of their qualifying matches against Kolkata Knight Riders and Chennai Super Kings, ending their hopes of reaching the final once more. From 2013 to 2018, Delhi’s performance was nothing short of disastrous. They finished at the bottom of the points table in 2013, 2014, and 2018, with only brief flashes of promise in 2015 and 2016 when they ended up 6th. During this period, the team became a shadow of the formidable side they once were, and the fans grew increasingly disillusioned. However, in 2019, Delhi decided to shake things up, making significant changes to their squad. They traded Shikhar Dhawan back from Hyderabad and retained key Indian players like captain Shreyas Iyer, wicketkeeper-batsman Rishabh Pant, and rising star Prithvi Shaw. Their international roster was bolstered by the inclusion of top-tier players such as Kagiso Rabada, Trent Boult, Colin Munro, and Nepal’s Sandeep Lamichhane. Delhi also brought in Sourav Ganguly as an advisor, completing a major squad overhaul. This fresh approach yielded immediate results, as Delhi finished in the top 4 for the first time in years. They won their Eliminator against Sunrisers Hyderabad but once again fell short, losing to Chennai Super Kings in Qualifier 2. The 2020 season proved to be another landmark year for Delhi. With smart buys like Jason Roy, Chris Woakes, Shimron Hetmyer, and Marcus Stoinis, they performed exceptionally well, securing their place in the final for the first time in 12 years. However, they were defeated by Mumbai Indians in the ultimate battle. Despite the setback, Delhi continued to show promise in the following season, topping the league stage. Yet, once again, they stumbled in the playoffs, falling short of their maiden title. Post-COVID, Delhi's fortunes took a slight dip in the 2022 IPL, as they narrowly missed out on a playoff spot, finishing 5th on the points table. The next two seasons saw the team lose its way, as they struggled to find any consistency. With the mega auction looming ahead of the 2025 IPL, Delhi found themselves with one of the largest purses remaining, and a major overhaul was in order. In a bold move, Delhi parted ways with both coach Ricky Ponting and captain Rishabh Pant, opting for fresh leadership and new faces. Their marquee acquisition was Indian stalwart KL Rahul, though after he declined the captaincy, they handed the reins to seasoned campaigner Axar Patel, who has been a vital part of Delhi's setup for several seasons. Axar's leadership comes off the back of an outstanding individual performance in India's 2025 Champions Trophy win. Delhi’s coaching staff was revamped as well, with former Indian cricketer Hemang Badani taking over as head coach and former captain Kevin Pietersen joining as a mentor. The squad saw the inclusion of seasoned pros like Faf du Plessis and Mitchell Starc. Faf will serve as Axar’s deputy, while Starc, who played a key role in Kolkata Knight Riders' IPL 2024 triumph, brings invaluable experience to the team. Delhi also retained key players like Kuldeep Yadav and rising stars such as Tristan Stubbs and Jake Fraser-McGurk. Unfortunately, their faith in Harry Brook was again tested, as for the second consecutive year, he pulled out of the IPL and is now facing a two-year ban."
}