{
  "team_name": "Mumbai Indians",
  "team_id": "1111",
  "owner": "Indiawin Sports Pvt. Ltd",
  "home_ground": {
    "name": "Wankhede Stadium",
    "city": " Mumbai"
  },
  "titles": [
    {
      "name": "Indian Premier League",
      "count": "5",
      "years": [
        " 2013",
        " 2015",
        " 2017",
        " 2019",
        " 2020"
      ]
    }
  ],
  "bio": "Mumbai, the city of dreams, is a melting pot of cultures, and the Mumbai Indians embody this diversity through their dynamic roster. Owned by Mukesh Ambani's Reliance Industries Limited, they are one of the most expensive teams in the IPL. At the heart of their legacy is Sachin Tendulkar, undoubtedly the most iconic figure to don the Mumbai Indians jersey. In their early years, the team boasted formidable hitters like Aiden Blizzard, Ambati Rayudu, and Rohit Sharma, along with exciting all-rounders such as Kieron Pollard, James Franklin, and the legendary Lasith Malinga, widely regarded as the world’s best T20 bowler. Mumbai's best performance came in the third season of the IPL, where they finished as runners-up, losing to the eventual champions, Chennai Super Kings. That year, they also participated in the Champions League T20 but were unable to make a deep run. In 2011, they qualified for the CLT20 once again after finishing third in the IPL, and due the absence of senior players like Tendulkar, they went into the competition as underdogs. Led by Harbhajan Singh, Mumbai defied expectations and triumphed, defeating Royal Challengers Bangalore in the final to win the 2011 Champions League T20. The 2012 IPL auction brought valuable foreign talent to Mumbai, including Herschelle Gibbs, Mitchell Johnson, Richard Levi, and Thisara Perera. Though Andrew Symonds retired from cricket and Johnson was ruled out before even playing a match, the remaining players contributed to a campaign that ended disappointingly in the Eliminator, where they were knocked out by Chennai Super Kings. However, Mumbai's fortunes changed in 2013 when they finally claimed their first IPL title, defeating Chennai in the final. Under the leadership of Rohit Sharma, the team became a dominant force, winning two more titles in the next four years. Despite a disappointing 2018 season, where they failed to qualify for the playoffs, Mumbai rebounded in 2019 to secure their fourth title, a feat unmatched by any other team. Breaking their pattern of winning only in odd years, Mumbai secured their fifth IPL title in 2020, defeating Delhi in the final. But the following season, 2021, proved to be inconsistent, as they finished fifth and missed the playoffs. Ahead of the 2022 season, the IPL introduced two new teams, and Mumbai made key decisions in the mega auction. They retained four core players - Rohit Sharma, Jasprit Bumrah, Kieron Pollard, and Suryakumar Yadav - while parting ways with Hardik Pandya. They re-signed Ishan Kishan for a hefty sum of ?15.25 crore. Unfortunately, the season began disastrously, with Mumbai losing their first eight matches, marking the worst start in the tournament’s history. They ended the season at the bottom of the points table with just four wins from 14 matches, making it their worst-ever IPL finish. The 2023 season was a rollercoaster for Mumbai. With Jasprit Bumrah sidelined due to injury, English pacer Jofra Archer stepped up to lead the attack, supported by a mix of domestic players and 2023 auction recruits. Despite a slow start, Mumbai regained form with strong performances from emerging stars like Akash Madhwal and Tilak Varma. They managed to secure a playoff spot, finishing fourth with eight wins and six losses. After eliminating Lucknow in the Eliminator, Mumbai’s journey ended in Qualifier 2, where they were defeated by Gujarat. The 2024 season, however, marked a turning point. In a controversial move, Mumbai traded Hardik Pandya to Gujarat, and Cameron Green was sent to Bengaluru to make room for Pandya’s return as captain, replacing Rohit Sharma. This decision sparked widespread fan displeasure. Unfortunately, the 2024 season proved disastrous, as Mumbai struggled with consistency and rhythm, managing only four wins in 14 matches, resulting in their worst-ever finish at the bottom of the points table. Looking ahead to the 2025 season, Mumbai Indians have made significant moves in the auction to rebuild and strengthen their squad. They retained key players like Rohit Sharma, Jasprit Bumrah, Suryakumar Yadav, and Tilak Varma, while acquiring impactful players such as Trent Boult, Mitchell Santner, Deepak Chahar, Will Jacks, and Corbin Bosch. A major boost came with the return of Mahela Jayawardene as head coach. Jayawardene, who had guided the team to three IPL titles during his previous tenure from 2017 to 2022, is expected to bring stability and direction, offering a fresh sense of purpose as Mumbai aim to extend their legacy."
}