{
  "type": "team_profile",
  "team_name": "Sunrisers Hyderabad",
  "team_id": "1379",
  "owner": "Sun TV Network Limited",
  "home_ground": {
    "name": "Rajiv Gandhi International Stadium",
    "city": " Hyderabad"
  },
  "titles": [
    {
      "name": "Indian Premier League",
      "count": "1",
      "years": [
        " 2016"
      ]
    }
  ],
  "bio": "Sunrisers Hyderabad, the rebranded franchise from Hyderabad, emerged after the termination of the Deccan Chargers in 2012. Owned by Kalanithi Maran of the Sun TV Network, the new team retained much of the Chargers' original line-up, albeit with a revamped coaching staff. Tom Moody was appointed head coach, with VVS Laxman taking on the role of mentor. Sunrisers made their IPL debut in 2013, reaching the playoffs in their inaugural season and finishing in fourth place under the captaincy of Kumar Sangakkara and Cameron White. For the 2015 season, SRH made several changes, including releasing some players and appointing David Warner as captain. Although the team did not perform to expectations that year, 2016 proved to be a turning point as they clinched their maiden IPL title. The following season, they struggled to defend their crown, succumbing to Kolkata in a rain-affected Eliminator. Despite this, Bhuvneshwar Kumar secured the Purple Cap, while David Warner took home the Orange Cap. In 2018, David Warner stepped down as captain after his involvement in the infamous ball-tampering scandal that rocked Australian cricket. Kane Williamson, the Kiwi star, was appointed as his replacement. Williamson led SRH to the final that season, delivering remarkable captaincy and winning the Orange Cap, though they fell short of the title. In the years that followed, Sunrisers continued to perform consistently, reaching the playoffs in 2019 and 2020 but failing to capture the trophy. The 2021 season, however, marked a turning point for the franchise. After losing six of their first seven matches, David Warner was sacked as captain, and Williamson was reappointed. Despite a late rally, the team ended up finishing at the bottom of the table, securing the unwanted \"wooden spoon.\" For the 2022 season, SRH made several key acquisitions in the mega auction, including Bhuvneshwar Kumar, T. Natarajan, Marco Jansen, Aiden Markram, Rahul Tripathi, and Nicholas Pooran. Despite early success, the team faltered in the latter half, losing five consecutive matches and missing out on the playoffs, finishing 8th on the points table. In 2023, SRH appointed Brian Lara as head coach, letting go of marquee players like Kane Williamson and Nicholas Pooran. Aiden Markram was named captain, but the team struggled, and despite individual brilliance from Heinrich Klaasen and Bhuvneshwar Kumar, they finished with just four wins from 14 games, missing the playoffs again. Following the disappointing 2023 season, SRH made another coaching change, bringing in Daniel Vettori as head coach. They also released several players, including Harry Brook, Adil Rashid, and Kartik Tyagi, ahead of the 2024 auction. During the auction, SRH made notable acquisitions, including Pat Cummins, Travis Head, Wanindu Hasaranga, and Jaydev Unadkat. With Cummins appointed as the new captain, replacing Markram, SRH showed a renewed vigor in the 2024 season, posting 200-plus totals in multiple matches. However, they fell just short in the final against Kolkata, unable to claim their second IPL title. As the 2025 season approaches, Sunrisers Hyderabad opted to retain the core group that performed well in 2024. Key players like Pat Cummins, Travis Head, Abhishek Sharma, Heinrich Klaasen, and Nitish Kumar Reddy were kept, allowing the franchise to bring in more experienced talent during the auction. They secured Indian pacer Mohammad Shami, who returned from injury and played a crucial role in India’s 2025 Champions Trophy win. However, they made the difficult decision to part ways with former captain Aiden Markram and veteran pacer Bhuvneshwar Kumar. SRH focused on strengthening their pace attack, acquiring Harshal Patel and Jaydev Unadkat, both skilled exponents of the slower ball, and Australian leg-spinner Adam Zampa to lead their spin department. Unfortunately, English pace-bowling all-rounder Brydon Carse was ruled out of the 2025 IPL due to injury, and Wiaan Mulder was confirmed as his replacement. They also signed wicketkeeper-batsman Ishan Kishan, providing them with flexibility in their opening pair, and Sri Lankan talent Kamindu Mendis, who will be eager to make his mark on the biggest stage."
}