{
  "type": "team_profile",
  "team_name": "Royal Challengers Bengaluru",
  "team_id": "1105",
  "owner": "Royal Challengers Sports Private Ltd",
  "home_ground": {
    "name": "M.Chinnaswamy Stadium",
    "city": " Bengaluru"
  },
  "titles": [
    {
      "name": "Indian Premier League",
      "count": "1",
      "years": [
        " 2025"
      ]
    }
  ],
  "bio": "Bengaluru, a franchise with a storied legacy in the Indian Premier League, was founded in 2008 by United Spirits and named after the company’s liquor brand, Royal Challenge. Since its inception, the team has played its home matches at the iconic M. Chinnaswamy Stadium. While they have never won the IPL, Bengaluru has come close on several occasions, finishing as runners-up three times between 2009 and 2016. Despite having numerous marquee players over the years, their inability to secure the title has earned them the label of 'underachievers.' Bengaluru’s journey has been as unpredictable as it has been eventful. The franchise held the record for both the highest and lowest totals in IPL history - 263/5 and 49, respectively - until 2021, a testament to their mercurial nature. In the inaugural season, legendary Indian cricketer Rahul Dravid captained the side, but the team finished second from the bottom. The 2009 edition, held in South Africa, saw Anil Kumble take over as captain, leading the team to the final, only to falter at the final hurdle. Bengaluru returned to the playoffs in 2010 under Kumble’s leadership but were knocked out by Mumbai in the semi-finals. In 2011, Virat Kohli, the rising star of Indian cricket, was appointed captain, ushering in the Kohli-Gayle-De Villiers era. Bengaluru's fortunes remained high under Kohli’s captaincy, with the team reaching the finals in 2011, only to lose to Chennai Super Kings in a closely contested match. Bengaluru’s strong performances continued, and they also earned a direct qualification for the Champions League T20, becoming the only team to feature in all three editions of the tournament. However, the next few years were frustrating for the franchise as they finished 5th in both 2012 and 2013, narrowly missing the playoffs. 2014 was particularly disappointing, as Bengaluru finished in the bottom two for the first time since the inaugural season, ending in 7th place. The 2016 season, however, remains a defining moment in Bengaluru’s IPL history. Led by Virat Kohli, who shattered records by scoring the most runs in a single season, the team reached the final. With the explosive trio of Kohli, Chris Gayle, and AB de Villiers firing on all cylinders, Bengaluru looked set to claim the title. But once again, they were undone in the final, this time by Sunrisers Hyderabad. The 2017 season proved to be Bengaluru’s worst campaign, as they finished rock bottom of the points table. In 2018, the franchise underwent a major overhaul, with Gayle leaving and several other changes being made. However, their fortunes did not improve significantly, as they finished 6th that season. The following year saw Bengaluru once again struggle, finishing at the bottom of the points table for the second time in three seasons. The tides began to turn in 2020, as Bengaluru rediscovered their mojo. Their revamped bowling attack, which had traditionally been their Achilles’ heel, began to show promise, and the team qualified for the playoffs in both 2020 and 2021, though they fell short of reaching the final. A major shock came at the end of the 2021 season, when Virat Kohli announced that he would step down as captain after the season, bringing an end to his tenure at the helm. Ahead of the 2022 mega auction, Bengaluru retained Kohli, Glenn Maxwell, and Mohammed Siraj, and made several key acquisitions, including Faf du Plessis, Dinesh Karthik, Josh Hazlewood, and Sherfane Rutherford. Under du Plessis' leadership, Bengaluru secured their third consecutive playoff appearance, but their journey was halted in the Eliminator by Rajasthan Royals. The 2023 season saw Bengaluru struggle with inconsistency before gathering momentum in the latter stages. With two consecutive victories leading into the final league match, they were in control of their playoff destiny. However, a loss to Gujarat Titans in their final match dashed their hopes of clinching a maiden IPL title, marking another near-miss for the franchise. For the 2024 season, Bengaluru retained their core overseas players - Faf du Plessis, Glenn Maxwell, Reece Topley, and Will Jacks - and made some key acquisitions, including Australian all-rounder Cameron Green in an all-cash trade. They also strengthened their bowling unit with the signings of Alzarri Joseph, Tom Curran, and Lockie Ferguson. In a bold move, the franchise rebranded, changing its name from Bangalore to Bengaluru ahead of the season, hoping to usher in a new era of success. As the 2025 IPL season approaches, Bengaluru made significant changes during the mega auction. The most surprising move was the decision to part ways with skipper Faf du Plessis, opting instead to hand the captaincy to Rajat Patidar, a consistent performer for the franchise in recent years. Virat Kohli, Bengaluru’s biggest legend, remains part of the squad but will not take on the leadership role. The team also made several impactful additions, including veteran Indian pacer Bhuvneshwar Kumar, who replaces Mohammed Siraj, and a powerful hard-hitting core featuring Phil Salt, Liam Livingstone, Tim David, and rising star Jacob Bethel. Though Bengaluru's bowling unit still leaves room for improvement, they stacked their roster with explosive batsmen and all-rounders, hoping to replicate the successful blueprint of franchises like Hyderabad in 2024, who focused on heavy run-scoring. With a dynamic squad in place, Bengaluru will be determined to break their decades-long thrust to taste the ultimate glory."
}