{
  "type": "team_profile",
  "team_name": "Gujarat Titans",
  "team_id": "2955",
  "owner": "Irelia Sports India Private Limited",
  "home_ground": {
    "name": "Narendra Modi Stadium",
    "city": " Ahmedabad"
  },
  "titles": [
    {
      "name": "Indian Premier League",
      "count": "1",
      "years": [
        " 2022"
      ]
    }
  ],
  "bio": "Gujarat Titans, based in Ahmedabad, entered the Indian Premier League in 2022 as a new franchise, making their debut after being founded in 2021. Their home matches are held at the iconic Narendra Modi Stadium in Motera, the world’s largest cricket stadium. The franchise is owned by CVC Capital Partners, a renowned British private equity and investment advisory firm. The IPL Governing Council invited bids for two new teams in August 2021, with 22 companies expressing interest. However, the steep base price limited the competition to only six serious bidders. After a competitive process, CVC Capital Partners won the rights to operate the Ahmedabad franchise with an impressive bid of INR 5,625 crores. Ahead of the 2022 mega auction, Gujarat Titans made bold moves to build a competitive squad, appointing Hardik Pandya as their captain. Alongside Pandya, they secured the talents of Shubman Gill and Rashid Khan, both of whom were pivotal to the team’s success. The auction saw them adding seasoned players like Jason Roy, David Miller, and Mohammed Shami - each of whom brought invaluable experience to the team. Gujarat also focused on up-and-coming stars, acquiring promising West Indies players Dominic Drakes and Alzarri Joseph, as well as the talented Rahul Tewatia, who had showcased his brilliance in the last two IPL editions. The coaching staff was equally impressive, with former Indian pacer Ashish Nehra appointed as the head coach. Renowned South African batsman Gary Kirsten, who had famously guided India to World Cup glory in 2011, took on the role of batting coach and mentor. Under their guidance, Gujarat Titans achieved remarkable success right from the outset, clinching the IPL trophy in their very first season in 2022. They followed up with a solid performance in 2023, finishing as runners-up. However, ahead of the 2024 season, the franchise saw a significant change in leadership. Hardik Pandya, the captain who had led them to their maiden IPL title, was traded to Mumbai Indians, and Shubman Gill was appointed as the new captain of Gujarat. Seeking to restore the consistency of their early years, Gujarat retained key players such as Shubman Gill, Rashid Khan, Sai Sudharsan, and Rahul Tewatia, who formed the core of the team. The retention of power-hitter Shahrukh Khan, however, raised some eyebrows. Despite his strong strike rate, Khan had struggled with consistency, and many questioned whether his form could be relied upon in the long run. In the auction to pick players for the 2025 season, Gujarat Titans made several key acquisitions to further bolster their squad. They invested heavily in marquee players such as Jos Buttler and Kagiso Rabada, bringing in additional quality and experience to their ranks. The franchise also secured the services of Indian pacers Mohammed Siraj and Prasidh Krishna, making significant investments in their pace attack. International talent was not overlooked, with Gujarat bringing in the likes of Karim Janat, Glenn Phillips, and Gerald Coetzee to strengthen their squad."
}