{
  "type": "team_profile",
  "team_name": "Kolkata Knight Riders",
  "team_id": "1106",
  "owner": "Knight Riders Sports Private Limited",
  "home_ground": {
    "name": "Eden Gardens",
    "city": " Kolkata"
  },
  "titles": [
    {
      "name": "Indian Premier League",
      "count": "3",
      "years": [
        " 2012",
        " 2014",
        " 2024"
      ]
    }
  ],
  "bio": "Owned by Bollywood icons Shah Rukh Khan, Juhi Chawla, and Jai Mehta, the Kolkata Knight Riders had a rough start in the Indian Premier League, enduring three difficult seasons. However, the turning point came in 2011 with the appointment of Gautam Gambhir as captain. His leadership, combined with a solid and experienced batting lineup, breathed new life into the team. The pace attack, spearheaded by Brett Lee, provided much-needed stability, while a talented spin duo of Iqbal Abdulla and Shakib Al Hasan complemented the bowling unit. The all-rounders - Yusuf Pathan and Jacques Kallis - added depth and balance, giving Kolkata a formidable edge. Despite their impressive form, Kolkata's dream of clinching the title was dashed when Mumbai Indians eliminated them in the playoffs during the fourth season. However, the silver lining was their qualification for the 2011 Champions League T20, where, after progressing through the qualifiers, they were knocked out early, failing to make a significant impact on the international stage. The 2012 season saw the return of explosive New Zealand batsman Brendon McCullum, who rejoined the franchise after a three-year absence, adding firepower to their batting. More crucially, Kolkata strengthened their bowling attack with the addition of mystery spinner Sunil Narine, who would go on to play a key role in their success. Determination and hard work culminated in a dramatic victory, as Kolkata won their maiden IPL title by defeating defending champions Chennai Super Kings in the final. Their success was not a one-off; in 2014, they repeated the feat, claiming their second IPL title. From that point on, Kolkata became a consistent contender, always regarded as one of the top teams in the tournament. In 2018, Kolkata made a pivotal change, appointing Dinesh Karthik as their new captain. Under his leadership, the team had a solid run but fell short in Qualifier 2, losing to Sunrisers Hyderabad. The following season, 2019, was a disappointing one for Kolkata as they finished 5th, failing to make the playoffs. In 2020, their fortunes didn't improve, and Karthik stepped down as captain midway through the season, with Eoin Morgan taking over the leadership. Despite a strong start, 2020 ended as a dry spell for the Knight Riders, but in 2021, they managed to bounce back, reaching the final before losing to Chennai Super Kings. Ahead of the 2022 mega auction, Kolkata retained key players like Andre Russell, Sunil Narine, Venkatesh Iyer, and Varun Chakravarthy. They made strategic buys, including their costliest acquisition, Shreyas Iyer, who was later announced as the new captain. Iyer’s leadership brought renewed hope, though the team’s performance remained inconsistent in the 2022 season. The 2024 IPL season marked a period of transformation for Kolkata. A major overhaul saw new faces both on the field and in the coaching staff. One of their most eye-catching moves was acquiring Mitchell Starc for a record-breaking sum in the auction. Their investment paid off as they secured their third IPL title in a thrilling 2024 campaign, a testament to the team’s resilience and strategic acquisitions. As the 2025 season approached, Kolkata faced the challenge of a mega auction that required them to make tough decisions about their title-winning squad. In a difficult move, they had to part ways with captain Shreyas Iyer. Despite these changes, the Knight Riders managed to retain key players like Andre Russell, Sunil Narine, Rinku Singh, Ramandeep Singh, Harshit Rana, and Varun Chakravarthy. In a major move, they spent ?23.75 crore to re-sign Venkatesh Iyer, but the hefty bid meant they couldn’t afford to bring back players like Phil Salt, Nitish Rana, and Mitchell Starc. Despite the changes, Kolkata assembled a competitive lineup and named Ajinkya Rahane as captain, bringing in his extensive leadership experience from domestic cricket with Mumbai."
}